{
  "subject": "Magic Box Paradigm Checklist",
  "credit": "Magic Box Paradigm Checklist",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "3900",
      "title": "Five Types of Buyers",
      "body": "Technology giants (know how to acquire, interested in team), established corporations (need a good sponsor), small public companies, high growth private companies, private equity."
    },
    {
      "id": "3901",
      "title": "Seller Side Drivers",
      "body": "Enthusiasm of deal, other backup options and constraints, assessment of market conditions, engagement and momentum, talent and likeability."
    },
    {
      "id": "3902",
      "title": "Buyer Side Drivers",
      "body": "Buyer Utility, Capacity to Pay, Sponsorship, Cost to Own, Ease of Transfer."
    },
    {
      "id": "3903",
      "title": "Transformation deals",
      "body": "Acquisitions that accelerate the acquirer down an important new path."
    },
    {
      "id": "3904",
      "title": "Goal",
      "body": "You must convince the buyer to believe in your magic box, trust you and your team, be willing to fund your joint expedition to the top of the mountain."
    },
    {
      "id": "3905",
      "title": "Deal",
      "body": "You know you've got them when they no longer want to talk about the numbers but still want to talk about the deal."
    },
    {
      "id": "3906",
      "title": "Be Opportunistic",
      "body": "You are an innovative company looking for the resources to grow.  This may come in the form of investment capital, commercial/distribution partnerships, as customer, or as acquirer. We need a team to help us unlock this magic box."
    },
    {
      "id": "3907",
      "title": "Sponsor",
      "body": "Work close with them to develop outline of product integrations, combined unit economics, rollout and so on.  Don't sidestep them or ignore them."
    },
    {
      "id": "3908",
      "title": "Magic Box",
      "body": "When the box is opened each time it can have a wildly different value to the person opening the box.  Not to mention that a lot of times only the original owner (founder) can open the box and carry it to the top of the mountain."
    },
    {
      "id": "3909",
      "title": "Earnouts",
      "body": "Usually aren't great for buyers or sellers."
    },
    {
      "id": "3910",
      "title": "Time Kills Deals",
      "body": "Too much time and long exclusive periods can kill deals.  Trying to rush a deal in too little time can equally kill a deal.  Make sure to pace yourself in a deal so you have continued energy, information, and excitement to add to the deal."
    },
    {
      "id": "3911",
      "title": "VCs are not partnerships",
      "body": "They have cash but not the distribution channels."
    },
    {
      "id": "3912",
      "title": "Avoid Purchase Exclusivity Periods",
      "body": "They are binding to the seller but do nothing to ensure the earnestness of the buyer.  "
    },
    {
      "id": "3913",
      "title": "Scale",
      "body": "These guys are big and in combination we can create something that the world has never seen."
    },
    {
      "id": "3914",
      "title": "Avoid Jiggery Pokery",
      "body": "The temptation will be to tell potential acquirers that you have a buyer at the table.   This is an ineffectual practice.  Acquisitions take a certain time,  knowing that there is another party involved will either discourage the other party from taking the time to do the deal or stall the deal out with an exclusivity requirement."
    },
    {
      "id": "3915",
      "title": "Sharing Information",
      "body": "The bulk of information a buyer reviews in due diligence shouldn't be confidential.  After that put a good NDA in place with a non-solicitation of your employees or customers and let them go at it.  Get them through due diligence as fast as you can."
    },
    {
      "id": "3916",
      "title": "Vision",
      "body": "Talk about the vision and current strategy but not so much that it stunts their participation in the conversation.  Don't pretend you know all the answers in front of partners, it kills idea formation ."
    },
    {
      "id": "3917",
      "title": "Size of Team",
      "body": "Startups usually don't have a large team so they need to be careful how we allocate resources to sales, fundraising, and partnerships.  "
    },
    {
      "id": "3918",
      "title": "Scarcity",
      "body": "Startup valuation starts with their appreciation of your scarcity.  "
    },
    {
      "id": "3919",
      "title": "Their Idea",
      "body": "Startup acquisitions are driven by a big idea, an idea so big that the buyer has to own it to see it fulfilled.  It has to be their big idea. Don't prescribe to them where you fit. They have a much better idea of where you fit."
    },
    {
      "id": "3920",
      "title": "Entrance, Not Exits",
      "body": "Startup acquisitions are 'entrances' not 'exits'."
    },
    {
      "id": "3921",
      "title": "Metamorphic deals",
      "body": "So substantial they change or enhance the fundamental nature of the resulting combination.  "
    },
    {
      "id": "3922",
      "title": "Partnerships/Acquisitions",
      "body": "Should be seen as 'entrances' not 'exits'."
    },
    {
      "id": "3923",
      "title": "Pace Yourself",
      "body": "Resist the urge to jump into aggressive deal making mode.  Don't rush into getting a term sheet.  You don't want to force an exclusive period.  Only do a term sheet with a very narrow exclusive period once all terms are sorted and market is tested.  You as seller will want to put all priority on this but the buyer will not.  Develop a sense of the buyer's timelines, approvals, and constraints."
    },
    {
      "id": "3924",
      "title": "Better Way to Move The Process Along",
      "body": "Put a date out there.  Ask for indications of interest by a certain date and give a reason why this date is important.  Make sure that there is time for them to do their research.  "
    },
    {
      "id": "3925",
      "title": "Three Primary Forces",
      "body": "Product, distribution, and monetization.  "
    },
    {
      "id": "3926",
      "title": "Breakup Fees",
      "body": "Payments to the seller if the byer walks away.  Not common.   "
    },
    {
      "id": "3927",
      "title": "Sales Pitch",
      "body": "Oren Klaff.  The world is moving, you need to paint a picture of how your current offering is the key to the shifts in the market."
    },
    {
      "id": "3928",
      "title": "Consolidation deal",
      "body": "More of what we already do but with a new twist or done more efficiently."
    },
    {
      "id": "3929",
      "title": "What to include in your presentation",
      "body": "Mission, Problem/Opportunity, Solution, Key Elements, Platform, Strengths, Key Metrics, Unit Economics, User Praise, Media Recognition, Market Size, Market Drivers, Competitive Advantages, Case Studies, Core Competencies, Deep Dive, Technology Stack, Platform Components, Intellectual Property, Company Status."
    },
    {
      "id": "3930",
      "title": "List",
      "body": "Make a list of all the potential partnership opportunities."
    },
    {
      "id": "3931",
      "title": "Limit Team",
      "body": "Keep the number of people from your team small in the beginning."
    },
    {
      "id": "3932",
      "title": "Maneuvers To Keep Deals Moving In Exclusive Periods",
      "body": "Keep periods short, set a fixed date which you receive a definitive agreement, understanding that the buyer must communicate with you within 48hours of any determination they are not going to move forward."
    },
    {
      "id": "3933",
      "title": "Parallel",
      "body": "It's okay to spin up other conversations with other partnerships while you are working on a deal.  "
    },
    {
      "id": "3934",
      "title": "Don't Sell",
      "body": "It's not about selling your company it's about creating opportunities for your startup to be acquired.   Companies are bought not sold.  "
    },
    {
      "id": "3935",
      "title": "What the acquiring party will wonder",
      "body": "Is the startup focused on capital, are they interested in being acquired, are they going to sell and bail, are they committed to the current direction and vision?"
    },
    {
      "id": "3936",
      "title": "Qualified Small Business Stock",
      "body": "If your startup can be meet the requirements of a qualified small business stock and you've held shares for more than 5 years, some or all of your gain may be free of federal tax or you can roll it into another small business."
    },
    {
      "id": "3937",
      "title": "Don't Worry About Being Copied",
      "body": "If you have something proprietary, they will see the difficulty in replicating its value.  You can also go to their competitor and sell the finished version."
    },
    {
      "id": "3938",
      "title": "Threat of Process",
      "body": "If you have several targets interested who you think could act quickly, try to get one of them to move pre-emptively.  First, set up everything to do a formal process for a period of certain time with all interested parties.  Make sure you have all the materials ready.  Second, call one of the partnership opportunities and tell them that you plan to enter a process for all parties but that you want to give them the first chance to preempt the process by making an offer now."
    },
    {
      "id": "3939",
      "title": "Who Speaks First",
      "body": "If the value of an asset is relatively determinable, then it's best for the seller to speak first ('setting a high anchor').  If the value is hard to determine, then the seller is better advised to let the buyer make the first offer.  "
    },
    {
      "id": "3940",
      "title": "Buy Tax Write Off",
      "body": "If a company acquires another company, they can often use losses from the new company (time developing product without profit) and deduct that from their tax bill."
    },
    {
      "id": "3941",
      "title": "Scarcity",
      "body": "I know I need this and there isn't another one like it out there."
    },
    {
      "id": "3942",
      "title": "Strategy",
      "body": "Everything comes at a price, strategy is maximizing the various competing forces."
    },
    {
      "id": "3943",
      "title": "3 Main Terms",
      "body": "Economics and form of consideration, structure and taxes, risk allocation."
    },
    {
      "id": "3944",
      "title": "It Takes Time",
      "body": "Don't wait to long to start developing relationships with partners/acquirers."
    },
    {
      "id": "3945",
      "title": "Financials",
      "body": "Don't include detailed financial statements early on."
    },
    {
      "id": "3946",
      "title": "Publicity",
      "body": "Develop thought leadership so partnership opportunities will come to you."
    },
    {
      "id": "3947",
      "title": "Complexity",
      "body": "Deals fail because of complexity.  Keep them simple.  "
    },
    {
      "id": "3948",
      "title": "Incremental deals",
      "body": "Combinations that bring about operational synergies, but not much more."
    },
    {
      "id": "3949",
      "title": "Attorney",
      "body": "Bring in your attorney before you start negotiating terms.  "
    },
    {
      "id": "3950",
      "title": "Chance of Success",
      "body": "Agreed to join forces and have sorted out high level economic terms (50% chance of succeeding).  Lawyers get involved and definitive agreements are underway (80% chance succeeding).  "
    },
    {
      "id": "3951",
      "title": "Avoid Exclusives",
      "body": "Advance them in the process as far as you can prior to doing any exclusives.  "
    },
    {
      "id": "3952",
      "title": "Big Companies Would Rather Not Buy",
      "body": "Acquisitions are hard, expensive, and risky.  They only buy when they believe they have no other way to get where they believe they need to go."
    },
    {
      "id": "3953",
      "title": "Asset Purchases",
      "body": "A way for the buyer to acquire a startup's assets without actually buying the company itself.  This helps create an avoidance of unknown liabilities."
    },
    {
      "id": "3954",
      "title": "Bidding War",
      "body": "A Seller is usually the casualty in a bidding war.  Bidding wars can drive the potential price up but the deal will usually have weeks or months before closing and that can be ample time for both bids to fall apart.  If one bid falls apart it is very likely that the second one will follow suit just out of fear that they are missing some piece of information that the other bidder knows."
    },
    {
      "id": "3955",
      "title": "Typical Team Retention Plan",
      "body": "12 to 24 months. Be ware that headhunters may circle around key startup players.  "
    }
  ]
}

