{
  "subject": "ASPIRING BUSINESS PHILOSOPHIES",
  "credit": "ASPIRING BUSINESS PHILOSOPHIES",
  "topic": "Innovators",
  "todos": [
    {
      "id": "376",
      "title": "Toby Rush Words of Wisdom",
      "body": "Your family, friend, and God will love you regardless of whether your business is a success or failure."
    },
    {
      "id": "377",
      "title": "Devon Rule ' Fight the process, not the market forces",
      "body": "You get a good product from having a good company.  You don't get a good company from having a good product."
    },
    {
      "id": "378",
      "title": "Finite Triangle Rule",
      "body": "You can be first, better, and cheaper, but only two of the three."
    },
    {
      "id": "379",
      "title": "Jen-Kuang Mastery Theory",
      "body": "Understand the critical skills necessary for your craft, working repetitively on the skills that you are bad at, and have a mentor to guide you."
    },
    {
      "id": "380",
      "title": "Prisoner's Dillemma",
      "body": "Two prisoners in jail.  If neither squeals, both go free.  If they both squeal they both get hanged.  If only one prisoner squeals, they go free with a reward.  Both prisoner's are better off if neither squeal.  Although, if one risks squealing and the other doesn't, they get rewarded even greater.  This applies to competition.  If two firms compete (squeal) they both are worse off but one may pull ahead."
    },
    {
      "id": "381",
      "title": "Jobs Obsession Theory ",
      "body": "There must be a story behind every design/plan, inspire perfection.  Be the best in the world at what you do."
    },
    {
      "id": "382",
      "title": "Growth Rule",
      "body": "There are only two things you can invest in that will add to the sustained growth of your company, marketing and innovation.  "
    },
    {
      "id": "383",
      "title": "Product/Market Fit Rule",
      "body": "The success of a startup company is having a good team, good product, and good market.  Having a good market is the most important. Do whatever is required to get the product to fit the market, including changing out people, re-writing your product, moving into different markets, telling customers no/yes when you don't want to, raising another round of capital, conserving capital."
    },
    {
      "id": "384",
      "title": "Ries Rule",
      "body": "The modern rule of competition is that whoever learns fastest wins.  "
    },
    {
      "id": "385",
      "title": "Zuckerberg Rule",
      "body": "The biggest risk is to take no risk."
    },
    {
      "id": "386",
      "title": "EVA Challenge Rule",
      "body": "Taxes show up in the year that they are paid, not when they are deferred.  "
    },
    {
      "id": "387",
      "title": "Telesis Business Philosophy",
      "body": "Synergies, uninterrupted sales process, transparency, record keeping, regression studies, and data analysis."
    },
    {
      "id": "388",
      "title": "Story & Hustle",
      "body": "Sell the story of your product, not its features.  Let the story become viral.  Build your brand with a narrow and deep story about what you are doing.  Make sure the sales process is uninterrupted and perfectly timed out each time.  This process works for recruiting as well.  "
    },
    {
      "id": "389",
      "title": "Buffet Investment Philosophy",
      "body": "Read everything you can.  Then jump in the water-take a small amount of money and do it."
    },
    {
      "id": "390",
      "title": "Growth Rule",
      "body": "Progress happens when it takes less time and resources to do the same task you did yesterday.  "
    },
    {
      "id": "391",
      "title": "Pioneer v. Settler Rule",
      "body": "Pioneers get shot in the back and settlers make all the money.  You don't want to be the first one to try out an idea, you want to be the first one that get's the product to market."
    },
    {
      "id": "392",
      "title": "Alan Kay Software Theory",
      "body": "People who are really serious about software should make their own hardware."
    },
    {
      "id": "393",
      "title": "Milano Rule",
      "body": "Option value is created when you have the right, but not the obligation to invest.  Do not commit too early.  "
    },
    {
      "id": "394",
      "title": "Will Scott Rule",
      "body": "Only give away the minimal amount of information to accomplish your goals and impress the other side.  Don't show all your cards at once, people could use it against you.  "
    },
    {
      "id": "395",
      "title": "Tooze Rule",
      "body": "Only collect the data you need to solve the problem at hand.  "
    },
    {
      "id": "396",
      "title": "Blank Rule",
      "body": "No business plan should survive the first contact with a customer."
    },
    {
      "id": "397",
      "title": "Get One Thing Right",
      "body": "Make one great thing, get one thing completely right.  That earns you the right to go from product one to product two."
    },
    {
      "id": "398",
      "title": "Tooze Rule",
      "body": "Limit the amount of inputs required to develop a product.  "
    },
    {
      "id": "399",
      "title": "Critical Path",
      "body": "Know the critical path and do everything to get it done.  The hardest things are usually the things you need to do first.  "
    },
    {
      "id": "400",
      "title": "Simple Stages Theory",
      "body": "Keep it simple.  The four stages in order of idea greatness are  simple stupid, complex stupid, complex smart, and simple smart.  Always strive for simple smart.  "
    },
    {
      "id": "401",
      "title": "Strength of Weak Ties",
      "body": "It's the people you don't know very well in your life that help ideas, especially new ones spread."
    },
    {
      "id": "402",
      "title": "Tooze Rule",
      "body": "Invest in technology for clients that do not have the domain knowledge nor the in-house staff to develop such technology (value propositioning)."
    },
    {
      "id": "403",
      "title": "Buffet Investment Philosophy",
      "body": "Invest in strong management and economics.  Make few decisions and stick with them until the end."
    },
    {
      "id": "404",
      "title": "Carnegie Rule",
      "body": "Invest in relationships."
    },
    {
      "id": "405",
      "title": "Hoffman Minimum Viable Product Rule",
      "body": "If you're not embarrassed by the product when you launch, you've launched too late."
    },
    {
      "id": "406",
      "title": "Matsushita Rule",
      "body": "If we cannot make a profit, that means we are committing a sort of crime against society.  We take society's capital, we take their people, we take their materials; yet without a good profit (or value-added), we are using precious resources that could be better used elsewhere.  "
    },
    {
      "id": "407",
      "title": "Lesley Hayes Theory",
      "body": "Hire the people that are smart as shit and least like you.  They will drive you crazy but help you discover the blind spots that truly help you gro.  See Johari Window.  "
    },
    {
      "id": "408",
      "title": "Persistency Rule",
      "body": "Google pitched their idea to 250 investors before landing on a partner."
    },
    {
      "id": "409",
      "title": "Economic Theory",
      "body": "Good businesses have low competition, monopoly power, barriers to entry, low overhead/fixed costs, high margins, economies of scale, product differentiation, high demand, low alternative supply, ability to scale, competitive advantage, liquidity. (See Economic Checklist)."
    },
    {
      "id": "410",
      "title": "Devon Rule",
      "body": "Good advisors ask the right questions and share experiences."
    },
    {
      "id": "411",
      "title": "Chief Financial Management Philosophy ",
      "body": "Foster an environment of strong financial management and accounting that leads to better business decisions.  Use accrual accounting."
    },
    {
      "id": "412",
      "title": "Devon Rule",
      "body": "Everybody profits the most when we are all put in positions that maximize our strengths.  When someone is not in the right seat, you need to help them find the right seat, including yourself.  "
    },
    {
      "id": "413",
      "title": "EVA Challenge Rule",
      "body": "EVA uses sinking fund depreciation.    "
    },
    {
      "id": "414",
      "title": "EVA Challenge Rule",
      "body": "EVA should be used to manage the finances of a company, measure the value a company, and incentivize the company's employees."
    },
    {
      "id": "415",
      "title": "EVA Challenge Rule",
      "body": "EVA is defined as net operating profit after tax (NOPAT), less a capital charge that reflects a firm's cost of capital.  "
    },
    {
      "id": "416",
      "title": "EVA Challenge Rule",
      "body": "EVA includes the amortization of items that are typically expensed such as research and development, advertising and promotion, and staff training and development.  "
    },
    {
      "id": "417",
      "title": "Economic Value Added Growth Rule",
      "body": "EVA can be enlarged by  (1) 'building' ' committing new capital to initiatives that promise a return in excess of the cost of capital, (2) 'operating' ' increase the cash rate of return without tying up any new capital (may include outsourcing), (3) 'harvesting' ' withdraw capital from activities that are not expected to provide an adequate return.  "
    },
    {
      "id": "418",
      "title": "Seacrest Development Rule ",
      "body": "Eighty percent of the value added to a project happens before you sign the dotted line."
    },
    {
      "id": "419",
      "title": "Ridge Overhead Rule",
      "body": "Don't be overhead intensive."
    },
    {
      "id": "420",
      "title": "SEAL Motto Theory",
      "body": "Do now what others won't so in the future you can do what others can't.  Forge mental toughness.  Win in your mind first.  "
    },
    {
      "id": "421",
      "title": "Tooze Rule",
      "body": "Do as much as you can with as few assets as possible.  "
    },
    {
      "id": "422",
      "title": "Joel Stern Rule",
      "body": "Companies with either exceptionally broad or narrow scope tend to produce high ROIs, while medium scope firms experience low returns.  Don't be stuck in the middle.  "
    },
    {
      "id": "423",
      "title": "Bottom Three Rule",
      "body": "Always know your worst three performing assets or people and constantly be working to turn them around or get rid of them.  It's okay to abandon strategies or projects, but not the long-term goal.  Know the difference between a team and a family."
    },
    {
      "id": "424",
      "title": "Total Solution Rule",
      "body": "A total product not only focuses on the features of the product but how it is marketed, delivered, serviced, and supported.  "
    },
    {
      "id": "425",
      "title": "Paul Romer Rule",
      "body": "A good crisis is a terrible thing to waste."
    },
    {
      "id": "426",
      "title": "Larry Page Theory",
      "body": "'Have a healthy disregard for the impossible.'"
    }
  ]
}

