{
  "subject": "Assertiveness, Radical Candor Checklist",
  "credit": "Assertiveness, Radical Candor Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "427",
      "title": "Fuel",
      "body": "Use anger as a fuel to propel positive change."
    },
    {
      "id": "428",
      "title": "Assertive Communication",
      "body": "Respectful, direct, honest, open, non-threatening, and non-defensive.  "
    },
    {
      "id": "429",
      "title": "Listen",
      "body": "Paraphrase and repeat what you heard.  "
    },
    {
      "id": "430",
      "title": "Our Way",
      "body": "It is not your way or my way but a whole new way."
    },
    {
      "id": "431",
      "title": "Curiosity",
      "body": "Is understanding your own judgements and getting curious about others."
    },
    {
      "id": "432",
      "title": "Silence",
      "body": "Is golden, after making a direct and bold statement.  "
    },
    {
      "id": "433",
      "title": "Be Concise and Direct",
      "body": "Impact of your speech is inversely related to the length of your speech.  Don't beat around the bush, give short explanations."
    },
    {
      "id": "434",
      "title": "Boundaries",
      "body": "Demark you, others and aspects of you.  Must be set in words and followed up with consistent action.  Boundaries can relate to material possessions, physical boundaries, mental boundaries, emotional boundaries, sexual boundaries, and spiritual boundaries."
    },
    {
      "id": "435",
      "title": "Be Courteous",
      "body": "Communication is to impart information and feelings, not to vent, tease, avenge or scold. Don't raise your voice and communicate your experience.  Don't judge others."
    },
    {
      "id": "436",
      "title": "Be Congruent",
      "body": "Actions and non-verbal communication must match your words.  Don't send mixed messages.  Don't be sarcastic or hurtful.  "
    },
    {
      "id": "437",
      "title": "Actions",
      "body": "Your kindness is in actions as well as your words.  "
    },
    {
      "id": "438",
      "title": "Bill of Rights",
      "body": "You have a right to privacy, to say no, to be addressed courteously, to change your mind or cancel on people at times, to ask employees to do things your way, to ask for help, to be left alone, right to tell the truth and facts the way I see them, to conserve your energy, to control who touches your body, and to not answer a question, the phone, or an email.  Create your own personal bill of rights.  "
    },
    {
      "id": "439",
      "title": "Observe Yourself",
      "body": "Write down conversations where you expressed something in words or actions contrary to what you thought.  "
    },
    {
      "id": "440",
      "title": "Own It",
      "body": "We've got to own what happens to us in life and rise above it.  "
    },
    {
      "id": "441",
      "title": "Take Positions",
      "body": "Use the word 'I' to describe your boundaries, feelings, thought or needs.  Don't tell the other person what they should do or what some expert said.  "
    },
    {
      "id": "442",
      "title": "Encourage Candor",
      "body": "Reward it.  Open yourself up as the first person to receive feedback.  "
    },
    {
      "id": "443",
      "title": "Timing",
      "body": "Praise in public, criticize in private.  "
    },
    {
      "id": "444",
      "title": "Say No",
      "body": "No is a complete sentence.  Say 'I'd rather not discuss it' if you can't give a good answer.  An alternative is to say 'I'll think about it.'  Don't feel like you need to explain or justify."
    },
    {
      "id": "445",
      "title": "Self-understanding",
      "body": "Mastering and calming your own fears."
    },
    {
      "id": "446",
      "title": "Understanding before process",
      "body": "Listen to understand the other person.  Most of the time all they want to do is be listened to.  "
    },
    {
      "id": "447",
      "title": "Lead with facts",
      "body": "Leading with facts vs. assumptions."
    },
    {
      "id": "448",
      "title": "Vulnerability",
      "body": "Is not weakness but the courage to expose your truths and take risks."
    },
    {
      "id": "449",
      "title": "Candor",
      "body": "Is not how you say it, it is how the other person perceives it.  You might have to say it several times, each in harsher words until you can see it stick with them.  The less you know the person, the less you know how they will take it.  You may have to start softer.  "
    },
    {
      "id": "450",
      "title": "Constructive Criticism",
      "body": "If we are doing this right it is going to be uncomfortable.  "
    },
    {
      "id": "451",
      "title": "Debate v. Criticism",
      "body": "Debate is working to uncover the truth.  It happens usually once and is often done in public.  Criticism is a pattern of behavior that is recurring and should be done in private."
    },
    {
      "id": "452",
      "title": "Ruinous Empathy",
      "body": "By avoiding conflict you end up creating more conflict.  "
    },
    {
      "id": "453",
      "title": "Behaviors, not people",
      "body": "Being upset with actions and things, never with people."
    },
    {
      "id": "454",
      "title": "Timing",
      "body": "Be aware of what is going on in their lives and provide feedback in a timely manner."
    },
    {
      "id": "455",
      "title": "Investors",
      "body": "Are usually not as candid because they have seen many deals fail and succeed for different reasons that they would not have expected.  You really need to work candor out of them."
    },
    {
      "id": "456",
      "title": "Non-Verbal",
      "body": "70% of communication is nonverbal including, gestures, eye contact, posture, physical appearance, body movement, facial expression, skin color, and smell."
    }
  ]
}

