{
  "subject": "AUTOMATIC CUSTOMER CHECKLIST",
  "credit": "AUTOMATIC CUSTOMER CHECKLIST",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "457",
      "title": "All You Can Eat",
      "body": "Unlimited access to a warehouse of value.  Invite people to share their content.  Must frequently add new content."
    },
    {
      "id": "458",
      "title": "CHOICES TO CASHFLOW YOUR GROWTH",
      "body": "Subscription businesses put stress on cash flow in the short-term.  Companies can   1. Rob cash from other divisions to fund their subscription mode.  2. Look to outside investors.  3. Charge subscription fee up-front."
    },
    {
      "id": "459",
      "title": "LOSS LEADER SUBSCRIPTIONS",
      "body": "Some companies entice subscriptions so that they can build a relationship with a customer and get him to purchase more goods."
    },
    {
      "id": "460",
      "title": "MONTHLY RECURRING REVENUE (MRRR)",
      "body": "Small companies (under $5m in revenue, 2-4% churn) are usually valued at 24-48 times MRR.  Mid sized companies (over $5 m, 25-50% growth, 1.5% churn) are valued at 48-72 times MRR.  Fast growth companies (over $5m, over 50% growth, less 1% churn) can be valued at 72-96 times MRR.  "
    },
    {
      "id": "461",
      "title": "SUBSCRIPTION FATIGUE",
      "body": "Shock customers get when they see all the subscriptions on their monthly bank statements."
    },
    {
      "id": "462",
      "title": "Front of the Line Model",
      "body": "Selling priority access to a group.  You are declaring that not all customers are treated equal.  For businesses that have a wide variety of customer personality types.  "
    },
    {
      "id": "463",
      "title": "SELLING TECHNIQUES",
      "body": "Provide a ridiculous amount of value (10x their alternative choice).  Give customers an ultimatum, not multiple choices.  Freemium option.  Offer a trial.  Offer your subscription as a gift.  Set fire to the bridge."
    },
    {
      "id": "464",
      "title": "PRICE HIGH ' GO FOR QUALITY",
      "body": "Pricing subscriptions higher makes consumers want to use the service more so that they get their money's worth.  "
    },
    {
      "id": "465",
      "title": "PRICE LOW ' GO FOR QUANTITY",
      "body": "Pricing lower encourages more members.  "
    },
    {
      "id": "466",
      "title": "Membership Model",
      "body": "Pay to access information or master a skill."
    },
    {
      "id": "467",
      "title": "SURVEY DILEMMA",
      "body": "Once you survey your customers, they will expect you to use the data to improve your interaction with them.  "
    },
    {
      "id": "468",
      "title": "CAC PAYBACK PERIOD",
      "body": "Number of months it takes to make back the cost of acquiring a customer.  Payback periods should be 6-18 months for small and medium busineses and 24-36 months for large products.  Under 6 months and you should scale up quickly.  "
    },
    {
      "id": "469",
      "title": "LIFETIME VALUE OF SUBSCRIBER (LTV)",
      "body": "MRR time number of months customers stay with you.  "
    },
    {
      "id": "470",
      "title": "CHURN RATE",
      "body": "MRR at beginning of month divided by amount of lost MRR in the month.  You want to get churn down to as little as 1 - 5% and where during the life of the customer you have earned three times what you spent to acquire them."
    },
    {
      "id": "471",
      "title": "BENEFITS OF SUBSCRIPTION BUSINESSES",
      "body": "More predictable demand.  More contact with clients.  Get paid automatically."
    },
    {
      "id": "472",
      "title": "FLOAT",
      "body": "Money is made by collecting customers cash upfront and keeping the interest received from investing the funds.  "
    },
    {
      "id": "473",
      "title": "KEEP CUSTOMERS",
      "body": "Make sure customers are using the subscription frequently or they will cancel it.  Give them quick wins.  Charge up front so they make sure to use it.  Drop a happiness bomb (do something nice for them).  Large businesses are more stable user and have greater switching costs.  Focus on net-churn.  If some cancel, make sure others are upgrading.  "
    },
    {
      "id": "474",
      "title": "ONBOARDING",
      "body": "Getting companies to sign up or switch over and get them all set up."
    },
    {
      "id": "475",
      "title": "SALES CHANNELS",
      "body": "Field salespeople.  Telesales.  Self-serve."
    },
    {
      "id": "476",
      "title": "MARGIN",
      "body": "Difference between cost of serving each new customer (COGS) and revenue from customer."
    },
    {
      "id": "477",
      "title": "CUSTOMER ACQUISITION COST (CAC)",
      "body": "Cost you spend on marketing per new customer gained in a period."
    },
    {
      "id": "478",
      "title": "EVENTS",
      "body": "Constant Contact discovered that their best sales technique was hosting events where they could teach people how to use their products.  Apple experienced the same thing with their $99 year unlimited 1 hour service plan at Apple Stores."
    },
    {
      "id": "479",
      "title": "Private Club Model",
      "body": "Accessing what is rare.  Chance to network with best of best.  Exclusivity.  High barrier to entry.  Force them to make a decision."
    },
    {
      "id": "480",
      "title": "LTV > 3 X CAC",
      "body": "A subscription company should have a LTV/CAC ratio of 3 to 1 (the best are as high as 8 to 1)"
    },
    {
      "id": "481",
      "title": "Network Model",
      "body": "Utility of the subscription increases as more people subscribe."
    },
    {
      "id": "482",
      "title": "Simplifier Model",
      "body": "The subscription takes one or more recurring tasks off of persons to do list.  Best for tasks that pile up and you just don't have time to do but save money.  'Set it and forget it.'"
    },
    {
      "id": "483",
      "title": "P&L",
      "body": "Subscription businesses make profit and loss statements look bad.  "
    },
    {
      "id": "484",
      "title": "Surprise Box Model",
      "body": "Shipping a surprise package of certain types of goods to customers each month.  Used to promote products shipped and e-commerce sites."
    },
    {
      "id": "485",
      "title": "Peace of Mind Model",
      "body": "Offers insurance or protection against something your customers hope they will never need."
    },
    {
      "id": "486",
      "title": "Consumables Model",
      "body": "Offer a regularly used product.  "
    },
    {
      "id": "487",
      "title": "SUBSCRIPTION MODELS",
      "body": "-"
    }
  ]
}

