{
  "subject": "Beautiful Constraint",
  "credit": "Beautiful Constraint",
  "todos": [
    {
      "id": "488",
      "title": "Constraints of Method",
      "body": "We are forced to do something a certain way.  "
    },
    {
      "id": "489",
      "title": "Transformer",
      "body": "Uses constraint as an opportunity and increases ambition."
    },
    {
      "id": "490",
      "title": "Marketing",
      "body": "Use drama, surprise, humor, storytelling, exaggerations, bad news, good news, be interesting and don’t be afraid to be mildly offensive."
    },
    {
      "id": "491",
      "title": "Surprise Marketing",
      "body": "Unexpected gains or gifts will amplify positive emotions and bring on greater pleasure."
    },
    {
      "id": "492",
      "title": "Celebrated Maxim",
      "body": "The reasonable man adapts himself to the world, the unreasonable man adapts the world to himself."
    },
    {
      "id": "493",
      "title": "Constraints of Resource",
      "body": "Restricts output because of a limited input."
    },
    {
      "id": "494",
      "title": "Clickers",
      "body": "Remote control devices used to discretely poll audience or take attendance."
    },
    {
      "id": "495",
      "title": "Neutralizer",
      "body": "Refuses to lower ambition but finds a different way."
    },
    {
      "id": "496",
      "title": "Victim",
      "body": "Lowers ambition when faced with a constraint."
    },
    {
      "id": "497",
      "title": "Don’t reinvent the wheel",
      "body": "Look elsewhere for answers to your problems.  "
    },
    {
      "id": "498",
      "title": "Constraints of Foundation",
      "body": "Limiting fundamental element of success."
    },
    {
      "id": "499",
      "title": "Constraints of Time",
      "body": "Limited time to do something."
    },
    {
      "id": "500",
      "title": "Patience (And Consistent Product Period)",
      "body": "Intel found the right amount of time (like 9 month pregnancy) that it takes to fully develop their product).  Something’s just take a certain amount of time no matter how smart or efficient you are."
    },
    {
      "id": "501",
      "title": "Artificial Constraint",
      "body": "Imposing an artificial constraint to see if the group can come up with a solution."
    },
    {
      "id": "502",
      "title": "Alliances",
      "body": "Form mutually beneficial alliances."
    },
    {
      "id": "503",
      "title": "Kludging",
      "body": "Finding a quick and dirty solution cause you have no other object."
    },
    {
      "id": "504",
      "title": "Twofer",
      "body": "Each industry, company, product, process usually has two very strong variables that if met will determine its success.  Learn what those two variables are and put all your resources in them.  "
    },
    {
      "id": "505",
      "title": "Ives Motto",
      "body": "Design takes a remarkable focus and being inquisitive and optimistic."
    },
    {
      "id": "506",
      "title": "Propelling Question",
      "body": "Audi asked there engineers “how can we win Le Mans if our car can go no faster than other cars”.  The responded by creating the first diesel racer that won three years because it had to make fewer pit stops."
    },
    {
      "id": "507",
      "title": "Four Sources of Unreasonableness",
      "body": "As the world changes, regulators, consumer, customer, challenger/disruptors expectations grow and they no longer accept the trade-offs that they once did.  People know want the new “all” as in “I want it all.”"
    },
    {
      "id": "508",
      "title": "Can-Ifs",
      "body": "1. We can if we think of x as y…, 2. We can if we use other people to…, 3. We can if we remove x to allow us to…, 4. We can if we access knowledge of (or if everyone contributes to)…, 5. We can if we introduce a…, 6 We can if we substitute x for y… 7.  We can if we fund it by…, 8.  We can if we mix together things that haven’t been mixed… 9.  We can if we resource it by…"
    },
    {
      "id": "509",
      "title": "Potential Resources",
      "body": "1. Untapped stakeholders, 2. External Partners, 3. Resource Owners, 4. Competition."
    },
    {
      "id": "510",
      "title": "Sales Trigger",
      "body": "Your sales process should trigger an emotional and mental response or association in the buyer."
    },
    {
      "id": "511",
      "title": "Respect Constraints",
      "body": "When a brand stops respecting its constraints and tries to become something it is not it becomes weaker.  Constraints lead to focus and simplicity."
    },
    {
      "id": "512",
      "title": "Past Success (Ruts)",
      "body": "What creates success in the past can become the thing that limits you from success in the future.  "
    },
    {
      "id": "513",
      "title": "Fuel",
      "body": "We need constraints to fuel passion and insight.  Unconstrained teams usually have more conflict because the create constraints in their head to fill the void.  Constraints make it easier to solve a problem.  "
    },
    {
      "id": "514",
      "title": "Deep Listening",
      "body": "Truly listening to underlying problem.  May include shadowing person."
    },
    {
      "id": "515",
      "title": "Resource Curse",
      "body": "Things that are rich in natural resources can often perform worse than things with constraints."
    },
    {
      "id": "516",
      "title": "Can-If",
      "body": "Stop people from saying “we can’t because” and have them start saying “we can if”."
    },
    {
      "id": "517",
      "title": "Leader at Each Table",
      "body": "Split into small groups of 4-6 and have a leader at each table.  "
    },
    {
      "id": "518",
      "title": "Moore’s Law",
      "body": "Some would say that Moore’s law came into the highlight because of Intel’s 18 month planning stage.  "
    },
    {
      "id": "519",
      "title": "Abundance",
      "body": "Scarcity is an opportunity to access abundance elsewhere."
    },
    {
      "id": "520",
      "title": "Mock Up",
      "body": "Mock up covers of magazines or newspapers illustrating what it would read if you achieved your goals and it made front page (“Most Innovative Company in World!”)."
    },
    {
      "id": "521",
      "title": "Little is Big",
      "body": "Little inventions lead to big inventions."
    },
    {
      "id": "522",
      "title": "Dwelling",
      "body": "Going back and forth between optimism and pessimism can be an incredibly motivating force to motivate change.  "
    },
    {
      "id": "523",
      "title": "Power of Three",
      "body": "Explore at least three options."
    },
    {
      "id": "524",
      "title": "Amazing v. Better Than",
      "body": "Don’t focus on your competition, focus on being the best."
    },
    {
      "id": "525",
      "title": "Children",
      "body": "Children raised on excessive possessions and praise, given every opportunity, protected from failure, can fail to develop a true sense of self and will have anxiety because there are too many decisions."
    },
    {
      "id": "526",
      "title": "Legitimacy",
      "body": "By giving examples of companies that have taken constraints and turned them into opportunities, you create legitimacy and buy-in.  Taiwan having no natural resources so it utilizes human resources, Southwest Airlines going from 4 to 3 planes and invents no assigned seat boarding process to increase turnover, Africans painting chickens blue so they won’t get eaten by eagles."
    },
    {
      "id": "527",
      "title": "10x",
      "body": "Be ten times better than anything else out there."
    },
    {
      "id": "528",
      "title": "Step Up",
      "body": "Asking someone to step up and take responsibility to make something happen."
    },
    {
      "id": "529",
      "title": "Priming",
      "body": "Ask everyone for an example of how they had been able to take a constraint in the past and turn it into an opportunity."
    },
    {
      "id": "530",
      "title": "Beautiful Constraint",
      "body": "Ask “how can we make this constraint beautiful.”  Crowd source ideas for constraints."
    },
    {
      "id": "531",
      "title": "Grit",
      "body": "Ability to maintain commitment despite the obstacles."
    },
    {
      "id": "532",
      "title": "Weakest Link",
      "body": "A constraint that is most limiting."
    }
  ]
}

