{
  "subject": "Building Great Software Teams Checklist",
  "credit": "Building Great Software Teams Checklist",
  "todos": [
    {
      "id": "573",
      "title": "Engage with University",
      "body": "Partner with professors, contact university career offices, go to entrepreneur and other events."
    },
    {
      "id": "574",
      "title": "Managing",
      "body": "Your time should appear less important than team’s, care about helping others, listen, don’t be afraid to correct behavior, trust others, be patient, confidence, presence."
    },
    {
      "id": "575",
      "title": "Make Your Company Attractive",
      "body": "What is your presence, curb appeal, website, first impression, culture, about us page, CEO bio."
    },
    {
      "id": "576",
      "title": "Small Teams",
      "body": "The larger the teams the more combinations of communications that will be required.  "
    },
    {
      "id": "577",
      "title": "Less But Better",
      "body": "Take a sniper approach.  Look for les but better qualified recruits."
    },
    {
      "id": "578",
      "title": "Proactive about Rewards",
      "body": "Surprise people with rewards, it will mean more.  "
    },
    {
      "id": "579",
      "title": "Fight for Your Team",
      "body": "Show them you have their back."
    },
    {
      "id": "580",
      "title": "Course Hero’s Principles",
      "body": "Ship early and often, only one project at a time, testing is a first class problem (should never be shortchanged) , communicate openly and freely, always be recruiting.  "
    },
    {
      "id": "581",
      "title": "Reward Recruiting",
      "body": "Reward your internal team to recruit for you.  Every department should be involved in recruiting."
    },
    {
      "id": "582",
      "title": "Always be recruiting",
      "body": "Recruiting never stops.  "
    },
    {
      "id": "583",
      "title": "Hire Recruiter",
      "body": "Recruiters should support the process, not replace it.  Stay actively involved in the process.  "
    },
    {
      "id": "584",
      "title": "10x Programmer",
      "body": "Programmer that is 10x better than the next.  "
    },
    {
      "id": "585",
      "title": "Grind",
      "body": "Prepare yourself for the grind.  It’s about building relationships.  Make recruiting a habit, each day start making relationships with qualified people, search on social sites, ask around about candidates, post jobs."
    },
    {
      "id": "586",
      "title": "Spending",
      "body": "Plan to spend at least $10,000, 100 hours of your time, or a combination of the two to recruit a new hire.  "
    },
    {
      "id": "587",
      "title": "Warning Signs of Losing Confidence",
      "body": "People try to solve problems without you, people go around you, complaining, stop seeking you out for help.  "
    },
    {
      "id": "588",
      "title": "Technical v. Managerial Leadership",
      "body": "Pay attention to both and their synergies.  "
    },
    {
      "id": "589",
      "title": "Outsource/In-source",
      "body": "Outsourcing is not discouraged but remember to develop the knowledge, skill, systems and tools to recruit internally.  "
    },
    {
      "id": "590",
      "title": "Spread Search",
      "body": "Look outside local area.  "
    },
    {
      "id": "591",
      "title": "Project Focus",
      "body": "Keep everyone focused on one thing until complete.  "
    },
    {
      "id": "592",
      "title": "Know Where to Look",
      "body": "In your office, from good school, looking for a job, passionate about product or market, highly experienced in your skill."
    },
    {
      "id": "593",
      "title": "Know Why",
      "body": "If you don’t get a candidate don’t quit until you know why.  "
    },
    {
      "id": "594",
      "title": "Make Interviews Fun",
      "body": "Give tour, give goodies, bring them into activities, ask interesting questions.  "
    },
    {
      "id": "595",
      "title": "Strategy for Visas",
      "body": "Get an immigration attorney, expect to pay $10,000."
    },
    {
      "id": "596",
      "title": "Feature Toggles",
      "body": "Feature that you can activate at any given time.  "
    },
    {
      "id": "597",
      "title": "Experience Not Needed",
      "body": "Experience can be taught."
    },
    {
      "id": "598",
      "title": "Visas",
      "body": "Don’t be afraid to hire abroad.  It costs about $10,000 to go through visa process.  "
    },
    {
      "id": "599",
      "title": "Hiring Decision Checklist",
      "body": "Do they fit culture, are they smart, are they teachable, what will they work on first 90 days, what is their ceiling potential, how do they make us better, are they fun to work around.  "
    },
    {
      "id": "600",
      "title": "Design Stages",
      "body": "Design ready, design in progress, technical architecture review, development ready, development in progress, code review, quality assurance, launch."
    },
    {
      "id": "601",
      "title": "Develop Training Program",
      "body": "Core Principles of Company and Purpose, Workflow, Pair Programming and shadowing, Outline Projects, Introduce Support Structure."
    },
    {
      "id": "602",
      "title": "Grow Yourself",
      "body": "Constantly ask the team how you could do better."
    },
    {
      "id": "603",
      "title": "Top Ten Computer Science Schools",
      "body": "Carnegie Mellon, MIT, Stanford, UC Berkeley, University of Illinois – Urbana Champaign, Cornell, University of Washington, Princeton, Georgia Institute of Tech., University of Texas – Austin."
    },
    {
      "id": "604",
      "title": "Attributes to look for",
      "body": "Candidate has something to teach you, love programming and technology, pleasant to be around, teachable, takes pride in their work, thinks entrepreneurially.  "
    },
    {
      "id": "605",
      "title": "Ship Constantly",
      "body": "Build self sustaining pieces that can be shipped."
    },
    {
      "id": "606",
      "title": "Break Things Down",
      "body": "Break large projects into small chunks."
    },
    {
      "id": "607",
      "title": "Sites",
      "body": "angel.co, linkedin.com, weworkremotely.com, news.ycombinator.com"
    },
    {
      "id": "608",
      "title": "People",
      "body": "   Do everything to work with great people, go where the great people are.  "
    }
  ]
}

