{
  "subject": "Business Canvas Checklist",
  "credit": "Business Canvas Checklist",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "609",
      "title": "Key Activities",
      "body": "How far away are you from a completed product and revenue?  Have you eliminated all technical risks?"
    },
    {
      "id": "610",
      "title": "Key Resources",
      "body": "What is unique or patentable about your product that others cannot copy?"
    },
    {
      "id": "611",
      "title": "Consumer Segments",
      "body": "Is the overall size of the market and your likely market share, sufficient to generate envisaged revenues?"
    },
    {
      "id": "612",
      "title": "Value Proposition",
      "body": "Does your product provide advantages compared to currently deployed solutions?"
    },
    {
      "id": "613",
      "title": "Cost Structure & Revenue Streams",
      "body": "Do your financial projections show proper cash flow?  Do you have a full financial model?"
    },
    {
      "id": "614",
      "title": "Key Partners",
      "body": "Do you and your team members have relevant experience that can be directly applied to the challenges facing this business?  Do you have mentors and advisors to help you along the way?"
    },
    {
      "id": "615",
      "title": "Customer Relationships",
      "body": "Can you demonstrate that customers in your target market will purchase your product or service when available?  Have you done any third party validation?  Have you spoken to experts or associations in your target markets?"
    },
    {
      "id": "616",
      "title": "Channels",
      "body": "Can you confirm that there are no supply chain or distribution barriers?"
    },
    {
      "id": "617",
      "title": "Value proposition",
      "body": "What value do you deliver to the customers; what problems are you solving?  Newness, enhanced performance, customization, getting job done, design, brand/status, price, cost reduction, risk reduction, accessibility, convenience."
    },
    {
      "id": "618",
      "title": "Customer relationships",
      "body": "What type of relationship do you create with customers?  Personal assistance, self-service, automated service, communities, co-creation?"
    },
    {
      "id": "619",
      "title": "Key resources",
      "body": "What resources do you need to deliver the value proposition?  Physical, intellectual, human, financial?"
    },
    {
      "id": "620",
      "title": "Key activities",
      "body": "What activities are key to creating and delivering value proposition?  Production, problem solving, platform/network?"
    },
    {
      "id": "621",
      "title": "Unbundled",
      "body": "There are three types of businesses, customer relationship, product innovation, and infrastructure.  Each has different economics.  "
    },
    {
      "id": "622",
      "title": "Strategy",
      "body": "Market forces (where is market heading, growth potential, customers need and demands, switching costs, what are customers really willing to pay), Industry Forces (who are competitors, new entrants, substitute products, suppliers, stakeholders), Key Trends (technology, regulatory, societal and cultural, demographic), Macro Issues (global economy, capital markets, funding, commodity/supply markets, economic infrastructure).  "
    },
    {
      "id": "623",
      "title": "Channels",
      "body": "How do you reach your customer segment?  Sales force, web sales, influencers, partners, stores, resellers, wholesalers?  "
    },
    {
      "id": "624",
      "title": "Customer segments",
      "body": "For whom are you creating value?  Mass market, niche market, industry, consumers, businesses, segmented, diversified, multi-sided."
    },
    {
      "id": "625",
      "title": "Blue Ocean",
      "body": "Competitive analysis and differentiation.  "
    },
    {
      "id": "626",
      "title": "Key partnerships",
      "body": "What do you insource and what do you reach out for help?  Optimization/economies of scale, reduction of risk, acquisition of particular resources and activities."
    },
    {
      "id": "627",
      "title": "Empathy Map",
      "body": "What do they see (environment, problems, offers), what do they hear (what others say, influencers, media), what do they think (what is important, values, emotional drivers, keeps up at night, dreams, aspirations), what do they say and do (attitude, what they tell others, actions), customer's pain (biggest frustrations, obstacles, risks), what they gain (how do they measure success, how have they achieved goals in past, who are they trying to impress)."
    },
    {
      "id": "628",
      "title": "Cost structure",
      "body": "What are most important costs in your business model?  Cost-driven, value driven, fixed costs, variable costs, economies of scale, economies of scope"
    },
    {
      "id": "629",
      "title": "Long-tail Businesses",
      "body": "Selling less of more diversified products.  Can be as lucrative as the traditional model whereby a small number of bestsellers.  Require low inventory and strong platform costs to make niche content readily available.  "
    },
    {
      "id": "630",
      "title": "Multi-Sided Platforms",
      "body": "Platforms that are valuable to one customer only if the other groups of customer are also present.  Plays off the networking effect."
    },
    {
      "id": "631",
      "title": "Open R&D Process/Patent Pool",
      "body": "Opening patents and innovations to outside companies to help develop.  "
    },
    {
      "id": "632",
      "title": "Telling Your Story",
      "body": "Map your business model with sticky note, replace each note with a drawing, put the drawings in chronological order, tell story."
    },
    {
      "id": "633",
      "title": "Telling story",
      "body": "Make the new tangible (apply colors to canvas), give clarification, engage people by easing them into the logic."
    },
    {
      "id": "634",
      "title": "Bait & Hook",
      "body": "Luring customers with an initial offering and then selling them on follow up sales.  "
    },
    {
      "id": "635",
      "title": "Revenue streams",
      "body": "For what value are your customers willing to pay?  Asset sale, usage fee, subscription fee, lending/renting/leasing, licensing, brokerage fee, advertising?"
    },
    {
      "id": "636",
      "title": "LEGO Digital Designer",
      "body": "Design your own Legos."
    }
  ]
}

