{
  "subject": "THE CHALLENGER SALE",
  "credit": "THE CHALLENGER SALE",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "5965",
      "title": "Network of Advocacy",
      "body": "You've got to build support everywhere within your customers organization to get business."
    },
    {
      "id": "5966",
      "title": "Impact on Customer Saying Yes",
      "body": "Wide support from everyone in customer's organization, seller is easily accessible, seller is easy to buy from, seller is willing to collaborate with other sellers, seller provides best value for best price, seller is flexible and can customize to buyer's needs."
    },
    {
      "id": "5967",
      "title": "Value over Price",
      "body": "Whenever the topic of price comes up a good sales person will direct the conversation to value."
    },
    {
      "id": "5968",
      "title": "Sales Pitch",
      "body": "What you believe as a company.  Review of all your capabilities.  List of top partners.  Map of all your locations.  Must be big, innovative, risky, difficult."
    },
    {
      "id": "5969",
      "title": "Message",
      "body": "We're here to help you think smarter about a part of your business that we have deep expertise."
    },
    {
      "id": "5970",
      "title": "Solution Selling Skills",
      "body": "Understand customers underlying problem better than them (must focus on niche markets to do this), identify new and better ways of addressing those problems, articulate clear benefits from using better solution, determine right metrics to measure success.  "
    },
    {
      "id": "5971",
      "title": "Challenger traits",
      "body": "Teach, tailor, take control (stands their ground, pushing for value and not price).  Must have all three.  Maintains a certain amount of constructive tension across the deal."
    },
    {
      "id": "5972",
      "title": "Sales/Customer Loyalty Checklist",
      "body": "Reps offer unique and valuable perspective on the market, reps help navigate alternatives, reps provide ongoing advice or consultation, reps avoid potential land mines, rep educates on new issues, supplier is easy to buy from, supplier has widespread support within customers organization."
    },
    {
      "id": "5973",
      "title": "Teaching Pitch",
      "body": "Makes customers feel sick about all the money and time they are wasting.  Layout the similar challenges you've seen other companies facing.  Show them the painful path that other customers went down.  "
    },
    {
      "id": "5974",
      "title": "Commercial Teaching",
      "body": "Lead to your unique strengths, challenge customer's assumptions, catalyze action, scale across customers.  "
    },
    {
      "id": "5975",
      "title": "Customer Loyalty",
      "body": "Is most often attributable to sales experience and not final product or price."
    },
    {
      "id": "5976",
      "title": "What Generates Widespread Support",
      "body": "High level of professionalism, unique valuable perspectives, doesn't overstate value or understate difficulty, helps customer avoid landmines, educates, advocates for customer, improves customers professional standing, provides credible and compelling data, rep is readily accessible, understands business and shortens cycle, evaluates alternatives, exerts pressure to efficiently accelerate decision making."
    },
    {
      "id": "5977",
      "title": "Four types of sellers",
      "body": "Hard worker, challenger, relationship builder, lone wolf, reactive problem solver."
    },
    {
      "id": "5978",
      "title": "Customization",
      "body": "Everyone wants it; no one wants to pay for it.  "
    },
    {
      "id": "5979",
      "title": "Focused Learning",
      "body": "Don't try to teach them everything about their industry, teach them the part of their industry (such as information gathering, intelligence, lead gen) where you can really help them."
    },
    {
      "id": "5980",
      "title": "Lead To",
      "body": "DON'T EVER LEAD WITH WHAT YOU DO, LEAD TO WHAT YOU DO.  "
    },
    {
      "id": "5981",
      "title": "Complex v. Small/Low Touch Sales",
      "body": "Different sales take completely different strategies."
    },
    {
      "id": "5982",
      "title": "Challenger",
      "body": "Debaters.  Deep understanding of customers business.  Offers customer unique perspective.  Strong two-way communication skills.  Knows customers value drivers.  Identifies economic drivers.  Comfortable discussing money.  Can pressure customer."
    },
    {
      "id": "5983",
      "title": "Customer Knowledge",
      "body": "Customers don't always know what they need in the first place, a good challenger will listen and look to make sure they are giving the customer what actually will help them."
    },
    {
      "id": "5984",
      "title": "Learning",
      "body": "Customer doesn't want to buy something but to learn something.  "
    },
    {
      "id": "5985",
      "title": "Relationship Building is Out",
      "body": "Constantly hear 'I have a great relationship with this sales rep but I buy from her competition because they provide me a better value.'"
    },
    {
      "id": "5986",
      "title": "Solution Selling",
      "body": "Change from a focus on individual transaction selling to broad-based consultative sales of bundles of products and services.  Meets broader customer needs and the competitors can't easily replicate.  "
    },
    {
      "id": "5987",
      "title": "Sales 80/20.  Eighty percent of value is added by 20% of sales people.",
      "body": "-"
    }
  ]
}

