{
  "subject": "Chasing Cool Checklist",
  "credit": "Chasing Cool Checklist",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "637",
      "title": "Age",
      "body": "Younger wants to be older and older wants to be younger.  Its not about what consumers are but what they want to be."
    },
    {
      "id": "638",
      "title": "Studio 54",
      "body": "You can't sustain a great place if people can buy their way in.  Be selective about who you work with.  Everyone needs to add mutual value.  The experience needs to be proprietary."
    },
    {
      "id": "639",
      "title": "Central Vision",
      "body": "Uniqueness doesn't evolve from design by committee, it comer from a central vision that everyone collaborates with to achieve."
    },
    {
      "id": "640",
      "title": "Ian Schrager",
      "body": "There is no second to the market, there is only first."
    },
    {
      "id": "641",
      "title": "Richard Branson",
      "body": "The time to go into business is when is abysmally run by others."
    },
    {
      "id": "642",
      "title": "Kill Cool",
      "body": "The only way to stay cool is to kill yourself when you're getting hot."
    },
    {
      "id": "643",
      "title": "Risk",
      "body": "The greatest risk is taking no risk.  Avoid don't fuck up mode (DFUM)."
    },
    {
      "id": "644",
      "title": "Educate",
      "body": "Teach people what is cool and useful.  Tell them you are the trend."
    },
    {
      "id": "645",
      "title": "Mission",
      "body": "Stay true to your originality and mission."
    },
    {
      "id": "646",
      "title": "Greener Grass",
      "body": "Singers want to be actors, actors want to be singers, athletes want to be rappers, rappers want to be athletes, the grass isn't always greener."
    },
    {
      "id": "647",
      "title": "Romance the Product",
      "body": "Sell more by displaying less.  Fewer but better choices outperforms more but shittier choices."
    },
    {
      "id": "648",
      "title": "Urban",
      "body": "People from the urban community want in, not to rebel, but to enter the consumer marketplace."
    },
    {
      "id": "649",
      "title": "Tomorrow",
      "body": "Never create for today.  Be two steps ahead."
    },
    {
      "id": "650",
      "title": "Keep stepping",
      "body": "Need to re-establish yourself every 3-5 years."
    },
    {
      "id": "651",
      "title": "Martin Puris Rule",
      "body": "Looking at your neighbors backyard is a surefire way to be second best."
    },
    {
      "id": "652",
      "title": "Travel",
      "body": "Look to see what the rest of the world is doing and how it could apply to your culture.  "
    },
    {
      "id": "653",
      "title": "Streets",
      "body": "Listen to the streets but stay one step ahead."
    },
    {
      "id": "654",
      "title": "Step to the right",
      "body": "Lead, don't follow."
    },
    {
      "id": "655",
      "title": "Surprise",
      "body": "Keep people on the edge of their toes."
    },
    {
      "id": "656",
      "title": "Aesthetics",
      "body": "Is not just the surface, it's the total essence from top to bottom.  Its about taking people on a journey."
    },
    {
      "id": "657",
      "title": "Scott Bedbury",
      "body": "If you are the head of Nike Basketball you better damn know what is going on in the heads of young basketball players, what they listen too, how they talk, how they define success, what they fear, what they dream."
    },
    {
      "id": "658",
      "title": "Pond",
      "body": "If you are a big fish in a little pond, work on growing the pond."
    },
    {
      "id": "659",
      "title": "John Demsey",
      "body": "I love looking at trend reports because they tell me what I shouldn't be doing.  Lead, don't follow."
    },
    {
      "id": "660",
      "title": "David v Goliath",
      "body": "Goliath is mainstream, David is edgy, be David."
    },
    {
      "id": "661",
      "title": "Press Strategy",
      "body": "Going after press for the sake of press is a waste of time."
    },
    {
      "id": "662",
      "title": "Ambassadors",
      "body": "Find the people that will rally behind your cause.  "
    },
    {
      "id": "663",
      "title": "Interior Cool",
      "body": "Don't go outside looking for cool, look inside."
    },
    {
      "id": "664",
      "title": "You",
      "body": "Create something you would want."
    },
    {
      "id": "665",
      "title": "Borrowing Trendy",
      "body": "Borrow trendy words, people, things to integrate.  "
    },
    {
      "id": "666",
      "title": "Quiet",
      "body": "Bigger and louder is the standard operating procedure.  Sometimes it's more noticeable to be quiet.  As noise keeps increasing, people stop listening."
    },
    {
      "id": "667",
      "title": "Microwave",
      "body": "Anything you try to microwave will lead to microwave quality.   Everything you deliver should take time to build."
    },
    {
      "id": "668",
      "title": "First Impression",
      "body": "Always needs to be greeted with a smile."
    },
    {
      "id": "669",
      "title": "Ads",
      "body": "A product has to deliver the promise of its communication."
    }
  ]
}

