{
  "subject": "Cold Email Checklist",
  "credit": "Cold Email Checklist",
  "todos": [
    {
      "id": "807",
      "title": "Keep Persona Narrow",
      "body": "Your target list should be very specific, so your email can be very specific.  An example of a broad persona is CMOs at large companies.  An example of a specific personal is CEOs, Founders, at small technology companies who have recently launched a product and are looking to grow their market base.  1"
    },
    {
      "id": "808",
      "title": "Test",
      "body": "Test your message looking at open rate, response rate, sales generated. 4"
    },
    {
      "id": "809",
      "title": "Metrics for testing emails",
      "body": "Specific v vague, personalized v localized, questions, including numbers, humorous v straight-laced, ways of saying thanks, short v long,  text based v images, link placement, time of day, day of week, follow ups."
    },
    {
      "id": "810",
      "title": "Tailor Towards Your Persona",
      "body": "Signal you are familiar with them and what they do.  Don’t be overly broad.  Include details that are relevant to the recipient, known pain, etc.  1"
    },
    {
      "id": "811",
      "title": "Demonstrate Credibility",
      "body": "Show them social proof. 4"
    },
    {
      "id": "812",
      "title": "Contact",
      "body": "Put all you content in your email signature. 4"
    },
    {
      "id": "813",
      "title": "Presents",
      "body": "Only bring people good stuff that they want. 2"
    },
    {
      "id": "814",
      "title": "Never Assume",
      "body": "Never assume that reader has seen previous emails, knows about you, understands industry standard acronyms/slang, knows how to use certain technologies, product, etc. 1"
    },
    {
      "id": "815",
      "title": "Keep it Informal",
      "body": "Make it feel so they can respond back on their iPhone with typos. 2"
    },
    {
      "id": "816",
      "title": "Logical Assumptions",
      "body": "Make assumptions based on their business, stage of growth, current industry challenges, etc. 3"
    },
    {
      "id": "817",
      "title": "Subject Line",
      "body": "Lure the reader in with a benefit or interesting question.  Must also be a little mysterious so they will want to click and learn more.  1"
    },
    {
      "id": "818",
      "title": "Keep it Short",
      "body": "Keep it two to four sentences at most. 4"
    },
    {
      "id": "819",
      "title": "Research Your Prospect",
      "body": "Include something personal.  3"
    },
    {
      "id": "820",
      "title": "Use Referrals",
      "body": "If possible. 4"
    },
    {
      "id": "821",
      "title": "Put Yourself in Their Shoes",
      "body": "How would you want to receive emails. I would want to know the information quick and not be hassled.  I would want to have keywords in the email that I could search for in the future when I needed to remember what the product was called.  I would want it to come from a person that I could respond to.  4"
    },
    {
      "id": "822",
      "title": "Erase Recipients Concerns",
      "body": "Give them social proof or a guarantee that dealing with you will be risk-free. 4"
    },
    {
      "id": "823",
      "title": "Don’t’ be Self-Focused",
      "body": "Focus on the Reader, Not Yourself.  Your goal is to solve your recipients pain points or learn more about them.  Always write in the second person.  1"
    },
    {
      "id": "824",
      "title": "Get to Point",
      "body": "Don’t waste their time talking about you.  Get to their pain point and offer help. 2"
    },
    {
      "id": "825",
      "title": "Avoid Images",
      "body": "Avoid images and keep signature short.  4"
    },
    {
      "id": "826",
      "title": "Close with a Question",
      "body": "Always require them to do something at the end of the email.  4"
    },
    {
      "id": "827",
      "title": "Include PS",
      "body": "A lot of people will read the p.s. before they read your closing question. 4"
    }
  ]
}

