{
  "subject": "Communication Checklist",
  "credit": "Communication Checklist",
  "todos": [
    {
      "id": "828",
      "title": "Nouns / Who specifically or what specifically",
      "body": "When someone says “they don’t understand us”  make sure you ask “who specifically doesn’t understand you”.  Why?"
    },
    {
      "id": "829",
      "title": "Avoid Words",
      "body": "Like good, bad, better, worse."
    },
    {
      "id": "830",
      "title": "How over why",
      "body": "Why question get you reasons and excuses, how gets you to solutions."
    },
    {
      "id": "831",
      "title": "Too Much / Too Many / Too Expensive / Compared to What",
      "body": "When someone says that something is “too..” something then ask them compared to what.  What are the other alternatives.  "
    },
    {
      "id": "832",
      "title": "NLP Outcome Questions",
      "body": "What do I want, what is the objective, what am I here for, what do I want for you, what do I want for me."
    },
    {
      "id": "833",
      "title": "Verbs / How Specifically",
      "body": "If someone says they are depressed, ask them how specifically they are depressed.  Drill deeper into the meaning."
    },
    {
      "id": "834",
      "title": "But",
      "body": "Avoid using this word, it imposes contradiction.   Instead say, that’s true and here’s something else that’s true.  I appreciate and, I respect and, I agree and…Try to get two people to take opposing sides without using the word but.  "
    },
    {
      "id": "835",
      "title": "Avoid Projected Stories or Verbal Mind Reading",
      "body": "Avoid things like   I know they will like it or I know he hates me.  "
    },
    {
      "id": "836",
      "title": "Universals / All, Every, Never",
      "body": "Avoid making universal statements unless you can guarantee they are true."
    },
    {
      "id": "837",
      "title": "Should/Shouldn’t/Must/Can’t / What would happen if you were to do that",
      "body": "Avoid limiting signals by asking what if you were to do that.  "
    },
    {
      "id": "838",
      "title": "Outcome Framing",
      "body": "Avoid asking people what’s bothering them or what’s wrong.  You will get a long description of the problem.  Instead ask them, what do you want, or how do you want things to change.  You will redirect things from a problem to a solution.  "
    }
  ]
}

