{
  "subject": "Dare to Disagree Checklist",
  "credit": "Dare to Disagree Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "1134",
      "title": "Margaret Heffernan",
      "body": "Dare to disagree Ted talk - YouTube."
    },
    {
      "id": "1135",
      "title": "Yes and",
      "body": "When you disagree, never say 'no', 'I disagree', 'but', instead say 'yes and''"
    },
    {
      "id": "1136",
      "title": "Right questions",
      "body": "The best way to solve an argument is by learning to ask the right question.  "
    },
    {
      "id": "1137",
      "title": "Don't fear conflict",
      "body": "People need to feel safe and comfortable disagreeing with each other.  "
    },
    {
      "id": "1138",
      "title": "Trust",
      "body": "No argument can ever be solved if you don't trust the arguer.  Establish trust first, then work on reason and conclusion."
    },
    {
      "id": "1139",
      "title": "Root problem",
      "body": "Need to get to the root problem of the issue by asking the right questions."
    },
    {
      "id": "1140",
      "title": "Process",
      "body": "If you cannot agree that you will work things out, agree on a process to work things out."
    },
    {
      "id": "1141",
      "title": "Start with reason",
      "body": "For two people to get to the same conclusion they first need to find a foundational reason or outside source that they first agree with.  "
    },
    {
      "id": "1142",
      "title": "Constructive conflict",
      "body": "Finding people that are very different than ourselves and finding ways to engage with them.  It requires a lot of patience and a lot of energy and requires a kind of love.  You have to be prepared to change your mind.  "
    },
    {
      "id": "1143",
      "title": "Show",
      "body": "Construct conflict by showing, not telling.  Use multiple points of reason and past historical evidence that are concrete and real."
    },
    {
      "id": "1144",
      "title": "Ruinous empathy",
      "body": "Avoiding conflict can often be more ruinous to a relationship than if you faced conflict head first."
    },
    {
      "id": "1145",
      "title": "Point ' counterpoint",
      "body": "Arguments should enlighten, by adding information on information or reason on reason, not by getting stuck on one concept."
    }
  ]
}

