{
  "subject": "Leonardo DaVinci Checklist",
  "credit": "Leonardo DaVinci Checklist",
  "topic": "Innovators",
  "todos": [
    {
      "id": "3822",
      "title": "Sense Assessment (Taste)",
      "body": "Taste freshness, enjoy different foods, seek out unique tastes, discern flavors, good cook, appreciate food and drink pairings, avoid junk food, don't eat on run, like taste testings."
    },
    {
      "id": "3823",
      "title": "Sense Assessment (Vison)",
      "body": "Sensitive to color harmonies and clashes, know friends eye colors, look at to the far horizon each day, can describe scene in detail, doodle, draw, alert, sensitive to subtle changes in lighting, picture things in mind."
    },
    {
      "id": "3824",
      "title": "Amor vincit Omnia",
      "body": "Love conquers everything."
    },
    {
      "id": "3825",
      "title": "Art Science Assessment",
      "body": "Like details, always on time, skilled at math, rely on logic, write clearly, articulate, analyze, organized and disciplined, like lists, read in order, imaginative, good at brainstorming, do unexpected, love to doodle, better at geometry than algebra, skip around books, look at big picture not details, lose track of time, rely on intuition."
    },
    {
      "id": "3826",
      "title": "Curiosity Assessment",
      "body": "Keep a journal, take time for contemplation, learn something new everyday, seek out different perspectives, read a lot, learn from children, try to solve problems, open minded, look up new words, visit other cultures, learn another language, solicit feedback."
    },
    {
      "id": "3827",
      "title": "Accelerating Learning",
      "body": "Jump in and make mistakes, repetition, immerse yourself, expand vocabulary, learn unique words and topics, physically or mentally label items, open yourself to the topic."
    },
    {
      "id": "3828",
      "title": "Sense Assessment (Smell)",
      "body": "Have a favorite scent, smells affect emotions, recognize friends by smell, can use aromas to influence moods, can judge food quality by smell, smell the flowers."
    },
    {
      "id": "3829",
      "title": "Curiosity",
      "body": "Great minds have more questions than answers."
    },
    {
      "id": "3830",
      "title": "Sense Assessment (Hearing)",
      "body": "Good listener, can tell when something is off pitch, can sing on key, listen to music regularly, distinguish melody from bass, enjoy silence, attuned to changes in peoples inflection."
    },
    {
      "id": "3831",
      "title": "DaVinci Diet",
      "body": "Fresh and natural, avoid overeating, drink water, minimize sugar and salt, use olive oils and flaxseed, eat free range, vary diet, enjoy wine with dinner, don't eat on the run, listen to your body.  "
    },
    {
      "id": "3832",
      "title": "Seven DaVinci Principles",
      "body": "Curiosity, Experience, Sense, Going up in Smoke, Balance Between Art & Science, Fitness-Grace-Poise, Interconnectedness."
    },
    {
      "id": "3833",
      "title": "Sense Assessment (Touch)",
      "body": "Aware of surfaces around me, sensitive to quality of fabric, like to touch and be touched, give great hugs, listen with hands, when I touch I can tell if it relaxes someone."
    },
    {
      "id": "3834",
      "title": "Seven Intelligences",
      "body": "1. Logical-Mathematical, 2. Verbal Linguistic, 3. Spatial Mechanical, 4. Musical, 5. Bodily, 6. Interpersonal ' Social, 7. Intrapersonal (Self-Knowledge)"
    },
    {
      "id": "3835",
      "title": "Sense Assessment (Synesthesia)",
      "body": "??"
    },
    {
      "id": "3836",
      "title": "Anti-Role-Model",
      "body": "Studying people who can teach you what not to do."
    },
    {
      "id": "3837",
      "title": "SMART Goals",
      "body": "Specific, measurable, accountable, realistic, timely."
    },
    {
      "id": "3838",
      "title": "Belly",
      "body": "Soften your belly to relax and think."
    },
    {
      "id": "3839",
      "title": "Sensory Rich",
      "body": "Sensory rich environments are healthy for people at home, work, and play.  Add art, music, smells, textures, and tastes to an environment.    "
    },
    {
      "id": "3840",
      "title": "Friendship",
      "body": "Reprove a friend in secret but praise him before others."
    },
    {
      "id": "3841",
      "title": "Thought",
      "body": "Pass time each day lost in your own thought and don't rely too much on thoughts of others.  "
    },
    {
      "id": "3842",
      "title": "Natural Inventions",
      "body": "Many of the greatest inventions replicate something already in nature."
    },
    {
      "id": "3843",
      "title": "Seven Experiences",
      "body": "List in your journal your seven most influential experiences."
    },
    {
      "id": "3844",
      "title": "100 Questions",
      "body": "In your journal make a list of 100 questions that are important to you.  Meditate on each question."
    },
    {
      "id": "3845",
      "title": "Idea Places",
      "body": "Identify where you get your best ideas.  "
    },
    {
      "id": "3846",
      "title": "Work Less",
      "body": "Great people sometimes accomplish more when they work less.  May include periods of intense work followed by rest.  "
    },
    {
      "id": "3847",
      "title": "Straight to Nature",
      "body": "Go straight to nature when trying to understand something."
    },
    {
      "id": "3848",
      "title": "Interconnectedness",
      "body": "Ecologically aware, enjoy similes, analogies, metaphors, make connections, see similarities more than differences, holistic, identify patterns, goals are formulated clearly, experience connectedness with all Creation."
    },
    {
      "id": "3849",
      "title": "Fitness-Grace-Poise Assessment",
      "body": "Eat healthy, rest, eat simple, chew well, aerobics, getting stringer, flexible, know when body is tense or relaxed, ambidextrous, coordination, knowledge of anatomy."
    },
    {
      "id": "3850",
      "title": "Sense Excerciser",
      "body": "Draw, make a list of who would be your top ten artists, study aromatherapy, wine tasting, massages,"
    },
    {
      "id": "3851",
      "title": "Mind Mapping",
      "body": "Connecting interworking pieces in a visual diagram.  Helps processing and memory."
    },
    {
      "id": "3852",
      "title": "Going up in Smoke (Sfumato)",
      "body": "Comfortable with ambiguity, attuned to intuition, thrive with change, see humor in life, jump to conclusions, enjoy puzzles, know when feeling anxious, spend time on my own, trust my gut, hold contradictory ideas in my mind, delight in paradox, appreciate conflict in inspiring creativity."
    },
    {
      "id": "3853",
      "title": "Feng Shui",
      "body": "Balance the forces of yin and yang and maximize harmony with nature."
    },
    {
      "id": "3854",
      "title": "Experience Assessment",
      "body": "Acknowledge mistakes, learn from mistakes, debrief events, question conventional wisdom and authority, articulate fundamental beliefs, changed a belief because of practical experience, persevere in face of obstacles, view adversity as opportunity, susceptible to superstition, process for assessing validity, maintain independent thought."
    }
  ]
}

