{
  "subject": "Kick Ass Demo Checklist",
  "credit": "Kick Ass Demo Checklist",
  "todos": [
    {
      "id": "3606",
      "title": "Can you see this improving your churn rate?",
      "body": ""
    },
    {
      "id": "3607",
      "title": "Can you see this increasing conversions?",
      "body": ""
    },
    {
      "id": "3608",
      "title": "Do you see how this will shorten data input?",
      "body": ""
    },
    {
      "id": "3609",
      "title": "Do you think this will increase your conversions?",
      "body": ""
    },
    {
      "id": "3610",
      "title": "I’m curious how do you address . . .?",
      "body": ""
    },
    {
      "id": "3611",
      "title": "What happens when you execute xyz process?",
      "body": ""
    },
    {
      "id": "3612",
      "title": "What is your process  for . . . ?",
      "body": ""
    },
    {
      "id": "3613",
      "title": "When you . . . what happens?",
      "body": ""
    },
    {
      "id": "3614",
      "title": "Would you mind sharing how you . . .?",
      "body": ""
    },
    {
      "id": "3615",
      "title": "Don’t Demo Spaghetti",
      "body": ""
    },
    {
      "id": "3616",
      "title": "Don’t ever lead with what you do, lead do what you do.",
      "body": ""
    },
    {
      "id": "3617",
      "title": "How Questions",
      "body": ""
    },
    {
      "id": "3618",
      "title": "How questions are questions that get to how a buyer does something. How questions allow the sales person to find the real opportunities for the sale. How people do things is what differentiates one company from another. If you want to understand where the opportunities are for your product or service, start asking questions that break down their approaches or processes.  How do they do what they do today. Where are the inefficiencies? Where do they struggle? What frustrates them? What processes create road blocks? What aren’t they doing that creates risk, leaves them exposed or could potentially be costing them money?",
      "body": ""
    },
    {
      "id": "3619",
      "title": "If you can’t get the client to participate in a qualification process (aka as discovery call or sales interview) before the demo, don’t do the demo.  The discovery call is the pre-call you set up BEFORE the demo to get a specific understanding of the prospects unique business needs and objectives. A discovery call done correctly acts as a compass allowing you to know where to take the demo.",
      "body": ""
    },
    {
      "id": "3620",
      "title": "If your working on a complex product or something that might have bugs in it, start the demo with what you know and what you know will work really well.  This will help you and your audience gain confidence in the system.  ",
      "body": ""
    },
    {
      "id": "3621",
      "title": "It’s better to spend more time on a feature and highlight it’s business value than it is to spend a little bit of time on a whole bunch of features.",
      "body": ""
    },
    {
      "id": "3622",
      "title": "It’s Not About You Or Your Product",
      "body": ""
    },
    {
      "id": "3623",
      "title": "No “Ifs”",
      "body": ""
    },
    {
      "id": "3624",
      "title": "NO Qualification Process, NO Demo",
      "body": ""
    },
    {
      "id": "3625",
      "title": "Six Feature Demo",
      "body": ""
    },
    {
      "id": "3626",
      "title": "Start with What’s Most Comfortable",
      "body": ""
    },
    {
      "id": "3627",
      "title": "The only way to ensure “if then” statements don’t creep into the demo is to do a thorough discovery process, identifying as many issues your solution can resolve as possible.",
      "body": ""
    },
    {
      "id": "3628",
      "title": "The six feature demo is the idea that a targeted demo should not highlight or show more than 6 critical features.  In addition to the fact that a customer rarely has more than 3-4 key business problems.  If you’re showing more than 6 features, you’re not giving each feature the appropriate amount time.",
      "body": ""
    },
    {
      "id": "3629",
      "title": "There is NO room for “If’s” in your Demo’s. If you find yourself saying “if,” in the demo when referencing a feature, you’re doing it wrong and you’re headed in the wrong direction.",
      "body": ""
    },
    {
      "id": "3630",
      "title": "This is the most important litmus test in demoing. If you can give a full 45-60 minute demo without every saying “if,” you’ve done a good demo.",
      "body": ""
    },
    {
      "id": "3631",
      "title": "Trial Close / Anchoring",
      "body": ""
    },
    {
      "id": "3632",
      "title": "Trial closing is to gauge whether you client is ready to say yes.  Trial closing should be combined with anchoring which means that the client can see themselves in or using the product.",
      "body": ""
    },
    {
      "id": "3633",
      "title": "Try by asking",
      "body": ""
    },
    {
      "id": "3634",
      "title": "What do I mean by doing a demo without saying “if?” I mean, you never say;  “If you have this problem, then... “Or “If you struggle with this issue then you’ll like this feature.” If you are saying “if” in a demo, you’re doing them wrong. Demoing should be a highly targeted, highly customized experience for the buyers. They should feel the demo they are getting is a customized demo just for them.",
      "body": ""
    },
    {
      "id": "3635",
      "title": "Your customers could care less about you, your product, your company, etc. All they care about is, can you help them run their business. Will their life be better because of your product or service or not?  ",
      "body": ""
    },
    {
      "id": "3636",
      "title": "Your objective is not to highlight every feature your product.  It’s to align the features with the specific problem(s) your buyer is struggling with.  If what you’re showing isn’t connected to a real business problem, don’t show it.  Remember the objective of a demo is to get your buyer to see your product solving their biggest problems or issues. They are not a wall for your demo spaghetti. Don’t through all kinds of shit against them, hoping something sticks.",
      "body": ""
    }
  ]
}

