{
  "subject": "Digital Marketing Checklist",
  "credit": "Digital Marketing Checklist",
  "todos": [
    {
      "id": "1952",
      "title": "Channel",
      "body": "YouTube"
    },
    {
      "id": "1953",
      "title": "Asset",
      "body": "Video on how to tile bathroom."
    },
    {
      "id": "1954",
      "title": "Optimization & Ascension",
      "body": "Optimize for each channel’s search algorithm and develop your customer’s ascension plan (CTA – what to do next).  Traffic isn’t the goal, conversions is the goal."
    },
    {
      "id": "1955",
      "title": "Context",
      "body": "My wife hates the tile in our bathroom."
    },
    {
      "id": "1956",
      "title": "Call to Action",
      "body": "Language should match where you are trying to lead them in the journey.  Best marketing campaigns are the simplest.  "
    },
    {
      "id": "1957",
      "title": "Horizontal Scaling",
      "body": "If results for an avatar are better than average, buy traffic in other ad platforms to boost visibility to that group.  "
    },
    {
      "id": "1958",
      "title": "Ad Grid",
      "body": "Identify in advance the type of people you are targeting and the hooks that are most likely to grab their attention.  Avatars are customer profiles.  Write an ad focused on each profile for each hook.  "
    },
    {
      "id": "1959",
      "title": "DIY Audit",
      "body": "https //www.digitalmarketer.com/diy-seo-audit/?utm_source=lead-magnet&utm_medium=lead-magnet-cross-links&utm_campaign=digital-marketing-guide-evergreen"
    },
    {
      "id": "1960",
      "title": "Evaluation Content Marketing",
      "body": "Going from aware of the problem to aware of the best solution.  Educational, useful resource, software download, pricing page, discount, quiz, webinar.  "
    },
    {
      "id": "1961",
      "title": "Convert",
      "body": "Customer invests with time or money.  The goal is to acquire new customers, not to make sure you are hitting profits.  Conversion sometimes require loss leaders.  "
    },
    {
      "id": "1962",
      "title": "Marketing Campaign",
      "body": "Call to action and traffic source.  Call to action moves customers from one stage of the journey to the next stage.  Traffic source gets your call to action in front of customers."
    },
    {
      "id": "1963",
      "title": "Awareness",
      "body": "Where the person becomes aware of you.  Digital advertising, search marketing, content marketing, social media marketing, community management, copywriting."
    },
    {
      "id": "1964",
      "title": "Hooks",
      "body": "Usually based on these outcomes   what they will have if they do something, how they will feel by accepting your offer, how you can change their average day, how people elevate their status after consuming your offer, social proof, time savings or quickness in getting something they want.  "
    },
    {
      "id": "1965",
      "title": "Optimization",
      "body": "Using the intent-based keyword in the title and description of youtube."
    },
    {
      "id": "1966",
      "title": "Single Campaign Fallacy",
      "body": "Trying to move customers from stranger to promoter in one step.  You need multiple campaigns to achieve this."
    },
    {
      "id": "1967",
      "title": "Re-Engagement Campaign",
      "body": "Triggered campaign designed to re-engage any subscriber who hasn’t had activity in 30 to 60 days.  Get them re-excited, remind them of benefits, what they’ve missed, etc."
    },
    {
      "id": "1968",
      "title": "Three types of emails",
      "body": "Transactional (customer service), relational (engage and nurture), promotional (generating sales).  "
    },
    {
      "id": "1969",
      "title": "Moz, MonitorBacklinks, Ahrefs",
      "body": "Tool to help determine quantity and qualify of back-links.  "
    },
    {
      "id": "1970",
      "title": "Intent",
      "body": "To re-tile the bathroom."
    },
    {
      "id": "1971",
      "title": "Long-Tail Outreach",
      "body": "This is the process of earning mentions from lots of small media players (bloggers, podcasters, etc.) instead of a small number of large media players."
    },
    {
      "id": "1972",
      "title": "Click-Through Rate",
      "body": "The number of clicks divided by the number of impressions on an ad and any other call to action.  "
    },
    {
      "id": "1973",
      "title": "Advocate",
      "body": "Someone who willingly speaks positively about your brand."
    },
    {
      "id": "1974",
      "title": "Indoctrination Campaign",
      "body": "Send immediately after someone subscribes to introduce them to your brand and set expectations.  Welcome, expectations (benefits they get as a subscriber, how you will keep in touch), what they need to do next.  "
    },
    {
      "id": "1975",
      "title": "Current Paradigm of Search",
      "body": "Search is mobile, your site has to be setup right and audited for Google to see you.  Research what’s already working for you target keyword and build something 10x better.  "
    },
    {
      "id": "1976",
      "title": "Ascend",
      "body": "Providing enough value to existing customers so that they buy more.  "
    },
    {
      "id": "1977",
      "title": "Promotional Emails",
      "body": "Promotional content, new gated content, sale announcement, new product release, webinar announcement, event announcement, trial offers, upgrade offers.  "
    },
    {
      "id": "1978",
      "title": "Warm Traffic",
      "body": "People who know you but haven’t bought anything.  "
    },
    {
      "id": "1979",
      "title": "Hot Traffic",
      "body": "People in the conversion stage ready to buy.  Remind them that you still exist.  Upsell.  Offer events, paid webinars, high dollar offers, done for you services."
    },
    {
      "id": "1980",
      "title": "Cold Traffic",
      "body": "People in the awareness stage who have previously never heard of you.   Build trust and establish credibility.  Offer things for free.  Pixel them so you run more ads to them and warm them up.  Segment them by what they click on."
    },
    {
      "id": "1981",
      "title": "Promote",
      "body": "People actively seeking to spread the word about your brand."
    },
    {
      "id": "1982",
      "title": "Transactional Emails",
      "body": "Order Confirmations, Purchase Receipts, Shipping Notices, Account Creation, Return Creation, Support Tickets, Password Reminders, Unsubscribe."
    },
    {
      "id": "1983",
      "title": "Five elements of a campaign",
      "body": "Offer, copy and design (creative), ad scent (look and feel of campaign), targeting.  "
    },
    {
      "id": "1984",
      "title": "Content Marketing",
      "body": "Number one strategy to get customers engaged.  While blogs are a major component of content marketing, they’re only a part of the bigger picture.  It should reflect the full funnel and not just one stage.  Content marketing should help make people  1. Aware, 2. help them Evaluate, and 3. Convert."
    },
    {
      "id": "1985",
      "title": "Triggers That Work",
      "body": "New subscriber, lead magnet request (opt in to lead magnet), event registration, purchase, clicking a link in a segmentation campaign, excitement about your brand, cart abandonment, lack of engagement.  "
    },
    {
      "id": "1986",
      "title": "Relational Emails",
      "body": "New Subscriber Welcome, Gated Content Delivery, Newsletter/Blog Articles, Webinar/Event Confirmation, Survey/Review, Social Update, Contest Announcement, Referral Request."
    },
    {
      "id": "1987",
      "title": "Asset & Channel",
      "body": "Need to market and build unique asset and channel for each of the context and intent statements.  If your hungry and need to find a restaurant, your asset is a list of restaurants and the channel is Local Deal Anyday.  "
    },
    {
      "id": "1988",
      "title": "Search Engine Optimization",
      "body": "Need both technical fine-tuning (SEO Technician) of website along with optimized content and in-linking (Content-Writer).  Wordpress and shopify have a lot of technical SEO in place."
    },
    {
      "id": "1989",
      "title": "Listening",
      "body": "Monitoring and responding to customer service and reputation management issues on the social web.  Track public perception, identify topics you need to talk about, keep a pulse on the industry, perform customer research, identify influencers, conduct competitive research.  Respond quickly, empathize, move to a private channel."
    },
    {
      "id": "1990",
      "title": "Copy",
      "body": "Messaging you use in the campaign.  "
    },
    {
      "id": "1991",
      "title": "Traffic Temperature",
      "body": "Measuring traffic by the stage the customer is in the journey.  Need to match your message to a prospect’s temperature.  "
    },
    {
      "id": "1992",
      "title": "Segmentation Campaign",
      "body": "Manual promotion sent to your entire database with the goal of segmenting your subscribers.  Pique interest, get them to segment themselves based on their interests, send more emails to those who engage, use different content, special offers, coupons, sales, promotions, events, webinars, demos, workshops, one-on-ones to gauge their interest.  "
    },
    {
      "id": "1993",
      "title": "Excite",
      "body": "Making the excitement of the purchase turn into good will and trust through adding maximum value to the customer."
    },
    {
      "id": "1994",
      "title": "Targeting",
      "body": "Making sure you message gets in front of the right audience.  "
    },
    {
      "id": "1995",
      "title": "Four stages of successful social media cycle",
      "body": "listening, influencing, networking, selling."
    },
    {
      "id": "1996",
      "title": "Email campaign metrics",
      "body": "List growth, delivery rate (95%), open rate, click through, unsubscribe, complaint rate.  "
    },
    {
      "id": "1997",
      "title": "SERPS Keyword Rank Checker",
      "body": "Keyword ranking."
    },
    {
      "id": "1998",
      "title": "Engagement Campaign",
      "body": "Interest based triggered campaign after your subscriber takes a specific action.  Acknowledge action, overcome objections, address thoughts and feeling, prescribe next logical step, ask to buy."
    },
    {
      "id": "1999",
      "title": "Ascension Campaign",
      "body": "Interest based campaign immediately following a triggered activity.  Exite, ascend, expedite the value journey, acknowledge action took, congratulate, overcome objections, spell out next logical step.  "
    },
    {
      "id": "2000",
      "title": "Six-Part Model",
      "body": "Intent, context, asset, channel , optimization, and ascension."
    },
    {
      "id": "2001",
      "title": "Vertical Scaling",
      "body": "If a specific hook or avatar is working especially well, create more ad sets to that group on the same platform.  "
    },
    {
      "id": "2002",
      "title": "Context & Intent",
      "body": "Hungry and need to find restaurant, lost and need a map, worried and need a solution, stuck and need instructions, making plans and need some options.  Use autosuggestions to help determine common context and intents.  Intent is to find a restaurant, context is because they are hungry."
    },
    {
      "id": "2003",
      "title": "Creative",
      "body": "Graphic elements of your ad, the image, video or carousel images."
    },
    {
      "id": "2004",
      "title": "Many Search Engines",
      "body": "Google, trip advisor, yelp, YouTube, Pinterest, Amazon, FB, LinkedIN."
    },
    {
      "id": "2005",
      "title": "Customer Profile (Avatar) Research",
      "body": "Google Research.  Interview target profiles.  Who are the authority figures, thought leaders, or big brands in your niche?  What books/magazines/newspapers does your ideal customer read?  What events do they attend?  What websites do they frequent?  Where do they live?  What tools do they use?  What’s specifically unique about this group?"
    },
    {
      "id": "2006",
      "title": "Subscribe",
      "body": "Getting the person’s contact information and permission to contact them.  Ethical bribes, content marketing, email marketing, digital advertising, community management, conversion rate optimization, copywriting."
    },
    {
      "id": "2007",
      "title": "Ascension",
      "body": "Get the user to subscribe to the Home Depot YouTube channel.  Get the user to click on a link to buy a product in the video, etc."
    },
    {
      "id": "2008",
      "title": "Selling",
      "body": "Generating leads and sales.  "
    },
    {
      "id": "2009",
      "title": "Networking",
      "body": "Finding and associating with authoritative and influential individuals and brands on the social web.  "
    },
    {
      "id": "2010",
      "title": "But No One Else Would",
      "body": "Find interests that only your customers would have or know about.  For instance everyone knows about Tiger Woods, only golfers know about Bubba Watson, target people interested in Bubba Watson.  "
    },
    {
      "id": "2011",
      "title": "Top 3 Sources for Paid Traffic",
      "body": "Facebook, Google, YouTube, Pinterest, LinkedIn, and Twitter.  "
    },
    {
      "id": "2012",
      "title": "Influencing",
      "body": "Establishing authority on the web through distribution and sharing of valuable content."
    },
    {
      "id": "2013",
      "title": "Creatives",
      "body": "Do an image search on each hook and see what google comes up with.  Don’t copy.  "
    },
    {
      "id": "2014",
      "title": "Convert Content Marketing",
      "body": "Demo, risk-free trial, customer story, social proof, comparison tables, spec sheet, webinar, events, mini-class.   "
    },
    {
      "id": "2015",
      "title": "Offer",
      "body": "Deliverables, the price, the schedule, how it’s being delivered, and more.  Starting point of a campaign."
    },
    {
      "id": "2016",
      "title": "Engagement",
      "body": "Conversing with your prospects to build a relationship with them.  Content marketing, social media marketing, voting, selecting, email marketing, community management, interviewing."
    },
    {
      "id": "2017",
      "title": "Ad scent",
      "body": "Congruency or sameness throughout campaign in terms of design, messaging, and offer.  Communicate this with your design toolbox.  "
    },
    {
      "id": "2018",
      "title": "Google Auto Fill",
      "body": "Can be a great way to find content.  It shows what people are searching for when you start typing in similar words."
    },
    {
      "id": "2019",
      "title": "Email Marketing",
      "body": "Branding, engagement, acquisition, retention, direct sales, reactivation, generating traffic, getting referrals.  Goal is to move customers from one stage of the journey to the next.  "
    },
    {
      "id": "2020",
      "title": "Awareness Content Marketing",
      "body": "Becoming aware of the problem.  Blog, social media, infographics, photographs, digital magazines, audio podcast, video podcast, microsite, print, magazine."
    },
    {
      "id": "2021",
      "title": "Social Media Bouncing",
      "body": "A social media follower on one channel is exposed to your brand on another channel.  "
    },
    {
      "id": "2022",
      "title": "Formula for success",
      "body": "6-3-1.  If you can spend $10 a day, $6/day on cold traffic to site.  $3/day on turning warm traffic into leads or buyers. $1/day retargeting and selling a higher dollar product."
    },
    {
      "id": "2023",
      "title": "Keyword",
      "body": "“tile my bathroom”"
    }
  ]
}

