{
  "subject": "Do More Faster",
  "credit": "Do More Faster",
  "todos": [
    {
      "id": "2024",
      "title": "Technologies",
      "body": "Hadoop for massive data analysis, memcached for distributed caching, and twisted for event driven programming."
    },
    {
      "id": "2025",
      "title": "Bait and Switch",
      "body": "Customers usually don’t mind a bait and switch if you switch them to something that is more valuable."
    },
    {
      "id": "2026",
      "title": "80/20",
      "body": "Aim to be healthy 80% of the time."
    },
    {
      "id": "2027",
      "title": "Measuring User Behavior",
      "body": "Acquisition – what channels are users coming from, Activation – are users happy with first experience, Retention – are users coming back, Referral – are users telling other users, Revenue- are users spending money."
    },
    {
      "id": "2028",
      "title": "Hiring",
      "body": "A players hire A players while B players hire C players.  "
    },
    {
      "id": "2029",
      "title": "Just Data",
      "body": "You will get a lot of conflicting advice as a startup.  Remember its all just data.  Some recommendations will apply to you and some you should ignore.  Conflicting advice is not bad thing because it teaches you how to weed through everything and make a smart decision.  Try to collect as much data and differing views as possible."
    },
    {
      "id": "2030",
      "title": "Show, don’t tell",
      "body": "Visuals, graphics, videos."
    },
    {
      "id": "2031",
      "title": "Outsource",
      "body": "Things that are not crucial to your business.  Only outsource to things that are a proven scalable leader."
    },
    {
      "id": "2032",
      "title": "Fake Angels",
      "body": "They are there for the gig-flow, not to make investments.  Ask the investor how long they have been making angel investments and how many they have made.  "
    },
    {
      "id": "2033",
      "title": "People",
      "body": "The three most important things in entrepreneurship are people, people, people."
    },
    {
      "id": "2034",
      "title": "Happy Ears",
      "body": "The tendency to hear what one wants to hear."
    },
    {
      "id": "2035",
      "title": "Switch & Pivot",
      "body": "The most successful startups started doing something else.  Success is through hundreds of small and sometimes large adjustments."
    },
    {
      "id": "2036",
      "title": "Execution Machines",
      "body": "The greatest entrepreneurs grind and get it done."
    },
    {
      "id": "2037",
      "title": "Gretsky",
      "body": "Skate to where the puck is going."
    },
    {
      "id": "2038",
      "title": "Two strikes",
      "body": "Screw me once and I will confront you and forgive, screw me twice and we’re done."
    },
    {
      "id": "2039",
      "title": "Entrepreneur characteristics",
      "body": "passion, determination, raw intelligence, agility, resourcefulness, clarity, focus, empathy, leadership, smarter and harder, team dynamics."
    },
    {
      "id": "2040",
      "title": "Feature Creep",
      "body": "New features to a product can actually bring less users.  "
    },
    {
      "id": "2041",
      "title": "Quick Baby Steps",
      "body": "Move fast in small leaps so that you are building a good foundation underneath you.  "
    },
    {
      "id": "2042",
      "title": "C-Corp",
      "body": "Most preferential organizational structure to angels and VCs because of deferred revenue and UBTI (unrelated business tax income).  Default to Delaware."
    },
    {
      "id": "2043",
      "title": "Everythingitis",
      "body": "Most people use a service because it does one thing really well.  Don’t have too many features.  "
    },
    {
      "id": "2044",
      "title": "Failure",
      "body": "Is likely of every venture but with each new iteration you give yourself a better chance.  "
    },
    {
      "id": "2045",
      "title": "Use Your Head Then Gut",
      "body": "Intelligence is the ability to hold contradictory ideas in your head at the same time.  "
    },
    {
      "id": "2046",
      "title": "Raising Money",
      "body": "If you want money, ask for advice.  What someone helps write, they will help underwrite.  Raise the first one-third and the rest will come."
    },
    {
      "id": "2047",
      "title": "Too Late",
      "body": "If you aren’t releasing your crappy bug laden product, you are too late."
    },
    {
      "id": "2048",
      "title": "Agility",
      "body": "Have the perspective that things will rarely go as planned.  "
    },
    {
      "id": "2049",
      "title": "Relationships",
      "body": "Go for the relationship not the sale.  Startups screw up a lot and the relationship is what holds.  "
    },
    {
      "id": "2050",
      "title": "Pain",
      "body": "Focus on the pain before you talk about your solution."
    },
    {
      "id": "2051",
      "title": "Worthless Idea",
      "body": "Every idea is worthless.  Only through execution can you make something happen.  Overvaluing an idea is a red flag.  One can steal ideas but no one can steal execution or passion."
    },
    {
      "id": "2052",
      "title": "Stay Healthy",
      "body": "Don’t work seven days a week, get away (quarterly vacations), be present, meditate, yoga."
    },
    {
      "id": "2053",
      "title": "Prototype",
      "body": "Don’t plan, prototype."
    },
    {
      "id": "2054",
      "title": "Co-Founder",
      "body": "Don’t go at it alone.  Don’t have more than one non-technical founder in a tech company."
    },
    {
      "id": "2055",
      "title": "Product/Sales",
      "body": "Don’t build sales process too early.  Make sure you have a strong process."
    },
    {
      "id": "2056",
      "title": "Ship early",
      "body": "Don’t be ashamed of getting version 1.0 out on the market and iterating on it.  "
    },
    {
      "id": "2057",
      "title": "Issues",
      "body": "Discuss issues quickly with the goal of reaching consensus."
    },
    {
      "id": "2058",
      "title": "Random Days",
      "body": "Days where you will meet with anyone to talk about anything for 15 minutes.  Spurs ideas and creativity.  "
    },
    {
      "id": "2059",
      "title": "Monitor Users",
      "body": "Carefully study what users are doing by monitoring their logs and studying analytics.  You are stupid, listen to your users or you will have none."
    },
    {
      "id": "2060",
      "title": "Raising Money",
      "body": "Bootstrapping, friends, family, church, investomers, partners, grants, angels.  Raising money helps you go faster.  Getting it right takes time and if you don’t have a ton of competitors in the same field don’t be afraid to take your time."
    },
    {
      "id": "2061",
      "title": "Stuck on Idea",
      "body": "Be so stuck on your idea that you can’t quit."
    },
    {
      "id": "2062",
      "title": "83(b)",
      "body": "Allows you to pay taxes on stock ahead of time regardless to vesting so that you don’t have to pay taxes at a much higher value."
    },
    {
      "id": "2063",
      "title": "Don’t Suck at E-mail",
      "body": "1. Respond quickly, even if you are letting them know you will get back to them, 2. Zero inbox, 3. use company e-mail, 4. Keep it to three sentences, 5. Be persistent."
    },
    {
      "id": "2064",
      "title": "Great startup culture",
      "body": "1. Ideas rule, not politics or person, 2. it’s a mission, not a job, 3. Don’t tolerate mediocrity, 4. By frugal and scrappy, 5. Equity and incentive driven, 6. Good communication in bad times, 7. Take care of your needs, 8. Customer-obsessed, 9. Fun."
    },
    {
      "id": "2065",
      "title": "Monitor",
      "body": ""
    }
  ]
}

