{
  "subject": "DRIVE MOTIVATION CHECKLIST",
  "credit": "DRIVE MOTIVATION CHECKLIST",
  "todos": [
    {
      "id": "2074",
      "title": "IMPOSSIBLE TASK TEST",
      "body": "When given an impossible task, do they give up or work until they have three reasons whey it’s impossible and present the best possible creative solution?"
    },
    {
      "id": "2075",
      "title": "CARROTS AND STICKS",
      "body": "Routine work can be outsourced and motivated with rewards and punishments.  Any other use of sticks and carrots increases interest in the short run but guarantees disinterest in long-run.  Rewards and punishment set the perception that the task is tedious and boring."
    },
    {
      "id": "2076",
      "title": "HEALTHY PESSIMISM",
      "body": "Pessimism is important but it creates low levels of subjective well-being.  Do you have a healthy system of constructive criticism?"
    },
    {
      "id": "2077",
      "title": "DELIBERATE PRACTICE",
      "body": "Have you deliberately practiced your trade for 10 years, set goals, timed and measured performance, pushed yourself to do better, repeat, repeat, repeat, focused on your critical strengths, and sought feedback from mentor?"
    },
    {
      "id": "2078",
      "title": "ALGORITHMIC V. HEURISTIC",
      "body": "Following a set path versus breaking from path to discover a novel strategy."
    },
    {
      "id": "2079",
      "title": "BLAME",
      "body": "Do you take blame?"
    },
    {
      "id": "2080",
      "title": "RIVALS",
      "body": "Do you surround yourself with rivals who excel in areas where you are weak?"
    },
    {
      "id": "2081",
      "title": "EDUCATION",
      "body": "Do you require continuous education and big picture learning?"
    },
    {
      "id": "2082",
      "title": "3000",
      "body": "Do you remind yourself that you don’t need to be a master day three is the best way of assuring you will be a master by day 3,000?"
    },
    {
      "id": "2083",
      "title": "PAY MORE",
      "body": "Do you pay more than the average company?"
    },
    {
      "id": "2084",
      "title": "LISTEN",
      "body": "Do you listen to others opinions, especially if they are contrary to your own?"
    },
    {
      "id": "2085",
      "title": "GOAL SETTING",
      "body": "Do you involve others in goal setting?"
    },
    {
      "id": "2086",
      "title": "AUTONOMY/ROWE",
      "body": "Do you hire good people and leave them alone (results only work environment – allow people to work how, when, and where they are most efficient and happy)?"
    },
    {
      "id": "2087",
      "title": "DECISION LATITUDE",
      "body": "Do you give team members the ability to make decisions so they feel in control of their lives?"
    },
    {
      "id": "2088",
      "title": "WORK AND PLAY",
      "body": "Do you encourage ways to make work fun (including time to work on own projects – don’t sign away intellectual property)?"
    },
    {
      "id": "2089",
      "title": "POSITIVE-SUM",
      "body": "Do you encourage a positive sum and not a zero-sum environment?"
    },
    {
      "id": "2090",
      "title": "AUTONOMY AUDIT",
      "body": "Do you conduct an autonomy audit to see how much control team members have over tasks, decisions, work environment, and techniques?"
    },
    {
      "id": "2091",
      "title": "FLAT RATE V. HOURLY RATE",
      "body": "Do you charge a flat rate so workers are motivated to get the project done quicker without exaggerating hours worked (ROWE)?"
    },
    {
      "id": "2092",
      "title": "NEW HIRES",
      "body": "Do you allow all team members to vote on a new hire after a trial period?"
    },
    {
      "id": "2093",
      "title": "PRONOUNS",
      "body": "Do team members refer to the team as we instead of they or I, do they use controlling language such as should or must?"
    },
    {
      "id": "2094",
      "title": "MASTERY",
      "body": "Do team members have the urge to master something new?  "
    },
    {
      "id": "2095",
      "title": "HOME WORK",
      "body": "Can your employees work from home if needed?"
    },
    {
      "id": "2096",
      "title": "OUTSIDE RELATIONSHIPS",
      "body": "Are you monitoring team member’s relationships outside of the team to assess their mental health?"
    },
    {
      "id": "2097",
      "title": "AUTONOMY FREAK",
      "body": "Are you an autonomy freak?"
    },
    {
      "id": "2098",
      "title": "BORING TASKS",
      "body": "Acknowledge that it is boring.  Explain importance.  Allow people to complete it their way."
    },
    {
      "id": "2099",
      "title": "WATCH EYES",
      "body": "“You need not see what someone is doing to know if it is his vocation, you have only to watch his eyes  a cook mixing a sauce, a surgeon making a primary incision, a clerk completing a bill of landing, wear the same rapt expression, forgetting themselves in a function.  How beautiful it is that eye-on-the-object look.”"
    },
    {
      "id": "2100",
      "title": "PROFESSIONALISM",
      "body": "“Professionalism is doing things you are passionate on days that you don’t really feel like doing them.”"
    }
  ]
}

