{
  "subject": "EIGHTY TWENTY PRINCIPAL",
  "credit": "EIGHTY TWENTY PRINCIPAL",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "2177",
      "title": "Non-Linear World",
      "body": "World is not linear and cause and effect rarely are linked in an equal way."
    },
    {
      "id": "2178",
      "title": "Double Down",
      "body": "When something is working well, double and triple your bets.  "
    },
    {
      "id": "2179",
      "title": "Mimicry",
      "body": "Weak resources (non-20%) should either be  1. harvested or 2. mimic stronger resources."
    },
    {
      "id": "2180",
      "title": "Salespeople 80/20",
      "body": "Twenty percent of salespeople generate 80 percent of sales.  Hire more of the same type of salespeople.  Let salespeople hire salespeople like them.  Examine the top salespersons systems.  Switch a successful team from one area to another to flush out structural issues causing failure.  Invest 80 percent of training effort in the top 20 percent."
    },
    {
      "id": "2181",
      "title": "Firms 80/20",
      "body": "Twenty percent of firms make eighty percent of profits in an industry."
    },
    {
      "id": "2182",
      "title": "Manufacturing Defects 80/20",
      "body": "Twenty percent of defects cause 80 percent of quality problems."
    },
    {
      "id": "2183",
      "title": "Application",
      "body": "To apply the 80/20 rule you have to have two sets of related data that each add up to 100 percent."
    },
    {
      "id": "2184",
      "title": "High Value Uses of Time",
      "body": "Things you have always wanted to do, innovative ways of doing things, 20 percent things, things other people tell you can't be done, things that use creativity, things that are vital but you can't get anyone else to do."
    },
    {
      "id": "2185",
      "title": "Johann Wofgang Von Goethe",
      "body": "Things that matter the most.  Must never be at the mercy of things that matter least.   "
    },
    {
      "id": "2186",
      "title": "Winner Takes All",
      "body": "There are some industries (such as acting) where the winners of the industry take everything and nobody wants to work with the runner's up.  These industries are usually highly creative and subjective vs. commodity industries.  Branding and product design can help you make your industry and company more subjective and creative.  "
    },
    {
      "id": "2187",
      "title": "Tex Inefficiencies of Wealth",
      "body": "The more you earn, the more you have to pay in taxes.  "
    },
    {
      "id": "2188",
      "title": "Simple Smart",
      "body": "Smart businesses keep everything simple and only focus on their core 20%.  Outsource as much as you can while staying the best at what you do."
    },
    {
      "id": "2189",
      "title": "Tipping Point",
      "body": "Small amounts of additional effort that causes one object to take lead then quickly increases.  Also known as epidemic theory or viral theory.  A 51/49 split can quickly gravitate towards 95/5 split."
    },
    {
      "id": "2190",
      "title": "Project Manger",
      "body": "Person who can focus all the team members on the few things that really matter.  "
    },
    {
      "id": "2191",
      "title": "Machines 80/20",
      "body": "Machines give eighty percent of the benefit at twenty percent of the cost."
    },
    {
      "id": "2192",
      "title": "Limit Selection",
      "body": "Limit the options that customers can have.  Henry Ford once said that customers could have his Model T in 'any color as long as it's black.'  Apple only released their products in a few colors and usually black, white, or silver."
    },
    {
      "id": "2193",
      "title": "Best 20 Percent Clients (elements)",
      "body": "Large clients, big assignments, large budgets, strong markets."
    },
    {
      "id": "2194",
      "title": "Language 80/20",
      "body": "Language only uses 20% of words for 80% of conversations."
    },
    {
      "id": "2195",
      "title": "Range of Options",
      "body": "In many business concepts, people still want to have access to the 80% of items that lead to 20% of sales because it makes the experience more unique.  Provide these alternative options but don't invest heavily in them and make sure that they are priced higher so that people are motivated to purchase the 20% that you keep in better stock and can price better.  "
    },
    {
      "id": "2196",
      "title": "Can't improve 80%",
      "body": "Improvement of the eighty percent of objects that lead to 20% of results requires harder work and is less rewarding."
    },
    {
      "id": "2197",
      "title": "Marketing 20",
      "body": "Identify the simplest 20 percent of any product marketing message, sales channel, customer feedback mechanism, etc.  Marketing should focus 80 percent of resources on 20 percent of products that are best selling."
    },
    {
      "id": "2198",
      "title": "Human Problem",
      "body": "Humans are very bad at shifting resources from weak (non-20%) to the stronger resources."
    },
    {
      "id": "2199",
      "title": "Low Value Uses of Time",
      "body": "Giving, not guiding, expecting different results from same process, things you are bad at doing, things you hate doing and serve little purpose, things where you always get interrupted, answering the telephone."
    },
    {
      "id": "2200",
      "title": "Harvest",
      "body": "Get rid of eighty percent of business that is unprofitable.  In certain industries such as retail it is okay to keep some of the eighty percent because buyers want options/range of choices.  Most businesses fail to harvest because they are afraid of getting rid of overhead (people, spaces, resources, equipment).  "
    },
    {
      "id": "2201",
      "title": "50/5 Rule",
      "body": "Fifty percent of a company's customers provide 5% to revenues a profits.  Don't focus on the fifty percent."
    },
    {
      "id": "2202",
      "title": "Marketing Myopia",
      "body": "Encouraging companies to be 'customer satisfying' instead of 'goods producing'.  This can have a dangerous effect if you try to extend your company to broad.  "
    },
    {
      "id": "2203",
      "title": "Employee Improvement",
      "body": "Employees can be improved by  1. learning, 2. automation, and 3. better Infrastructure."
    },
    {
      "id": "2204",
      "title": "Industries 80/20",
      "body": "Eighty percent of profits are made by 20% of industries."
    },
    {
      "id": "2205",
      "title": "Happiness 80/20",
      "body": "Eighty percent of happiness happens in 20 percent of time.  "
    },
    {
      "id": "2206",
      "title": "Books 80/20",
      "body": "Eighty percent of book value can be found in 20% of the pages."
    },
    {
      "id": "2207",
      "title": "Clients 80/20",
      "body": "Eight percent of profits come from 20% of clients.  "
    },
    {
      "id": "2208",
      "title": "Investment Philosophy",
      "body": "Buy when everyone else is selling (market is low).  Invest for long-term.  Build you investments on your own expertise.  Use historic P/E ration.  It should be under 12 and never over 17.  If shares fall by 15% sell it.  If they grow by 15% keep it.  "
    },
    {
      "id": "2209",
      "title": "Bestsellers Are NOT Bestsellers",
      "body": "Bestselling items at a given short time are not always in the 20% of best selling items over the long run.  "
    },
    {
      "id": "2210",
      "title": "Simplicity",
      "body": "Be selective of who you work with and what you do.  "
    },
    {
      "id": "2211",
      "title": "Cost of Complexity",
      "body": "As the business becomes more complex its profits fall due to diminishing returns.  Managers love complexity because it makes them feel important and allows them to prove that they can work hard."
    },
    {
      "id": "2212",
      "title": "80/20 Principal",
      "body": "A minority of causes, inputs, or effort usually lead to a majority of the results, outputs, or rewards.  Also known as Pareto Principle, Principle of imbalance, Zipf's principle."
    },
    {
      "id": "2213",
      "title": "Customer v. Client",
      "body": "A customer has a short-term economic relationship with a seller.  A client has a long-term economic relationship with seller."
    },
    {
      "id": "2214",
      "title": "Employees 80/20",
      "body": "80 percent of value of a company is by 20 percent of the employees.  "
    },
    {
      "id": "2215",
      "title": "Computer 80/20",
      "body": "80 percent of computers time and processing power is used to execute about 20 percent of code."
    },
    {
      "id": "2216",
      "title": "Selective Marketing",
      "body": "You efforts should focus on keeping the 20 percent of clients that provide 80 percent of revenue.  You need to provide outrageous but never tiresome service and contact with them.  "
    },
    {
      "id": "2217",
      "title": "Investment Income v. Employment Income",
      "body": "You are more likely to get wealthy from investment income, not employment income.  "
    },
    {
      "id": "2218",
      "title": "Run to It",
      "body": "Whenever you spot a 20 percent activity run to it.  Learn from it.  Submerse yourself in it.  "
    },
    {
      "id": "2219",
      "title": "More is Worse",
      "body": "Volume and economies of scale can eventually lead to diminishing returns due to cost of complexity issues."
    },
    {
      "id": "2220",
      "title": "Allies 80/20",
      "body": "Twenty percent of your allies will add 80 percent of your value.  Choose them carefully.  Treat them as well as you would treat yourself and trust them.  History is driven by individuals who form effective alliances.  Allies help build your network/roots."
    },
    {
      "id": "2221",
      "title": "Intelligent & Lazy (4)",
      "body": "There are four people ' 1. Lazy stupid, 2. Hard-working stupid, 3. Hard-working intelligent, and 4. Lazy intelligent.  Strive to be lazy intelligent.  Employ the hard-working and lazy intelligent.  "
    },
    {
      "id": "2222",
      "title": "How to Impress",
      "body": "The way to impress people, is to know an awful lot about the 20% of causes, inputs, or efforts that lead to a majority of results (first you need to identify the 20%)."
    },
    {
      "id": "2223",
      "title": "Adaption",
      "body": "The reasonable man adapts to the world.  The unreasonable man tries to adapt the world to him."
    },
    {
      "id": "2224",
      "title": "Marginal Utility of Money",
      "body": "The more money you have, the less value an extra dollop of wealth creates.  Also known as reverse triangle.  "
    },
    {
      "id": "2225",
      "title": "Totem Pole",
      "body": "The higher up you are on the totem pole, the fewer but more important responsibilities you should have."
    },
    {
      "id": "2226",
      "title": "Celebrate",
      "body": "Success is underrated.  Make sure to celebrate."
    },
    {
      "id": "2227",
      "title": "Mentorship",
      "body": "Study from the best.  Deliberate practice.  It is very important to have mentors and mentees.  Both add value.  And both must be mutually beneficial.  "
    },
    {
      "id": "2228",
      "title": "Data Analysis",
      "body": "Setting up systems to determine the 80/20 splits.  Includes tracking metrics, tracking customer usage, etc."
    },
    {
      "id": "2229",
      "title": "Iron Fist",
      "body": "Rule with an iron fist but never raise your voice.  "
    },
    {
      "id": "2230",
      "title": "Planning Project",
      "body": "Planning project insures that you target the 20 percent of activities that will lead to 80% of results.  "
    },
    {
      "id": "2231",
      "title": "Twenty Percent Lists",
      "body": "Make lists of the top 20% of everything (ideology, tasks, team, products, goals, allies, competitors, clients, etc.)  Keep the vital few in the forefront of your brain.  "
    },
    {
      "id": "2232",
      "title": "Imperfect Competition",
      "body": "Look for markets where there is 'imperfect competition/monopolies.'  In other words, ask what industries would be the hardest to replicate.  "
    },
    {
      "id": "2233",
      "title": "List and Apologize for 80%",
      "body": "List the eighty percent of tasks that your organization does not do and create a funny and quirky apology for these items that you can quickly send out when asked.  "
    },
    {
      "id": "2234",
      "title": "Time Problems",
      "body": "If you are working on a tough problem, set a time for how long you will spend on it before taking a break so it doesn't ruin your mood.  A lot of the times the answers will develop when you are not thinking about it.  "
    },
    {
      "id": "2235",
      "title": "Happiness Island",
      "body": "Identify your happiness islands.  Identify what is common between your happiness islands and work to mimic those islands."
    },
    {
      "id": "2236",
      "title": "Don't Work Hard",
      "body": "Hard work leads to low returns.  Insight and doing what we want leads to high returns."
    },
    {
      "id": "2237",
      "title": "Client Complaints 80/20",
      "body": "Eight percent of client complaints can be eliminated by correcting only 20 percent of the causes."
    },
    {
      "id": "2238",
      "title": "Lifestyle Questions",
      "body": "Am I living with the right people, do I work the most productive hours, can I exercise or meditate when I want, am I relaxed in my surroundings, does my lifestyle allow me to be creative, do I see close friends enough, am I travelling enough.  "
    }
  ]
}

