{
  "subject": "Einstein Thinking",
  "credit": "Einstein Thinking",
  "topic": "Innovators",
  "todos": [
    {
      "id": "2239",
      "title": "Innovation & Age",
      "body": "Younger people, newcomers, and people with less knowledge are better problem solvers.  "
    },
    {
      "id": "2240",
      "title": "Finite Triangle",
      "body": "You can be smarter, faster, or cheat."
    },
    {
      "id": "2241",
      "title": "Recording Ideas",
      "body": "Vitally important."
    },
    {
      "id": "2242",
      "title": "Break Rules (Cheat)",
      "body": "To be a great problem solver you have to be a natural rule breaker.  When you get older you tend to break less rules."
    },
    {
      "id": "2243",
      "title": "Cheating Tactics",
      "body": "Take an extra turn, use other guy's assets, don't follow rule, define victory flexibly, and make it so you both win."
    },
    {
      "id": "2244",
      "title": "Ambidextrous",
      "body": "Switch hands to activate the other side of your brain."
    },
    {
      "id": "2245",
      "title": "Solution Surfing",
      "body": "Surf through pictures, tv, sounds, etc for ideas."
    },
    {
      "id": "2246",
      "title": "Dwarves",
      "body": "Sneezy (get it all out, vent problem), Happy (put yourself in a good confident mood), Sleepy (sleep on it), Dopey (be ignorant of something), Doc (get advice), Grumpy (find devil's advocate), Bashful (isolation)."
    },
    {
      "id": "2247",
      "title": "Simplify",
      "body": "Simplify."
    },
    {
      "id": "2248",
      "title": "Handkerchief Solution",
      "body": "Mask (become anonymous), Gag (silence dissenter), Cover (cover object and describe it as solution, then ask person what it is), Surrender (to dissenters and offer compromise), Blindfold (listen to a proposal without sight)."
    },
    {
      "id": "2249",
      "title": "Ignorance Audits",
      "body": "Learn more about your blindspot areas.  "
    },
    {
      "id": "2250",
      "title": "Add Limitations",
      "body": "Adding limitations can help you come up with radically new ideas."
    },
    {
      "id": "2251",
      "title": "Combinations",
      "body": "Adding ideas together."
    },
    {
      "id": "2252",
      "title": "Need",
      "body": "You will be much more inventive if your need is greater.  At a certain time when you are making progress cut off your retreat."
    },
    {
      "id": "2253",
      "title": "Simple Solution",
      "body": "When the solution is simple, God is answering."
    },
    {
      "id": "2254",
      "title": "Humor",
      "body": "Use humor to come up with radically new ways of thinking.  "
    },
    {
      "id": "2255",
      "title": "Cerebral Sex",
      "body": "Two way exchange of ideas."
    },
    {
      "id": "2256",
      "title": "Computers",
      "body": "They are useless because they only give you answers."
    },
    {
      "id": "2257",
      "title": "Relearn",
      "body": "The illiterate of the twenty first century will not be those who cannot read and write, but this who cannot learn, learn, and relearn."
    },
    {
      "id": "2258",
      "title": "Motivating People to Do Something",
      "body": "Tell them that their competitor is doing it.  "
    },
    {
      "id": "2259",
      "title": "Generation Gap",
      "body": "Speak to a 12 y.o. and a 92 y.o. about problem."
    },
    {
      "id": "2260",
      "title": "Remove Safety Net",
      "body": "Removing artificial zones of safety such as crosswalks actually made it safer to cross street."
    },
    {
      "id": "2261",
      "title": "Traditions",
      "body": "Remember traditions and norms are not rules and can be broken."
    },
    {
      "id": "2262",
      "title": "Bigger or Smaller ' Sooner or Later",
      "body": "Redefine the problem by making it bigger or smaller or the deadline sooner or later."
    },
    {
      "id": "2263",
      "title": "Publish Goals",
      "body": "Make signs in the office indicating your goals.  "
    },
    {
      "id": "2264",
      "title": "Nature",
      "body": "Look towards bugs and plants to see how you could solve problem."
    },
    {
      "id": "2265",
      "title": "Imagination",
      "body": "Imagination is more important than knowledge (Einstein)."
    },
    {
      "id": "2266",
      "title": "Ignore Old Answers",
      "body": "Identify your top three solutions then set them aside."
    },
    {
      "id": "2267",
      "title": "History",
      "body": "History is a lie agreed upon (Bonaparte)."
    },
    {
      "id": "2268",
      "title": "Party",
      "body": "Have a party or contest to solve the problem (with trophy)."
    },
    {
      "id": "2269",
      "title": "Change Location",
      "body": "Go somewhere you've never been."
    },
    {
      "id": "2270",
      "title": "Isolation",
      "body": "Einstein did his best thinking in isolation.  Don't bounce too many ideas off other people.  Be wary of experts, they got their title from knowing how to play within the rules.  "
    },
    {
      "id": "2271",
      "title": "Wasted Brainpower",
      "body": "Don't waste the brainpower of the people in your organization."
    },
    {
      "id": "2272",
      "title": "Create Symbol",
      "body": "Create fake symbols and equations to solve the problem.  Like creating a fake machine or process."
    },
    {
      "id": "2273",
      "title": "No Bad Ideas",
      "body": "Christopher Columbus had the idea of sailing to Asia by heading West.  The idea was bad for it's intended purpose but ended up being one of the greatest discoveries of all-time."
    },
    {
      "id": "2274",
      "title": "Tool",
      "body": "Change the tool you use to solve the problem."
    },
    {
      "id": "2275",
      "title": "Problem Solving Ideas",
      "body": "Change definition, setup a test, improve motivation, identify and break rule."
    },
    {
      "id": "2276",
      "title": "Idea Board",
      "body": "Board of crazy problem solving ideas."
    },
    {
      "id": "2277",
      "title": "Ask Child",
      "body": "Ask a child how they would solve the problem."
    },
    {
      "id": "2278",
      "title": "Hierarchy of Needs",
      "body": "All problems exist within a hierarchy of needs.  Look to the higher level need to open up additional ways of solving the problem."
    },
    {
      "id": "2279",
      "title": "Genius",
      "body": "Ability to hold one's vision steady until it becomes a reality (B. Franklin)."
    }
  ]
}

