{
  "subject": "EXPONENTIAL GROWTH CHECKLIST",
  "credit": "EXPONENTIAL GROWTH CHECKLIST",
  "todos": [
    {
      "id": "2304",
      "title": "Timing",
      "body": "Will your product make sense in the world in which it was finished and not just the world in which it started?"
    },
    {
      "id": "2305",
      "title": "Autonomy",
      "body": "Is your structure self-organizing, independent, de-centralized, non-political, non-emotional, team oriented, non-hierarchical (are there systems to remove the weakest links such as voting, or performance metrics, pay people to leave, peer-based, teams select own employees)?"
    },
    {
      "id": "2306",
      "title": "Disruption",
      "body": "Is your product a disruption to an already established product?  * Disruption is bad if it causes to much attention and competitors flood the market.  "
    },
    {
      "id": "2307",
      "title": "Data Driven",
      "body": "Is your company data driven (use data to help guide decisions, not make decisions, including in human resources)?"
    },
    {
      "id": "2308",
      "title": "Board Managed",
      "body": "Is your board managed properly  board is diverse (diverse boards outperform all-white-male boards by 26% according to study by Credit Suisse Research Institute), board brings in outside sources and young people to update them on new technologies, board participates in continuing ed, board removes weakest link?"
    },
    {
      "id": "2309",
      "title": "Information",
      "body": "Is information your greatest asset?  "
    },
    {
      "id": "2310",
      "title": "Relevant Communities",
      "body": "Have you joined relevant communities of people that will help you with your objective (www.meetup.com, accelerators, incubators, associations, blogs, hacker-spaces, universities, etc.)?"
    },
    {
      "id": "2311",
      "title": "Business Model",
      "body": "Does your product provide min of two and max of three of the following value propositions  immediacy (helps customers be the first to experience/know something), personalization (customers can personalize their experience), interpretation (helps shorten learning curve), authenticity (product is guaranteed to be real and safe), accessibility (improves our ability to find what we need quickly), embodiment (has a physical component to it, we receive something tangible), patronage (people want to pay the artist entrepreneur when they could get it for free through piracy), findability (helps customers broadcast their existence so that other people can find them)?"
    },
    {
      "id": "2312",
      "title": "Collaborative Consumption",
      "body": "Does your product or systems take advantage of sharing resources (such as Uber, Airbnb, etc.)?"
    },
    {
      "id": "2313",
      "title": "Sensors",
      "body": "Does your product or infrastructure include sensors for measurement?  "
    },
    {
      "id": "2314",
      "title": "Doubling Pattern",
      "body": "Does your product improve because of Moore’s Doubling pattern (better, cheaper, and greater access to technology?"
    },
    {
      "id": "2315",
      "title": "Lean Startup",
      "body": "Does your company eliminate all expenses with any goal other than the creation of value for the end customer?"
    },
    {
      "id": "2316",
      "title": "Core Value",
      "body": "Do your customers share the same core values or purpose of your company?"
    },
    {
      "id": "2317",
      "title": "Validation",
      "body": "Do you setup systems to validate and test possible success of product before it is launched (Ex  crowdfunding websites like Kickstarter that only fund money if enough people invest)?"
    },
    {
      "id": "2318",
      "title": "Coopetition",
      "body": "Do you partner with your competitors when it is advantageous to you in the long-run?"
    },
    {
      "id": "2319",
      "title": "Community & Crowd",
      "body": "Do you leverage customers, community and crowd to grow your business (use statement of purpose to engage, nurture them, create a platform for peer-to-peer engagement, validating/rewarding their involvement, sweepstakes, quizzes, coupons, reward, loyalty, incentive competitions, ranking, peer pressure, feedback, clear rules, virtual currencies?"
    },
    {
      "id": "2320",
      "title": "Leveraged Assets",
      "body": "Do you leverage assets/external resources instead of owning them in information companies and own assets instead of leveraging them in asset-heavy industries?"
    },
    {
      "id": "2321",
      "title": "Problem Space",
      "body": "Do you know the problem space for your idea (something customer cannot solve or does not want to solve themselves/would rather pay someone else to solve)?"
    },
    {
      "id": "2322",
      "title": "Marketing",
      "body": "Do you know how customers will find you?"
    },
    {
      "id": "2323",
      "title": "Social Technologies",
      "body": "Do you invest in ways to support horizontal interactions between employees (reduce distance to obtain decisions and information, information flows and you Don’t have to look it up, task management, files sharing, telepresence, virtual worlds, emotional sensing)?"
    },
    {
      "id": "2324",
      "title": "A/B Testing",
      "body": "Do you incorporate A/B testing (creating two different test campaigns of equal size and significant sampling and determining which one has higher success)?"
    },
    {
      "id": "2325",
      "title": "Approval/Decision",
      "body": "Do you include employees, customers, and vendors in deciding which new ideas to pursue and who to hire?"
    },
    {
      "id": "2326",
      "title": "Dashboards",
      "body": "Do you implement real-time and transparent dashboards with all essential company and employee metrics, accessible to everyone (OKR – Lists objectives, and key results to getting there)?"
    },
    {
      "id": "2327",
      "title": "Interfaces",
      "body": "Do you implement filtering and matching processes into your products and systems (help manage abundance of information and cater it to users wants/needs)?"
    },
    {
      "id": "2328",
      "title": "Algorithms",
      "body": "Do you have proprietary algorithms in place that drive your product (simple algorithms in complex and uncertain markets and complex algorithms in simple and predictable markets)?"
    },
    {
      "id": "2329",
      "title": "Staff on Demand",
      "body": "Do you have access to staff on demand?"
    },
    {
      "id": "2330",
      "title": "Core Team Members",
      "body": "Do you have a visionary, business/person, and executor (execution eats strategy for breakfast)?"
    },
    {
      "id": "2331",
      "title": "Statement of Purpose",
      "body": "Do you have a strong statement of purpose that is something you are passionate about, massive, transformative (generates a cultural movement), and has a purpose?"
    },
    {
      "id": "2332",
      "title": "Net Promoter Score",
      "body": "Do you have a strong net promoter score (how likely is it that you would recommend our company/product/service to a friend – score of 50% or more is good)?"
    },
    {
      "id": "2333",
      "title": "Red Ops",
      "body": "Do you have a red ops team the tries to test security vulnerabilities?"
    },
    {
      "id": "2334",
      "title": "Black-Ops",
      "body": "Do you have a black ops team that tries to disrupt your product and legacy?"
    },
    {
      "id": "2335",
      "title": "Experimentation",
      "body": "Do you evolve and experiment with new and possibly risky ideas (Ex  give employees, customers, vendors a pre-paid credit card of $1,000 seed money and flexible guidelines to come up with a new idea/product, experimentation lab, managers must write two-page paper why an idea won’t work)?"
    },
    {
      "id": "2336",
      "title": "Good Failure",
      "body": "Do you establish a system for determining between a good failure (done with integrity, done fast, done often, eliminates waste, still produces good results and lessons), bad failure (done w/o integrity, slow failure, lots of waste, there are no lessons to learn), good success (result of hard work and many tries and adaptations, know why it was a success), and bad success (result of luck with no tries and no idea why you became a success)?"
    },
    {
      "id": "2337",
      "title": "Use Data",
      "body": "Data can improve hiring by 25% compared to strict intuition - American Psychological Association."
    },
    {
      "id": "2338",
      "title": "Hard Drive Security",
      "body": "Ban Thumb Drives at Work (90% of employees will plug in a thumb-drive left in parking lot which could infect computers)"
    },
    {
      "id": "2339",
      "title": "Job Creation",
      "body": "100% of net job creation has come via startups and entrepreneurs (2010 Kauffman Foundation study)"
    },
    {
      "id": "2340",
      "title": "* “Waste” is an expense that does not directly add value to your customer.",
      "body": ""
    }
  ]
}

