{
  "subject": "10 DAYS FASTER READING",
  "credit": "10 DAYS FASTER READING",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "1",
      "title": "Column Width",
      "body": "Wider column text takes longer to read because your eye needs to travel farther in each direction to group phrases."
    },
    {
      "id": "2",
      "title": "Muscle Memory",
      "body": "Using repetitive tasks to train your brain."
    },
    {
      "id": "3",
      "title": "Read Distractors",
      "body": "Things such as tv, phone, email, music (except Mozart), kids, location, that distract you from focusing."
    },
    {
      "id": "4",
      "title": "Vocabulary",
      "body": "The greater your vocabulary, the faster you will read."
    },
    {
      "id": "5",
      "title": "Rhythm",
      "body": "Speed reading involves getting in a steady eye movement rhythm.  Use a metronome if necessary."
    },
    {
      "id": "6",
      "title": "Helpful Reading Habits",
      "body": "Sleep over 7 hours a day, add movement to your day, eat brain food, reduce stress."
    },
    {
      "id": "7",
      "title": "Skipping Rules",
      "body": "Skip over areas that 1. Contain nothing new, 2. Contain nothing you need, 3. Is too difficult to comprehend (in this case still skim)."
    },
    {
      "id": "8",
      "title": "Scan v. Skim v. Skip",
      "body": "Scanning is looking for something specific in a text.  Skimming is reading the keywords of the text to get the gist of all the material and to see if there is anything you should read in detail.  Skipping is jumping over certain areas of the text."
    },
    {
      "id": "9",
      "title": "Jump Into It",
      "body": "Repetition of ideas and concepts over time increases your comprehension.  Don't be afraid to read books even when you can only understand 10% of the material.  "
    },
    {
      "id": "10",
      "title": "Phrasing",
      "body": "Reading a group of words that form a thought.  AKA thought grouping."
    },
    {
      "id": "11",
      "title": "Pre-Viewing",
      "body": "Quickly skimming through the entire text to get an idea of what it is about and the authors point of view.  Read cover, inside cover, back covers, table of contents, title lines, bold words, first sentence of paragraphs, ending chapter paragraphs, etc.  It takes time to save time."
    },
    {
      "id": "12",
      "title": "Two Finger Pull",
      "body": "Putting your fingers on the outside of the left and right margins for the words you are trying to read."
    },
    {
      "id": "13",
      "title": "Note Making Tools",
      "body": "Pen or pencil to help you mark keywords or areas that include important text.  Remember 20% of text includes 80% of important words.  "
    },
    {
      "id": "14",
      "title": "Background Knowledge",
      "body": "Knowing even a little about the subject helps you learn a lot more.  Spend time researching the subject before you read about it.  "
    },
    {
      "id": "15",
      "title": "Reading Retrieval System",
      "body": "Keep a system of notes on a book that helps you retrieve information you needed (such as these checklist documents)."
    },
    {
      "id": "16",
      "title": "Change Reading Speed Rates",
      "body": "If your purpose is to get the gist of the material, speed up, if your looking to study or memorize, slow down."
    },
    {
      "id": "17",
      "title": "Pacer",
      "body": "Force the eye to move in a directed pattern down the page to help increase reading speed."
    },
    {
      "id": "18",
      "title": "Indenting",
      "body": "Focus on words an inch inwards on each side of the margins.  You will automatically pickup the words on the edges of the margins."
    },
    {
      "id": "19",
      "title": "Read Between Lines",
      "body": "Focus on the white space between the lines and not on the words themselves."
    },
    {
      "id": "20",
      "title": "Network Reading",
      "body": "Find out what other people in your field recommend to read.  It helps you find quality books and also tells you a lot about that persons style.  "
    },
    {
      "id": "21",
      "title": "Make inferences",
      "body": "By understanding the author's points of view you can start to fill in any missing words that are outside of the keywords."
    },
    {
      "id": "22",
      "title": "Subvocalization",
      "body": "Bad habit of speaking words while you read them."
    },
    {
      "id": "23",
      "title": "Regression",
      "body": "Bad habit of going back and reading words you've already read."
    },
    {
      "id": "24",
      "title": "Mind Wandering",
      "body": "Bad habit of daydreaming while reading."
    },
    {
      "id": "25",
      "title": "Reading Aides",
      "body": "AceReader (acereader.com), E-Read(kerus.com), and Jamestown Publishers (800-USA-Read)."
    },
    {
      "id": "26",
      "title": "Concentration",
      "body": "Ability to focus on single task.  Trait of highly successful people."
    },
    {
      "id": "27",
      "title": "Reading from Screen",
      "body": "30% less efficient because  1. Distance to screen, 2. Resolution, 3. Margin width, 4. Posture of reader, 5. Familiarity with medium, 6. System response time.  Use sans serif fonts of 12 to 18 point.  "
    },
    {
      "id": "28",
      "title": "Ways to reduce subvocalization",
      "body": "1. Push yourself to read faster, 2. Read only key words. 3. Use a pacer, 4. Hum a tune to yourself or chew gum, 5. Push tongue to the top of your mouth."
    },
    {
      "id": "29",
      "title": "Three Bad Habits of Reading",
      "body": "1. Mind Wandering, 2. Regression, 3. Subvocalization."
    },
    {
      "id": "30",
      "title": "5 W's and H",
      "body": "When reading, what you want to be looking for are the who, what, when, where, why and how keywords."
    },
    {
      "id": "31",
      "title": "Keywords",
      "body": "Most important words that give you the most information in the lease amount of time."
    }
  ]
}
