{
  "subject": "Financial Model Checklist",
  "credit": "Financial Model Checklist",
  "topic": "Finance",
  "todos": [
    {
      "id": "2410",
      "title": "Benefits",
      "body": "Usually 30% of salary expense."
    },
    {
      "id": "2411",
      "title": "Real Estate Investors",
      "body": "Use them if its easy money but remind them that startups are long-term plays."
    },
    {
      "id": "2412",
      "title": "Pitch",
      "body": "Start emotional (character, walk to audience, playful energy, jokes, humility, engage with crowd), go logical (walk towards slide, intense energy, eye contact, serious story, posture, confidence, still movement), finish emotional.  Research comedians, improve, magicians."
    },
    {
      "id": "2413",
      "title": "No debt",
      "body": "Preferred to investors, good selling point, after they join they will want you to get LOC."
    },
    {
      "id": "2414",
      "title": "How to explain consulting in a product company",
      "body": "Our customers are paying for the development of our product."
    },
    {
      "id": "2415",
      "title": "Opening slide",
      "body": "You know what I hear a lot.  It's all about relationships.  Investors, relationships, customers, relationships, talent, relationships, drink tickets, find Hayley."
    },
    {
      "id": "2416",
      "title": "Partner",
      "body": "With whomever cafn add strategic value."
    },
    {
      "id": "2417",
      "title": "Cash Flow",
      "body": "Will you have enough cash to carry out business model.  "
    },
    {
      "id": "2418",
      "title": "Channel Partners",
      "body": "Who else wants your customer to succeed (chambers, economic development, accelerators, vcs, angels, business innovation centers, salesforce)."
    },
    {
      "id": "2419",
      "title": "Generation Gap",
      "body": "When pitching to older audiences, wear glasses, dress up, be confident, don't be afraid about silence, anchor points by writing them down, intimidate with you expectations then put a fence around them with attitude."
    },
    {
      "id": "2420",
      "title": "S-1",
      "body": "When a company goes public they have to file an S-1 which has a lot of useful info."
    },
    {
      "id": "2421",
      "title": "Balance sheet",
      "body": "What you owe, what you own, and what you've put in to date.  "
    },
    {
      "id": "2422",
      "title": "Main points",
      "body": "Use large font so that you can't put 'kind-of' impressive facts.  Four kind of impressive facts are less than one really impressive fact."
    },
    {
      "id": "2423",
      "title": "Eye contact",
      "body": "Use it to emphasize key bits of information and set anchors."
    },
    {
      "id": "2424",
      "title": "Tech Council",
      "body": "Trade association for small tech companies.  "
    },
    {
      "id": "2425",
      "title": "Lag time",
      "body": "Time from hire to visible effect of that employee."
    },
    {
      "id": "2426",
      "title": "Competition",
      "body": "There is no market for what you have if you do not have competition."
    },
    {
      "id": "2427",
      "title": "Raise More",
      "body": "Than you think you need."
    },
    {
      "id": "2428",
      "title": "Font",
      "body": "Take the oldest person in the room and divide their age by two, don't use white font, for numbers use a plain and boring san-serif in black with white background."
    },
    {
      "id": "2429",
      "title": "Cost of Customers",
      "body": "Some software companies spend $1,000 to get each customer."
    },
    {
      "id": "2430",
      "title": "Beware of Self-Funding",
      "body": "Some companies that have sold for $100M have only put in $30K.  Don't invest too much of your money.  Set a limit.  Tell other investors you already have significant skin in the game."
    },
    {
      "id": "2431",
      "title": "Pitch Perfect",
      "body": "Sell your whole story w/o any missing pieces.  Identify and answer the white elephants in the room.  "
    },
    {
      "id": "2432",
      "title": "University Library",
      "body": "See if they can help you do research."
    },
    {
      "id": "2433",
      "title": "Revenue Projections",
      "body": "Science and not an art.  Make sure to backup your projections with hard numbers and historical data."
    },
    {
      "id": "2434",
      "title": "Saas v. Subscription",
      "body": "Saas usually has a contract time of 12 months.  "
    },
    {
      "id": "2435",
      "title": "Personal Guarantees",
      "body": "Reward people taking a risk with personal guarantees by giving them warranties (options in company)."
    },
    {
      "id": "2436",
      "title": "Zeros",
      "body": "Remove zeros and $ signs from financial statements, round to thousand."
    },
    {
      "id": "2437",
      "title": "Intelligence",
      "body": "Paying someone a couple bucks to get you the intelligence you need is cheaper than building signals intelligence (Navy Seals)."
    },
    {
      "id": "2438",
      "title": "Trust Factor",
      "body": "Once you have several major brands you build trust factor and your sales time will decrease."
    },
    {
      "id": "2439",
      "title": "Addition",
      "body": "Numbers on tables must add up for the investors that will try to do their own math."
    },
    {
      "id": "2440",
      "title": "Bad words",
      "body": "Never say hope, hopefully, I believe, I think'say I know, we have found, it has been proven."
    },
    {
      "id": "2441",
      "title": "Even numbers",
      "body": "Never include, they look like guesses."
    },
    {
      "id": "2442",
      "title": "R&D",
      "body": "Never ask for R&D money from investors."
    },
    {
      "id": "2443",
      "title": "Employee Contracts",
      "body": "Many investors will want to see employee contracts and make sure IP is assigned appropriately."
    },
    {
      "id": "2444",
      "title": "Alternative Investors",
      "body": "Look into gov't and military grants, university programs, university entrepreneurship schools/"
    },
    {
      "id": "2445",
      "title": "Practicing Pitch",
      "body": "Look for local toastmasters clubs or Dale Carnegie Institute to help practice your pitch."
    },
    {
      "id": "2446",
      "title": "Angels",
      "body": "Like to herd, need to show others committed, look for 20-25% compounding annual return, patient, willing to take risks, use their own money, Linder, NelNet.  Get in their favor by helping their portfolio companies.  Do two things for them before you ask for one favor."
    },
    {
      "id": "2447",
      "title": "Connectors",
      "body": "Investment bankers, accountants, and personal financial advisors know rich people."
    },
    {
      "id": "2448",
      "title": "Risks",
      "body": "Identify risks for investors so they know that you know your shit.  "
    },
    {
      "id": "2449",
      "title": "Attrition",
      "body": "How are you going to handle attrition."
    },
    {
      "id": "2450",
      "title": "Skin in The Game",
      "body": "Here's the deal.  I've got $50K to add on top of $225 I've already put into the game.  I'm all in but before I throw the next $50K I need $200K to finish my round."
    },
    {
      "id": "2451",
      "title": "Run-rate",
      "body": "Growth of revenue from one customer to the next.  "
    },
    {
      "id": "2452",
      "title": "Taxable",
      "body": "Equity is a taxable event if you have a valuation.  Options are not."
    },
    {
      "id": "2453",
      "title": "Valuation",
      "body": "Don't overemphasize.  There are many other ways to structure a deal."
    },
    {
      "id": "2454",
      "title": "Referrals",
      "body": "Don't leave a meeting without two other people you should talk to."
    },
    {
      "id": "2455",
      "title": "Assumptions",
      "body": "Don't forget to list."
    },
    {
      "id": "2456",
      "title": "COGS",
      "body": "Does not include sales but includes what it costs to deliver product."
    },
    {
      "id": "2457",
      "title": "Do twice, ask once",
      "body": "Do 2-3 things for an investor before you ask for one favor."
    },
    {
      "id": "2458",
      "title": "Market penetration",
      "body": "Dell only has 7% of their market.  The more niche audience, the more of the market you can capture."
    },
    {
      "id": "2459",
      "title": "Investor Leads",
      "body": "David Graff, Steve Kiene, MacPractice, Parse NE Angels, Clarey, Breck, Linders, NelNet"
    },
    {
      "id": "2460",
      "title": "Funding sources",
      "body": "Crunchbase, angellist"
    },
    {
      "id": "2461",
      "title": "Video",
      "body": "Create a 2 min video describing and/or demoing your product."
    },
    {
      "id": "2462",
      "title": "To Investor",
      "body": "Can I brainstorm a technology with you that I think could help your portfolio clients."
    },
    {
      "id": "2463",
      "title": "References",
      "body": "Build strong references."
    },
    {
      "id": "2464",
      "title": "Sales Cycle",
      "body": "Bigger more stodgier industries have much longer sales cycles.  "
    },
    {
      "id": "2465",
      "title": "First",
      "body": "Be careful saying you are the first to do something.  Sometimes the market is not ready for what you are doing.  Showing competition can be helpful."
    },
    {
      "id": "2466",
      "title": "Interview Your Money",
      "body": "Ask questions to Angels, don't let them control the conversation or else they will feel superior to you.  Meet prospect investors every 3 months.  Cold calls don't work for VCs or Angel networks,  get an introduction."
    },
    {
      "id": "2467",
      "title": "Volume or Quality",
      "body": "Are you going for volume of customers or size/quality of customer."
    },
    {
      "id": "2468",
      "title": "Options Pool",
      "body": "4-5 years vesting, no right until after first year.  Usually pricesd at 10-20% of share prices.  Usually allocate 10-20% of total stock pool for options."
    },
    {
      "id": "2469",
      "title": "Accelerate Options at Sale",
      "body": "-"
    },
    {
      "id": "2470",
      "title": "Niche that's not being scratched.",
      "body": "-"
    },
    {
      "id": "2471",
      "title": "Signup for LinkedIn recruiting so they can't see you.",
      "body": "-"
    },
    {
      "id": "2472",
      "title": "VCs ' 30% compounded return, work with others money, less patient, usually only invest when there is product and traction, average VC invests in a deal for 9.4 years.",
      "body": "-"
    }
  ]
}

