{
  "subject": "Find Your Customer Checklist",
  "credit": "Find Your Customer Checklist",
  "todos": [
    {
      "id": "2473",
      "title": "Niche",
      "body": "Your product should not be for everyone."
    },
    {
      "id": "2474",
      "title": "Spending",
      "body": "Where does customer spend money?"
    },
    {
      "id": "2475",
      "title": "Advice",
      "body": "Where does customer look for advice?"
    },
    {
      "id": "2476",
      "title": "Read",
      "body": "What does customer read?"
    },
    {
      "id": "2477",
      "title": "Customer Sellers",
      "body": "Turn customers into sales reps."
    },
    {
      "id": "2478",
      "title": "Motivation triangle",
      "body": "There are people feeling pain now, worried, vigilant, and think it’s a cool idea.  Forget the people that think it’s a good idea and start on the people that are really feeling the pain."
    },
    {
      "id": "2479",
      "title": "Smart v Innovative",
      "body": "Smart doesn’t always equal innovative.  Innovative is having an idea that touches a nerve with a customer, smart is being able to execute the best possible solution.  Pivot or restart until you have both done solid.  "
    },
    {
      "id": "2480",
      "title": "Benefit and Reason",
      "body": "Sell the benefit and then reason to believe."
    },
    {
      "id": "2481",
      "title": "Don’t Bury Lead",
      "body": "Say first what you want people to hear first.  "
    },
    {
      "id": "2482",
      "title": "Motivation",
      "body": "People can be motivated by pain, fear, greed, vanity, embarrassment, etc."
    },
    {
      "id": "2483",
      "title": "Unique and important",
      "body": "Is it unique and important to sell.  Air is important but not unique unless you put it in a scuba tank."
    },
    {
      "id": "2484",
      "title": "Money Talks",
      "body": "If people aren’t spending money to try to address your problem, its not a real problem."
    },
    {
      "id": "2485",
      "title": "Customer Perspective",
      "body": "How does customer view problem?"
    },
    {
      "id": "2486",
      "title": "Nerve",
      "body": "How do you touch a nerve with your customers."
    },
    {
      "id": "2487",
      "title": "Tip of Iceberg",
      "body": "Focus on your bread and butter.  Keep it simple.  You can always say at the end, “this is just the tip of the iceberg.”  There is no hocus-pocus that takes the place of focus."
    },
    {
      "id": "2488",
      "title": "Leverage",
      "body": "Find a sales force (people and channels) that sells for you for nothing."
    },
    {
      "id": "2489",
      "title": "Simple stupid",
      "body": "Dumb down the language.  "
    },
    {
      "id": "2490",
      "title": "Confidence/Facts",
      "body": "Don’t use words “I believe” or “I think.”"
    },
    {
      "id": "2491",
      "title": "Secret sauce",
      "body": "Don’t talk methods, keep the secret sauce secret and just talk about the benefits and how you’ve proven your methods work.  "
    },
    {
      "id": "2492",
      "title": "Leading",
      "body": "Don’t ask customers leading questions such as we do this…what are your problems?  They are likely to center their problems around what you do.  Say “I want to run a couple business ideas by you.  I’m not trying to sell something to you and whatever you say isn’t going to let me down.  I think going through this exercise would add value."
    },
    {
      "id": "2493",
      "title": "Ownership",
      "body": "Does customer own problem."
    },
    {
      "id": "2494",
      "title": "Money",
      "body": "Does customer have money."
    },
    {
      "id": "2495",
      "title": "Five minute pitch",
      "body": "Describe your customer in detail, what’s broke, what’s motivating them, how much is it costing them, what they need in a nutshell, and how you can help."
    },
    {
      "id": "2496",
      "title": "Customer Path",
      "body": "Constantly be changing your customer definition to the next best customer that will get you where you need to be.  Sometimes it make sense to start small and go big."
    },
    {
      "id": "2497",
      "title": "Vulnerable",
      "body": "Be vulnerable."
    },
    {
      "id": "2498",
      "title": "Strategic pause",
      "body": "Ask your upfront contract and how you can help your audience and then pause."
    }
  ]
}

