{
  "subject": "FIRST 20 HOURS CHECKLIST",
  "credit": "FIRST 20 HOURS CHECKLIST",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "2499",
      "title": "STRUCTURING ENVIRONMENT, ELIMINATING DISTRACTIONS",
      "body": "The best way to change your behavior is to change your environment, if you don't want to do something your currently doing, make it difficult, impossible, or prohibitive to do.  'Set yourself up for success.'"
    },
    {
      "id": "2500",
      "title": "HUB/MENTOR THEORY",
      "body": "People surrounded by other people or parents good at a skill are more likely to be good at that skill because they have someone to provide feedback to their practice."
    },
    {
      "id": "2501",
      "title": "LEARN WHILE YOU SLEEP",
      "body": "Most of your skill acquisition occurs not while you are practicing but after you practice via consolidation.  The human brain continues to learn in absence of practice, especially during sleep.  "
    },
    {
      "id": "2502",
      "title": "LEARNING V PRACTICE",
      "body": "Learning helps you plan, correct, and edit yourself as you practice.  Learning has no overlap with skill acquisition.  Practice is the only way to acquire skills."
    },
    {
      "id": "2503",
      "title": "FRUSTRATION BARRIER",
      "body": "It takes twenty hours of practice to get over the frustration barrier of learning something new."
    },
    {
      "id": "2504",
      "title": "10,000 HOUR RULE",
      "body": "It takes on average ten thousand hours of deliberate practice to become an expert at something.  This would take three years if you worked eight hours a day seven days a week.  It would take five years if you worked a normal business week full-time.  It takes an average person ten years because of the multiple commitments they have in their lives."
    },
    {
      "id": "2505",
      "title": "LEARN TO TYPE FASTER WITH COLEMAK",
      "body": "Improved QWERTY keyboard.  See Carlpalx keyboard optimizer.  See Keyzen (http //wwwtyro.github.io/keyzen/).  See Das Keyboard.  See TypeFu.  See Amphetype."
    },
    {
      "id": "2506",
      "title": "DELIBERATE PRACTICE V. AMBIENT PRACTICE",
      "body": "Deliberate practice is focusing on the task specifically to improve your skill level.  Ambient practice is working on the task during your normal daily or business activities.  It has been proven that ambient practice does not noticeably improve your skill level.  "
    },
    {
      "id": "2507",
      "title": "BREATH WHILE YOU PRACTICE",
      "body": "Chronic stress detracts from practice.  Stress is usually related to breathing.  Breath through your nose.  Meditation and yoga also help with stress."
    },
    {
      "id": "2508",
      "title": "FIXED MINDSET V. GROWTH MINDSET",
      "body": "Belief that people are naturally good at something vs. thinking people can grow to learn any skill."
    },
    {
      "id": "2509",
      "title": "MASTERY",
      "body": "Becoming a master is not about doing 10,000 things once but doing one thing ten thousand times."
    },
    {
      "id": "2510",
      "title": "REACQUIRIING A SKILL",
      "body": "A true master is not afraid to spend years learning a skill and then completely breaking it down and starting from scratch.  Tiger woods retrained his golf swing three times (one for each of his Masters wins).  "
    }
  ]
}

