{
  "subject": "4 Hour Workweek",
  "credit": "4 Hour Workweek",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "126",
      "title": "Ultimate Position",
      "body": "You don't want to be the boss or the employee, you want to be the owner."
    },
    {
      "id": "127",
      "title": "Expert",
      "body": "Someone who has made all the mistakes that can be made in a very narrow field (Niels Bohr)."
    },
    {
      "id": "128",
      "title": "Mini-Retirements",
      "body": "Recovery periods and adventures, during your life.   If you can free your locational attachments your money can go 3-10 times farther in foreign countries."
    },
    {
      "id": "129",
      "title": "Dealmaker",
      "body": "Reality is negotiable. Reality is merely an illusion, albeit a very persistent one (Einstein)."
    },
    {
      "id": "130",
      "title": "Reading",
      "body": "Reading, after a certain age, diverts the mind too much from its creative pursuits.  Any man who reads too much and uses his brain too little falls into a lazy habit of thinking (Albert Einstein)."
    },
    {
      "id": "131",
      "title": "Lose-Win Guarantee",
      "body": "Make it a win for the customer if the product or experience fails.  Don't give them a discount but 100% of their money back.  "
    },
    {
      "id": "132",
      "title": "Chunking",
      "body": "Limit e-mail to one hour, one day a week."
    },
    {
      "id": "133",
      "title": "Becoming an Expert",
      "body": "Join trade organizations, read industry books, give free seminars, write articles for trade magazines, co-author books, join ProfNet."
    },
    {
      "id": "134",
      "title": "Relative Income",
      "body": "How much do you make and how much does your money make compared to how much time you put into things.  "
    },
    {
      "id": "135",
      "title": "Eustress",
      "body": "Healthy stress.  Includes pressure and constructive criticism to succeed.   People who avoid criticism and conflict will eventually fail at life."
    },
    {
      "id": "136",
      "title": "Emphasize Strengths",
      "body": "Don't fix weaknesses."
    },
    {
      "id": "137",
      "title": "Effectiveness",
      "body": "Doing something that moves you closer to your goals."
    },
    {
      "id": "138",
      "title": "Niche Market",
      "body": "Creating demand is hard, filling demand is easy."
    },
    {
      "id": "139",
      "title": "Efficiency",
      "body": "Being able to get tasks done.   "
    },
    {
      "id": "140",
      "title": "A/B Adwords",
      "body": "A/B test on Google Adwords."
    },
    {
      "id": "141",
      "title": "Online FAQ",
      "body": "Your product should be fully explainable on an online FAQ and there should be no reason for people to call or email with questions."
    },
    {
      "id": "142",
      "title": "Dreamlining",
      "body": "Write out what your perfect life would be and establish a plan to get there."
    },
    {
      "id": "143",
      "title": "Puppy Dog Close",
      "body": "Why don't you try it out and if you don't like it you can bring it back."
    },
    {
      "id": "144",
      "title": "Money",
      "body": "Wealth is a moving target, the more you gain the more you will want.  Learn to do more with less money rather than try to be the richest person in the world that has no time to enjoy the fruits of their labor (relative income is better than absolute income).  With money come strings and stresses."
    },
    {
      "id": "145",
      "title": "Things in Excess Become Opposite",
      "body": "Too much of a good thing becomes a bad thing (freedom fighters become tyrants, help becomes hindrance, blessings become curses, curses become blessings)."
    },
    {
      "id": "146",
      "title": "Jump In",
      "body": "Timing is never right."
    },
    {
      "id": "147",
      "title": "Comfort Challenge",
      "body": "The most important actions are usually the least comfortable.  Jump into things.  The first time is always the hardest and it becomes 50% easier each successive time."
    },
    {
      "id": "148",
      "title": "Parkinson's Law",
      "body": "The more time made available for a task, the more time will be wasted."
    },
    {
      "id": "149",
      "title": "Meetings",
      "body": "Should be 30 minutes or less to make a decision or 60 minutes to share knowledge and brainstorm.  Meetings are a form of corporate masturbation (Dave Barry).  Meetings should not be to held to define a problem."
    },
    {
      "id": "150",
      "title": "Life",
      "body": "Remember that knowing you are going to die is the best way to avoid thinking you have something to lose (Steve Jobs)."
    },
    {
      "id": "151",
      "title": "Loopholes",
      "body": "Read the rules and look for ways to win using non-standard techniques (ex  lose all water weight to fight in two classes below, invent a diesel engine to take less pit stops)"
    },
    {
      "id": "152",
      "title": "Bottleneck",
      "body": "Problems tend to resolve themselves if you don't offer yourself as the bottleneck that will try to solve all of them."
    },
    {
      "id": "153",
      "title": "Low information diet",
      "body": "Only consume data in small amounts from the right sources.  Go to people that have experienced your problems first for information.  Look at people's actions and not their words.  Everyone says things they don't mean or are wrong.   Only read how-to and autobiographical books.  No speculators or wannabees.  "
    },
    {
      "id": "154",
      "title": "Aim for Volume",
      "body": "Only by practicing a lot and failing a lot do we truly learn how to succeed without shear luck.  "
    },
    {
      "id": "155",
      "title": "Elimination",
      "body": "One does not accumulate but eliminate.  It is not daily increase but daily decrease.  The height of cultivation always runs to simplicity (Bruce Lee).  "
    },
    {
      "id": "156",
      "title": "Institutional Imitation",
      "body": "Most companies and people are doing things very inefficiently.  Don't imitate their ineptitude."
    },
    {
      "id": "157",
      "title": "80/20 ' Parkinson's Law",
      "body": "Limit tasks to the important to shorten work time.  Shorten work time to limit tasks to the important."
    },
    {
      "id": "158",
      "title": "Liberate",
      "body": "Liberate yourself from the pressure of going to an office.  Stop reading the newspaper and don't spend time on social media.  Keep your phone and e-mail away from you.  Turn off audible alerts.  Note in your e-main when you will respond."
    },
    {
      "id": "159",
      "title": "Disruption Recovery",
      "body": "It takes on average 12 minutes to re-focus on your work when being disrupted. Do not permit casual visitors when you are trying to work.  Try wearing headphones."
    },
    {
      "id": "160",
      "title": "Aim for Unrealistic",
      "body": "It is easier than the realistic because everyone else is doing the realistic and thus there is way too much competition."
    },
    {
      "id": "161",
      "title": "Popularity",
      "body": "I can't give you a surefire formula for success, but I can give you a formula for failure  try to please everybody all the time (Herbert Swope)."
    },
    {
      "id": "162",
      "title": "Difficult",
      "body": "Have a reputation of being difficult when it comes to your values.  (ex   I'm going to be very difficult on this issue because our team strongly believes in').  Learn how to say no."
    },
    {
      "id": "163",
      "title": "Fear",
      "body": "Fear is what causes us to make poor decisions.  Define your fear and then experience it every day.  If you fear being broke, try living on two dollars a day and see if it is really that bad.  If you fear your business failing ask others what they would think of you as a person if your business failed.  I am an old man and have known many troubles, but most of them have never happened. (Mark Twain)."
    },
    {
      "id": "164",
      "title": "Surveys & Focus Groups",
      "body": "Even if they are well designed, most of the time people don't know what they want and aren't smart enough to give you good feedback.  Don't fall into imitation game."
    },
    {
      "id": "165",
      "title": "80/20",
      "body": "Eighty percent of value comes from twenty percent of actions."
    },
    {
      "id": "166",
      "title": "Effectiveness v. Efficiency",
      "body": "Efficiency does not guarantee effectiveness (Ex  door to door salesperson could be really efficient at selling but could be twice as effective if he simply e-mailed or called).  Doing something unimportant well does not make it important.  Requiring a lot of time does not make a task important."
    },
    {
      "id": "167",
      "title": "How to Look Like a Fortune 500",
      "body": "Don't refer to yourself as the CEO, put multiple emails, contacts, and addresses on your site, setup an interactive voice response receptionist, don't provide home address."
    },
    {
      "id": "168",
      "title": "Interrupt",
      "body": "Don't let people meander.  (ex   sorry to interrupt but I have to' what do we need to do?)."
    },
    {
      "id": "169",
      "title": "Non-Finishing",
      "body": "Don't be afraid to not finish something if halfway through you discover it is a waste of time."
    },
    {
      "id": "170",
      "title": "Ask for Forgiveness",
      "body": "Don't ask for permission when bending the rules."
    },
    {
      "id": "171",
      "title": "Options & Discounts",
      "body": "Do not offer multiple options and discounts to a customer.  The more choices you offer them the more they will be indecisive.  The more discounts you give them the less value they will perceive the item and the more they will try to negotiate with you."
    },
    {
      "id": "172",
      "title": "Not-To-Do-List",
      "body": "Define a list of items that you are not going to do.   If you only had an hour a day to work what would you do today.  Ask yourself whether you are inventing things to avoid the important."
    },
    {
      "id": "173",
      "title": "Busyness",
      "body": "Busyness should be looked down upon.  Busyness is usually a guise for avoiding the most critically important but uncomfortable actions.  If you try to do a million things a day, non-of them will add value.  If you try to do only a few things each day, all of them will be valuable.  "
    },
    {
      "id": "174",
      "title": "Selective Ignorance",
      "body": "Be selectively ignorant of things that are not worth your time.  "
    },
    {
      "id": "175",
      "title": "Automation",
      "body": "Applied to an efficient operation will magnify the efficiency.  Applied to an inefficient operation will magnify the inefficiency (Bill Gates).  Don't rely on technology to solve underlying structural problems.  Don't work with companies that have underlying structural problems.  They will drag you down."
    },
    {
      "id": "176",
      "title": "Information Overload",
      "body": "A wealth of information creates a poverty of attention (Herbert Simon)."
    },
    {
      "id": "177",
      "title": "Off-Loading",
      "body": "A man is rich in proportion to the number of things he can afford to let alone (Henry David Thoreau)."
    },
    {
      "id": "178",
      "title": "Less is Not Laziness",
      "body": "   Simplify things so that you are working smarter not harder."
    }
  ]
}

