{
  "subject": "Funding Your Company",
  "credit": "Funding Your Company",
  "topic": "Fundraise",
  "todos": [
    {
      "id": "2562",
      "title": "https://www.elegalstudio.com/presentations/",
      "body": "-"
    },
    {
      "id": "2563",
      "title": "With a Convertible Note",
      "body": "Instead of giving him 20% of your company, you sign a convertible note with them.  The investor lends you the $100,000.  You agree to grow his investment by 10% a year ($10,000) so that after year one his investment is worth $110,000 and so on.  You also agree to give him a 20% extra ownership in the deal when you are ready to set a valuation of your company (~ $20,000).  Down the road, when you improve your business and increase your valuation at $1,000,000, the investor can convert his original investment into $130,000 ($100,000 + $10,000 + ~$20,000) and they will get a 13% share in your company.  "
    },
    {
      "id": "2564",
      "title": "Debt",
      "body": "Getting a loan from a bank or financial institution.  The financial institution does not take ownership in your company but will likely require you to secure the loan with assets or personal guarantees."
    },
    {
      "id": "2565",
      "title": "Post-Revenue",
      "body": "Companies that have begun selling their product (may not yet be profitable)."
    },
    {
      "id": "2566",
      "title": "Collateral",
      "body": "Banks will require you to promise inventory, machinery, equipment, real estate to secure the loan in case of default.  Because startups do not have a lot of collateral or proven revenue, it is tougher for them to get bank loans."
    },
    {
      "id": "2567",
      "title": "Angel Investment Tax Credits",
      "body": "A fully refundable tax credit for investors who invest in your company.  If an investor puts $100,000 into your company, they can receive up to 40% (<$40,000) of their investment in a fully refundable tax credit.  A fully refundable tax credit means that even if they don't owe taxes that year, the State will cut them a check for $40,000.  "
    },
    {
      "id": "2568",
      "title": "Nebraska Prototype Grant",
      "body": "A $150,000 grant that is available to Nebraska companies.  These funds can be used to start your business and you do not have to pay the money back nor give out any equity in your company.  "
    },
    {
      "id": "2569",
      "title": "Balloon Loan",
      "body": "You borrow $100,000 from a bank at a 5% interest rate (annually) for 5 years.  Every year you are required to pay them 5% of the loan ($5,000) in monthly installments (~$416/month).   The entire loan amount ($100,000) is due at the end of 5 years."
    },
    {
      "id": "2570",
      "title": "Contests",
      "body": "Winning pitch contests with a cash prize.  "
    },
    {
      "id": "2571",
      "title": "Self-Funded",
      "body": "When you invest money in your own business."
    },
    {
      "id": "2572",
      "title": "Cap Rate",
      "body": "To prevent the abuse of convertible notes, investors will often put a cap on the valuation of the company (say $1,000,000).  If you end up increasing the value of the company to $10,000,000, the investors who used a convertible note will be able to cap their valuation at $1,000,000 so their investment of $130,000 will be worth 13% and not 1.3%."
    },
    {
      "id": "2573",
      "title": "Other Grants",
      "body": "There are many other federal, state, local, and private grants available to companies depending on the industry.  The best way to find grants is to contact your federal, state, and local economic development department or search online.  "
    },
    {
      "id": "2574",
      "title": "Line of Credit",
      "body": "The bank gives you a $100,000 line of credit at 5% interest rate.  You can use the loan only when needed and pay interest only on the amount you have borrowed at any given time.  If you use $10,000 of the line of credit, you pay 5% or $500/month.  "
    },
    {
      "id": "2575",
      "title": "Initial Public Offering (IPO)",
      "body": "Taking your company public where anyone can buy shares of your company through registered stock markets."
    },
    {
      "id": "2576",
      "title": "Revenue",
      "body": "Selling your product, pre-selling, crowd-funding.  The most desirable form of raising capital."
    },
    {
      "id": "2577",
      "title": "Equity",
      "body": "Selling ownership of your company to investors for money.  "
    },
    {
      "id": "2578",
      "title": "Without a Convertible Note",
      "body": "Say an investor wants to give you $100,000.  Say at the time your company is worth $500,000.  If you were to give him equity at this time you would have to give him 20%.  Say you don't know how to value your company at that time and want to retain as much ownership as possible.  "
    },
    {
      "id": "2579",
      "title": "Super Angels",
      "body": "Professional investors that invest substantial amounts in early-stage companies."
    },
    {
      "id": "2580",
      "title": "Angels",
      "body": "Professional investors that invest modest amounts in early-stage companies (pre or post-revenue)."
    },
    {
      "id": "2581",
      "title": "Venture Capital/Private Equity/Family Offices",
      "body": "Professional investment companies that invest in mid to late stage companies (post revenue).  "
    },
    {
      "id": "2582",
      "title": "Seed Round",
      "body": "Pre-revenue fundraising round for early stage companies.  "
    },
    {
      "id": "2583",
      "title": "Series Round",
      "body": "Post-revenue fundraising round for companies that are generating a certain monthly recurring revenue ($8-12K).  Your first series round is Series A, then Series B, etc.  This round is usually a priced round which means you have established a valuation of your company.  If you value your company at $1,000,000 and an investor invests $100,0000.  They will get 10% of your company.  "
    },
    {
      "id": "2584",
      "title": "Accelerators",
      "body": "Organizations that support startups by  1). teaching them how to grow their company and 2.) investing in their company for a set percentage."
    },
    {
      "id": "2585",
      "title": "Family, Friends, and Fools",
      "body": "Investors that buy ownership in your business early on (pre-revenue or minimum viable product)."
    },
    {
      "id": "2586",
      "title": "Hybrid Debt-Equity Instruments",
      "body": "Instruments like convertible notes which include debt and equity components (described below)."
    },
    {
      "id": "2587",
      "title": "The Benefits",
      "body": "If you would have given the investor equity when they first invested, they would have owned 20% of your company.  With the convertible note they own 13% of your company and you retain greater ownership."
    },
    {
      "id": "2588",
      "title": "Grants & Gov't Programs",
      "body": "Getting money from federal, state, local, or private grants.  "
    },
    {
      "id": "2589",
      "title": "Professional Investment Firms",
      "body": "Firms that help companies go public (IPO)."
    },
    {
      "id": "2590",
      "title": "Pre-Revenue",
      "body": "Early stage companies that have not begun selling their product or service."
    },
    {
      "id": "2591",
      "title": "Mortgage",
      "body": "A loan where you pay off the principal and interest over the term of the loan.  At the end of the loan you don't have a lump sum payment.  If you borrow $100,000 at 5% interest for 30 years, you would pay 5% interest monthly (~$416/month) plus a portion of the principal payment (~$121/month) for a total of (~537/month).  The additional principal payment is made so that at the end of the 30 years, the loan would be completely paid off.  This loan is used in most real estate deals."
    },
    {
      "id": "2592",
      "title": "Purpose",
      "body": "A convertible note is a hybrid debt-equity instrument used when you don't have a valuation for your company."
    },
    {
      "id": "2593",
      "title": "1.''''' TYPES OF CAPITAL",
      "body": "-"
    },
    {
      "id": "2594",
      "title": "2.''''' DEBT",
      "body": "-"
    },
    {
      "id": "2595",
      "title": "3.''''' EQUITY (TYPES OS FUNDRAISING ROUNDS)",
      "body": "-"
    },
    {
      "id": "2596",
      "title": "4.''''' EQUITY (TYPES INVESTORS)",
      "body": "-"
    },
    {
      "id": "2597",
      "title": "5.''''' GRANTS",
      "body": "-"
    },
    {
      "id": "2598",
      "title": "6.''''' CONTESTS",
      "body": "-"
    },
    {
      "id": "2599",
      "title": "7.''''' CONVERTIBLE NOTES",
      "body": "-"
    },
    {
      "id": "2600",
      "title": "8.''''' MORE RESOURCES",
      "body": "-"
    },
    {
      "id": "2601",
      "title": "There are lots of pitch contests and reverse pitch contests where startups can win money for their business.  Sometimes the money has strings attached (such as in the form of an investment) and sometimes it is free and clear.  A reverse pitch contest is where an organization pitches their problem and startups present them a solution.  This is a great way of getting a corporate sponsor.  ",
      "body": "-"
    }
  ]
}

