{
  "subject": "FUNDRAISING CHECKLIST",
  "credit": "FUNDRAISING CHECKLIST",
  "topic": "Fundraise",
  "todos": [
    {
      "id": "2602",
      "title": "AVOID LIQUIDATION PREFERENCE",
      "body": "The word 'preference' flows from 'preferred' and means that the shares of the preferred stock will have a priority over (i.e., will be treated better than) the common stock in the event of a liquidation."
    },
    {
      "id": "2603",
      "title": "EMPLOYMENT LAWS",
      "body": "The most common employment violations are (i) misclassifying an employee as an independent contractor and/or (ii) failing to pay an employee the minimum wage.  Both violations could lead to the same result  criminal liability for the failure to properly pay wages."
    },
    {
      "id": "2604",
      "title": "MEET WITH INVESTORS EARLY",
      "body": "Tell them you're not raising money yet but you will be in the next 6 months or so.  Tell them you want them to have an early view.  Investors want to make sure they're in love with you before they invest.  "
    },
    {
      "id": "2605",
      "title": "VESTING SCHEDULE",
      "body": "Sweat equity or other ownership vests over time.  The most common founder schedule vests an equal percentage of stock (25%) every year for four years on a monthly basis.  Sometimes, however, it may be appropriate to impose a one-year 'cliff' (i.e., the founders would not get their first 25% unless they have remained with the company for 12 months) ' particularly where the founders don't know each other or don't have a history of working together."
    },
    {
      "id": "2606",
      "title": "MEETING SEQUENCE",
      "body": "Save the more important pitches for last so that you have practice from previous pitches."
    },
    {
      "id": "2607",
      "title": "COMPLY WITH SECURITIES LAWS",
      "body": "Rule #1  only sell 'securities' to 'accredited investors' ' why? (i) Rule 506 preempts State law, which means all you have to do is file a Form D and pay a filing fee; and (ii) no written disclosure requirement/PPM.  Rule #2  do not pay 'finder's fees'/commissions unless the finder is a registered 'broker-dealer'.  Rule #3  do not make materially false or misleading statements in connection with the offer or sale of securities; Rule #4"
    },
    {
      "id": "2608",
      "title": "TAX LAWS",
      "body": "One of the most common violations of tax laws by startups that could lead to the criminal liability of a founder is the willful failure to 'pay over' payroll taxes withheld from employees. Similarly, if a startup collects sales taxes from its customers and then fails to remit it to the applicable state taxing authority, founders could be charged with theft of state funds.  Obviously, the failure to pay applicable federal and/or state income taxes could lead to criminal liability."
    },
    {
      "id": "2609",
      "title": "FUNDRAISE IN PARRALEL, NOT SEQUENTIALLY",
      "body": "Meet investors at the same time.  Don't not wait for one investor to turn you down before meeting with the next investor.  Negotiate concurrently, not consecutively.  Use psychologies of influence.  "
    },
    {
      "id": "2610",
      "title": "SETUP DELAWARE CORPORATION",
      "body": "LLC's are geared for private equity funds, hedge funds and real estate guys, not startups, for a number of reasons  (i) extremely complicated tax partnership rules; (ii) creates capitalization/capital raising problems ' e.g., essentially does not allow for stock options plans and convertible notes, etc.; (iii) VC's typically don't invest in pass-through entities; (iv) more costly and complicated on an ongoing basis.  Delaware is the place to incorporate regardless of where you are located for a number of significant reasons  (i) VC's and other sophisticated investors will require you to be incorporated in Delaware; (ii) Delaware has an extremely efficient and sophisticated court system geared to business and corporate law; (iii) Board protections; (iv) administrative ease; and (v) demonstrates a certain level of credibility with investors and potential acquirers (vi) Section 1202 stock exchange (capital gains exclusion)"
    },
    {
      "id": "2611",
      "title": "INVESTOR DUE DILIGENCE",
      "body": "Learn about investor, break bread and have a beer.  Get references.  "
    },
    {
      "id": "2612",
      "title": "PITCH DECK",
      "body": "Keep your pitch deck to 10 slides or less. Don't use too many slides, be as visual as possible.  Tell the story of your startup.  Identify the problem and give a product demo.  "
    },
    {
      "id": "2613",
      "title": "PITCH",
      "body": "Keep it short and concise.  First off, show enthusiasm and make your pitch personal!  Tell about the problem you're solving.  Show your solution.  Show early results if you have them.  Why are you the man/woman/team that's going to take this to the moon?  How can I help you? Asking for specific feedback is also good. It's difficult to help when your question is simply  'what do you think?'"
    },
    {
      "id": "2614",
      "title": "PRIVACY LAWS",
      "body": "It is imperative that startups have proper privacy policies in place and carefully adhere to them.  "
    },
    {
      "id": "2615",
      "title": "FUNDRAISING PROCESS",
      "body": "Get first meeting.  Get partner meeting.  Get the first term sheet.  Sign term sheet.  Close the deal."
    },
    {
      "id": "2616",
      "title": "Study Audience",
      "body": "Gauge the intensity, seriousness, age, learning style of your audience before you engage."
    },
    {
      "id": "2619",
      "title": "BATNA",
      "body": "Always be prepared with your best alternative to negotiated agreement (what you will do if the other party doesn't play ball).  This will promote your bargaining power by showing scarcity (the deal may not be available for much longer), and social proof (others want to be involved).  "
    },
    {
      "id": "2620",
      "title": "ISSUE CONVERTIBLE NOTES FOR SEED ROUND",
      "body": "A convertible note is short-term debt that converts into equity.  "
    },
    {
      "id": "2621",
      "title": "Selling Internal Framed People",
      "body": "You have to tell them that there is no way you can convince them, that they themselves are going to have to experience it or they themselves are the only ones that are going to know who would lose if you didn't invest/participate/use it.  "
    },
    {
      "id": "2622",
      "title": "Internal v External Frame Metaprogram",
      "body": "Some people look to others for their approval or rating, other people look within to that approval or rating.  Good leaders need to have internal framing.  External people rarely come up to you and tell you what you should do and how you should do it.  "
    },
    {
      "id": "2623",
      "title": "Self or Others Metaprogram",
      "body": "Some people look at human interactions as what is in it for themselves and others look at what is in it for themselves and others.  "
    },
    {
      "id": "2624",
      "title": "Distance Metaprogram",
      "body": "Moving towards or moving away.  Some people approach life with what they want and others what they want to avoid.  Discover the persons preference and then communicate with them in that same way.  If they move away, then communicate them how things will reduce risk and avoid loss, it they move towards, communicate to them on what they have to gain from action."
    },
    {
      "id": "2625",
      "title": "Match & Lead",
      "body": "Mirror the persons physiology and then slowly bring them into your physiology.  Occasionally you need to be just as intense with the other person and then bring them back to a calm level.  "
    },
    {
      "id": "2626",
      "title": "Zuckerberg problem",
      "body": "IP is not assigned to the company by the founders and/or third-party developers (including foreigners)."
    },
    {
      "id": "2627",
      "title": "Moonlighting problem",
      "body": "If you work on your startup while currently employed by another company, your employer may have rights to your intellectual property/invention."
    },
    {
      "id": "2628",
      "title": "Create Value for Person Your Asking",
      "body": "How can you help them first.  Do two things for them before you ask for one thing.  "
    },
    {
      "id": "2629",
      "title": "Mirroring",
      "body": "Form of building rapport.  When people are like each other they tend to like each other.  Mirror people's physiology, posture, breathing pattern, eye contact, body language, facial expressions, hand gestures.  If people are visual say things like I see your point, auditory, I hear what you are saying, that rings a bell, kinesthetic, I feel what your are saying."
    },
    {
      "id": "2630",
      "title": "Ask People That Can Help You",
      "body": "Find people that have the resources to help you."
    },
    {
      "id": "2631",
      "title": "Ask Specifically",
      "body": "Describe exactly what you need and what you need it for (use of funds).  "
    },
    {
      "id": "2632",
      "title": "Power of Precision",
      "body": "Communicate your ideas with great precision.  Don't overwhelm people with everything but help them focus on just what they need to know."
    },
    {
      "id": "2633",
      "title": "Congruency",
      "body": "Ask with focused congruent belief.  Make sure your entire physiology matches what you want and that you absolutely know you need it."
    },
    {
      "id": "2634",
      "title": "Ask Again",
      "body": "Ask until you get what you want.  Even if you have to go out and ask more people.  "
    },
    {
      "id": "2635",
      "title": "Convincer Strategy",
      "body": "Ask the person how do you know when someone is good at a job   do you have to see them, hear about how good they are, do it with them, or read about their ability."
    }
  ]
}

