{
  "subject": "GEOGRAPHY OF JOBS PATTERNS",
  "credit": "GEOGRAPHY OF JOBS PATTERNS",
  "todos": [
    {
      "id": "2703",
      "title": "KNOWLEDGE SPILLOVER",
      "body": "When people interact they learn from each other, making their peers more educated and creative.  Knowledge spillover is the reason that living in a major technology hub is important."
    },
    {
      "id": "2704",
      "title": "TWENTY-MINUTE RULE",
      "body": "Venture capitalists normally won’t invest if they are not within twenty minutes of the company.  "
    },
    {
      "id": "2705",
      "title": "SOFTWARE JOBS",
      "body": "U.S. Jobs in software have grown 562% over the past two decades.  Three times greater than the rest of the labor market."
    },
    {
      "id": "2706",
      "title": "TOP PATENT PRODUCERS",
      "body": "Top patent producers in the U.S. are IBM (5,866), Microsoft (3,086), Intel (1,652) and HP (1,480)."
    },
    {
      "id": "2707",
      "title": "VALIDATION",
      "body": "Thick markets also help companies because many tech firms do business with each other and it is easier to meet with prospective customers and demonstrate your prototypes if you are adjacent to each other."
    },
    {
      "id": "2708",
      "title": "BIG PUSH STRATEGY",
      "body": "There is only one way to break out of a trap, do something monumental.  The push needs to be really big, decisive, sustained, and target the right beneficiaries.  There is also a chance that the outcome can only be temporary."
    },
    {
      "id": "2709",
      "title": "NATURAL RESOURCES",
      "body": "There is no natural reason why innovation hubs develop where they are.  Companies tend to locate in the worst area or with the highest expenses.  "
    },
    {
      "id": "2710",
      "title": "INTERNET’S NET GAIN",
      "body": "The internet has created 1.2 million jobs and destroyed 500K jobs, a net gain of 700K.  "
    },
    {
      "id": "2711",
      "title": "EDUCATION",
      "body": "Technology hubs locate around populations with high educations.  The U.S. has failed to raise its percentage of college educated young adults substantially.  Demand will eventually outweigh supply.  The disparity in wages between educated and non-educated is increasing evermore.  U.S. is 23rd highest in math and science.  China is the first.  U.S. has done a good job attracting educated foreigners in contrast to other countries."
    },
    {
      "id": "2712",
      "title": "MANUFACTURING",
      "body": "Since 1985, the U.S. has lost an average of 372,000 manufacturing jobs per year.  Nevertheless, since 1970, U.S. manufacturing has doubled in output.  American factories produce the same output as China, double Japan, and several times Germany and Korea.  We are experiencing greater output with fewer jobs.  Wages in China are creeping up due to prosperity and more manufacturing jobs are returning home."
    },
    {
      "id": "2713",
      "title": "MAJOR US TECHNOLOGY HUBS",
      "body": "San-Francisco-San Jose, Austin Texas, San Diego, Boston, Seattle"
    },
    {
      "id": "2714",
      "title": "SPATIAL MISMATCH",
      "body": "Poor people and minorities suffer a structural mismatch because their homes are usually farther away from the best jobs.  See The Truly Disadvantaged by William Wilson.  "
    },
    {
      "id": "2715",
      "title": "AGRICULTURE",
      "body": "Only 1% of the population works in agriculture."
    },
    {
      "id": "2716",
      "title": "ECONOMIC INCENTIVES",
      "body": "Offering companies money to relocate is one of the few topics on which both Republicans and Democrats agree.  "
    },
    {
      "id": "2717",
      "title": "VACUUM",
      "body": "New ideas are rarely born in a vacuum."
    },
    {
      "id": "2718",
      "title": "LINCOLN, NE",
      "body": "Lincoln has the 18th highest percentage of workers with a college degree, yet one of the lowest average salaries for college graduates."
    },
    {
      "id": "2719",
      "title": "HUAWEI",
      "body": "Largest patent filer in China."
    },
    {
      "id": "2720",
      "title": "NON-TRADABLE SECTOR",
      "body": "Jobs that are produced locally (waiter, plumber, hairdresser, real estate agent, nurse, teacher) and cannot be exported.  "
    },
    {
      "id": "2721",
      "title": "WINNING INDUSTRIES",
      "body": "It is too difficult for policymakers to identify winning industries before they become winners.  "
    },
    {
      "id": "2722",
      "title": "IMMIGRANTS",
      "body": "Immigrants are 30% more likely than non-immigrants to start a business.  "
    },
    {
      "id": "2723",
      "title": "BRAIN DRAIN",
      "body": "Google offers employees to start their own enterprises within Google if they threaten to leave."
    },
    {
      "id": "2724",
      "title": "MULTIPLIER EFFECT",
      "body": "For each new high-tech job in a city, five additional jobs are ultimately created outside of the high-tech sector both in skilled occupations and unskilled occupations (high tech workers are paid more and draw additional high tech firms to the city).  For each new manufacturing job, only 1.6 additional jobs are created."
    },
    {
      "id": "2725",
      "title": "MOBILITY",
      "body": "Fifty percent of Americans change addresses every five years.  Thirty three percent live in a state other than which they were born (up from 20% in 1990).  In contrast, Europeans are less mobile which makes it tougher for firms to find the right people and harms their economies.  The more educated a person is the more mobile they are willing to be.  Some gov’ts are institution relocation vouchers to help reduce unemployment and match workers with the right cities and companies."
    },
    {
      "id": "2726",
      "title": "PEOPLE, NOT PRODUCTS",
      "body": "Facebook paid bought FriendFeed, not for the product but to acquire Bret Taylor and his staff, paying effectively $4million up front for each employee.  “Someone who is exceptional in their role is not just a little better, they are 100 times better.” - Zuckerburg"
    },
    {
      "id": "2727",
      "title": "FACEBOOK MULTIPLIER",
      "body": "Facebook employees 2,500 around the world.  Facebook apps have directly crated 53,000 new jobs and indirectly created 130,000 more jobs in related businesses."
    },
    {
      "id": "2728",
      "title": "THICKNESS",
      "body": "Companies locate in innovation hubs because thick labor markets have more opportunities to match employers with workers.  Workers will change jobs more often in thicker markets and spouses are more likely to find jobs the meet the tastes and preferences of both couples.  "
    },
    {
      "id": "2729",
      "title": "SPENDING HABITS",
      "body": "Americans spend 14% of income on food and beverage, 17% on transportation, 3% on apparel, 6% on medical, 5% on recreation, 6% on education and communication, and 40% on housing.  Technology hubs represent the highest cost of living cities."
    }
  ]
}

