{
  "subject": "GET BACKED CHECKLIST",
  "credit": "GET BACKED CHECKLIST",
  "todos": [
    {
      "id": "2730",
      "title": "Origin Story",
      "body": "Your living life as normal, suddenly you have an epiphany and call to adventure, you accept the challenge and take bold action, action gives you a new sense of purpose and continues to motivate you."
    },
    {
      "id": "2731",
      "title": "TAM",
      "body": "Total Addressable Market"
    },
    {
      "id": "2732",
      "title": "Cheap stock photos",
      "body": "Stocksy and creative market."
    },
    {
      "id": "2733",
      "title": "Good Design",
      "body": "Sight is our fastest sense and good aesthetic design improves clarity.  "
    },
    {
      "id": "2734",
      "title": "SAM",
      "body": "Serviceable Addressable Market"
    },
    {
      "id": "2735",
      "title": "Five Ways of Showing",
      "body": "Portraits, maps, charts, timelines, flowcharts."
    },
    {
      "id": "2736",
      "title": "Pixar Pitch",
      "body": "Once upon a time there was a …  Every day… One day…  Because of that …  Because of that …  Until finally."
    },
    {
      "id": "2737",
      "title": "Customer Story",
      "body": "Meet Joe, Joe has a problem that really bothers him, he tried all sorts of things but still can’t solve his problem, one day Joe finds our product, Joe is happy and tells his friends, don’t you want to be like Joe."
    },
    {
      "id": "2738",
      "title": "Intros",
      "body": "Keep them short.  Nourish and protect your network."
    },
    {
      "id": "2739",
      "title": "Hard Charger",
      "body": "I’ve got a big task for you.  Will you invest $1 Million. (Hard Pause)"
    },
    {
      "id": "2740",
      "title": "Cost of Customer",
      "body": "How much money and time does it take to acquire a customer."
    },
    {
      "id": "2741",
      "title": "Extra slides",
      "body": "FAQ, history, products, market, patents, mentors, financials, investment successes, milestones achieved, branding, product road map, mission, vision, pictures, supply chain, how it works, risks, differentiation, locations, geographic growth plans, screenshots, sales funnel, customer acquisition strategy, customer lifetime value, blueprints, value proposition, competitive advantage, strategic partnerships, customer quotes, comparable companies, case studies, org chart, exit strategy, other companies that have successfully exited, conclusion, valuation."
    },
    {
      "id": "2742",
      "title": "Four ways to raise money",
      "body": "bootstrapping, debt, sell equity, get people to donate."
    },
    {
      "id": "2743",
      "title": "Words are Not Enough",
      "body": "Your evidence and words will not be enough, people need to hear, see, and smell your success from others or see it themselves first handed."
    },
    {
      "id": "2744",
      "title": "Notable Accelerators",
      "body": "Y Combinator, 500 Startups, Techstars, Seedcamp."
    },
    {
      "id": "2745",
      "title": "Momentum",
      "body": "We’ve already succeeded in finding much of the funding we need.  There are still a few spots left.  I’d love for you to be the one to close us out.  Can I count on you for $1 Million? (Hard Pause)"
    },
    {
      "id": "2746",
      "title": "Testing Waters",
      "body": "We’re going to be looking for investors.  When the time comes would this be something you’re interested in."
    },
    {
      "id": "2747",
      "title": "Raising on Angel List",
      "body": "Try to connect as many people to your profile as you can."
    },
    {
      "id": "2748",
      "title": "Echo",
      "body": "Tell someone what you do and ask them to explain it back to you."
    },
    {
      "id": "2749",
      "title": "Questions to Ask Investors",
      "body": "Tell me about an investment that went sour.  How many investments have you made.  "
    },
    {
      "id": "2750",
      "title": "Newsle",
      "body": "Syncs with e-mail to find news articles on people you are connected to."
    },
    {
      "id": "2751",
      "title": "Passion",
      "body": "Speak with the utmost passion about what you do and look at your investors in the eyes, not at the slides.  Show up with the intention of making friends with everyone.  "
    },
    {
      "id": "2752",
      "title": "Hero’s Journey (“The” Story)",
      "body": "Ordinary world and limited awareness of problem, increased awareness and call to adventure, refusal of the call and reluctance to change, meeting with mentor and overcoming reluctance, crossing the threshold and committing to change, meeting allies and enemies to test the first change, approach the inmost cave and preparing for big change, ordeal and attempting a big change, reward and setbacks, rededication to the change, resurrection and final attempt at a big change, final mastery of problem and return with the elixr."
    },
    {
      "id": "2753",
      "title": "Typography",
      "body": "Most designers will only use two fonts for a project."
    },
    {
      "id": "2754",
      "title": "Due Diligence on Investors",
      "body": "LinkedIn, Gust, AngelList, Quora."
    },
    {
      "id": "2755",
      "title": "Stationary Companies",
      "body": "Letterpress, crane, americanstationery, papyrus, smythson, neimanmarcus, feltapp, hellobond."
    },
    {
      "id": "2756",
      "title": "Crowdfunding Platforms",
      "body": "Kickstarter, CircleUp, Indiegogo, Crowdfunder."
    },
    {
      "id": "2757",
      "title": "Partnership",
      "body": "It’s clear you have a passion and expertise in this industry.  You are exactly the type of partner we will need.  Will you consider joining me."
    },
    {
      "id": "2758",
      "title": "Drunk Hemingway Pitch",
      "body": "It is a good … because it is a …. … .  There’s nothing … and … about …., unless you … . And then, it’s not only … but …. .  It is a good home improvement store because it is a smart home improvement store.  There’s nothing fun and exciting about housework unless you are building a home you love.  And then, it’s not only fun but beautiful."
    },
    {
      "id": "2759",
      "title": "Resolution",
      "body": "Images should at least be 1024x768"
    },
    {
      "id": "2760",
      "title": "Beaming Review Pitch",
      "body": "If you were to get the best customer review what would it say.  "
    },
    {
      "id": "2761",
      "title": "Two-word pitch",
      "body": "If you could only use two words to describe what you do what would they be.  "
    },
    {
      "id": "2762",
      "title": "Pre-Money Valuation",
      "body": "How much the company is worth before money was put into it."
    },
    {
      "id": "2763",
      "title": "People Like You",
      "body": "Hey, I really like you guys.  I think we’ve got a great opportunity.  Why don’t we do something amazing together."
    },
    {
      "id": "2764",
      "title": "Free stock photos",
      "body": "Google (search filter creative commons), Unsplash, Death to Stock Photo."
    },
    {
      "id": "2765",
      "title": "Jedi Mind Pitch Exercise",
      "body": "Give someone your elevator pitch and ask them what the first thing that comes to mind is."
    },
    {
      "id": "2766",
      "title": "Pitch Deck",
      "body": "Get people to understand, care, and take action."
    },
    {
      "id": "2767",
      "title": "Friendship Loop",
      "body": "Get an intro to someone who can help your business move forward, build a relationship and play together, delight through gratitude, follow-up, making intros for them, and helping them with resources, invite them into the adventure through partnership, etc."
    },
    {
      "id": "2768",
      "title": "Investors",
      "body": "Find ways to date your investors.  If you want advice, ask for money, if you want money, ask for advice."
    },
    {
      "id": "2769",
      "title": "Image Ordering",
      "body": "Establishing shot shows the environment as a whole to orient the viewer.  Medium shots show most and sometimes all of the body and communicate action or something occurring.  Close ups show intensity and emotion.  Bleeds break the fourth wall between the image and the world we are in.  Centered image shots communicate motion, mystery and attention.  "
    },
    {
      "id": "2770",
      "title": "Intro",
      "body": "Don’t talk to investors without an intro to them."
    },
    {
      "id": "2771",
      "title": "Focus Pitch",
      "body": "Don’t pitch everyone, focus on the investors who you want and who will invest."
    },
    {
      "id": "2772",
      "title": "Gridlines",
      "body": "Creates consistency among design.  Rule of thirds is the most impactful layout."
    },
    {
      "id": "2773",
      "title": "Building Blocks of Pitch Deck",
      "body": "Cover (what they should expect), Overview (who you are), Opportunity (why now), Problem (what your trying to solve), Solution (your solution), Traction (evidence of success), Customer or Market (who and how many are your customers), Competition (who will steal your customers), Business Model (how do you make money), Team (who is going to pull this off), Use of Funds (what do you want and why)."
    },
    {
      "id": "2774",
      "title": "Great Pitch",
      "body": "Combines the familiar with the intriguing."
    },
    {
      "id": "2775",
      "title": "Format",
      "body": "Capture audience attention in the top third of the slide.  If you can limit each slide to ten words or less.  Each slide should have no more than a title, short phrase, and 1-3 sentence paragraph.  "
    },
    {
      "id": "2776",
      "title": "Connection",
      "body": "Build trust with weak ties and super connectors who can make intros for you."
    },
    {
      "id": "2777",
      "title": "Build trust",
      "body": "Ask for feedback.  Provide value to them through intros.  Connect over your shared appreciation of someone that introduced you.  Find commonalities (mutual friends, hobbies, causes, languages, locations, education).  Show that you are paying attention to what is happening in their life.  Remember things that they like or are doing and have small gift show up on their doorstep (book, small gift, wine, tickets, donations).  Don’t ask them for things, just keep them updated on what your company needs help with.  "
    }
  ]
}

