{
  "subject": "Get Out of The Building",
  "credit": "Get Out of The Building",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "2778",
      "title": "http://sensible.com/downloads-rsme.html",
      "body": "-"
    },
    {
      "id": "2779",
      "title": "http://customerdevlabs.com/",
      "body": "-"
    },
    {
      "id": "2780",
      "title": "Wizard of Oz Test",
      "body": "Zappos wanted to test whether people would buy shoes online.  They went around to shoe stores, took pictures of shoes, posted them on their website.  When customers ordered the shoes, they went back to the stores, bought and shipped them.  The process was very time consuming and they lost money.  However, they ended up validating what would eventually become a billion-dollar business."
    },
    {
      "id": "2781",
      "title": "Justin Wilcox - Customer Discovery",
      "body": "What Do You Ask"
    },
    {
      "id": "2782",
      "title": "Consultation",
      "body": "Another way to sell before you have a product is to sell the product as a consulting service or a watered-down version.  For example, if you plan on creating an automatic pet washing machine, first try to sell pet cleaning services."
    },
    {
      "id": "2783",
      "title": "Always start every conversation with one of two magic question",
      "body": "1.) what do you think is the biggest problem with _(insert subject)_, and 2.) why, why, why?"
    },
    {
      "id": "2784",
      "title": "People are only good at answering two basic types of questions",
      "body": "1.) what they don't like and 2.) what they've done in the past.  Structure all your questions around these two basic concepts.  People are not very good at predicting what they will do in the future or understanding what they even want as a consumer."
    },
    {
      "id": "2785",
      "title": "1.''''' FINDING THE RIGHT PEOPLE TO VALIDATE",
      "body": "-"
    },
    {
      "id": "2786",
      "title": "2.''''' VALIDATION METHODS",
      "body": "-"
    },
    {
      "id": "2787",
      "title": "3.''''' HOW TO CONDUCT A VALIDATION INTERVIEW AND AVOIDING BIAS",
      "body": "-"
    },
    {
      "id": "2788",
      "title": "4.''''' ADDITIONAL RESOURCES",
      "body": "-"
    },
    {
      "id": "2789",
      "title": "A wonderful way to learn whether you have a promising idea is to usability test a competitor's products/services and try to gauge what the customers like or don't like about those products/services.  This will help you understand if there is a need for your product/service and a big enough gap in the current offerings. ",
      "body": "-"
    },
    {
      "id": "2790",
      "title": "A. Get Out of The Building",
      "body": "-"
    },
    {
      "id": "2791",
      "title": "A. Keep it Simple",
      "body": "-"
    },
    {
      "id": "2792",
      "title": "A. Two Magic Questions",
      "body": "-"
    },
    {
      "id": "2793",
      "title": "B. Be Careful with Surveys",
      "body": "-"
    },
    {
      "id": "2794",
      "title": "B. Be Prepared & Record Conversation",
      "body": "-"
    },
    {
      "id": "2795",
      "title": "B. Validate Your End Users or Buyers",
      "body": "-"
    },
    {
      "id": "2796",
      "title": "C. Avoid Bias",
      "body": "-"
    },
    {
      "id": "2797",
      "title": "C. How to Find People To Validate",
      "body": "-"
    },
    {
      "id": "2798",
      "title": "C. Validation Interviews ",
      "body": "-"
    },
    {
      "id": "2799",
      "title": "Check Out These Documents",
      "body": "-"
    },
    {
      "id": "2800",
      "title": "Come prepared with a script, questions, and visualizations/mockups.  Ask them if it is okay to record the conversation",
      "body": "-"
    },
    {
      "id": "2801",
      "title": "D. Give Your Respondents Permission to Be Candid",
      "body": "-"
    },
    {
      "id": "2802",
      "title": "D. Shadow Customers ",
      "body": "-"
    },
    {
      "id": "2803",
      "title": "Don't lead with what you do, lead to what you do. The moment your respondent knows what you are validating, they are biased.  They will modify their response to avoid sounding stupid or making you feel stupid.  It's okay to give them a broad idea of what you are working on but try to leave out the details until after they have answered all your questions. ",
      "body": "-"
    },
    {
      "id": "2804",
      "title": "E. Competitor Usability Testing",
      "body": "-"
    },
    {
      "id": "2805",
      "title": "E. People Don't Know What They Want or Will Do",
      "body": "-"
    },
    {
      "id": "2806",
      "title": "Early stage validation is one of the only times where being wrong should be encouraged.  Being wrong means, you saved yourself the time and money of pursing an idea or version of your idea that would have failed.  Being wrong means, you can pivot to a better idea or better version of your idea quicker than the competition.  ",
      "body": "-"
    },
    {
      "id": "2807",
      "title": "Even when you find your end customer, they many often tell you that your idea is great because they don't want to sound stupid or make you sound stupid.  It's typical for entrepreneurs to spend lots of money to develop an idea, to discover that nobody will buy it because it doesn't solve the root cause of their customers' problem.  ",
      "body": "-"
    },
    {
      "id": "2808",
      "title": "F. Dig Deep to Identify Root Causes Of Their Problems",
      "body": "-"
    },
    {
      "id": "2809",
      "title": "F. Let Them Struggle",
      "body": "-"
    },
    {
      "id": "2810",
      "title": "G. Confuse and Bewilder",
      "body": "-"
    },
    {
      "id": "2811",
      "title": "G. Try To Sell Something",
      "body": "-"
    },
    {
      "id": "2812",
      "title": "Google Customer Discovery - How to do a user interview",
      "body": "-"
    },
    {
      "id": "2813",
      "title": "H. Better Wrong Than Vague",
      "body": "-"
    },
    {
      "id": "2814",
      "title": "Here's some tips to helping you find the right people, asking the right questions, and getting the most reliable information.",
      "body": "-"
    },
    {
      "id": "2815",
      "title": "I. Importance of Thank You",
      "body": "-"
    },
    {
      "id": "2816",
      "title": "If you're testing your product or a competitor's product, let the customer struggle when they run into a challenge.  This helps you identify ways they interact with the program and whether they can eventually figure it out.  Let them flounder and make mistakes and record the mistakes they made.  Allow this to continue for three or four minutes, at most. ",
      "body": "-"
    },
    {
      "id": "2817",
      "title": "If your trying to sell your product/service to hospitals, validating the front-desk volunteer person isn't going to get you the information you need.  You need to validate the end users (doctors, nurses) or whomever writes the checks (hospital administrators).  ",
      "body": "-"
    },
    {
      "id": "2818",
      "title": "Look for people that are connected to you online (LinkedIn, Facebook) that meet your end-user profile description.  Attend meetups, trade conferences, professional organizations, network organizations.  Ask your family, friends, professors, mentors, co-workers if they know anyone in your target market.",
      "body": "-"
    },
    {
      "id": "2819",
      "title": "One of the best ways to validate your end-user is to shadow them working.  You don't have to follow them at work for a week.  When you meet with them, ask them to show you or walk you through how they typically perform a task.",
      "body": "-"
    },
    {
      "id": "2820",
      "title": "People often agree, make things up, or remain silent because they don't want to sound stupid or hurt your feelings.  Remind them that you are not testing their knowledge and that they aren't going to hurt your feelings.  Remind them that the more candid they are, the more it will help your business.",
      "body": "-"
    },
    {
      "id": "2821",
      "title": "Set a reminder to follow up with your respondents 24 hours after your meeting to thank them for their time.  If you have the resources, send them a handwritten card with a $5 gift card to their local coffee house.  These respondents may become your customers or help you out with further testing so you want to treat them really well. ",
      "body": "-"
    },
    {
      "id": "2822",
      "title": "Steve Blank ' Acting on Customer Discovery",
      "body": "-"
    },
    {
      "id": "2823",
      "title": "Steve Blank - Conducting a Customer Interview",
      "body": "-"
    },
    {
      "id": "2824",
      "title": "Steve Krug - Do-It-Yourself Usability Testing with Steve Krug",
      "body": "-"
    },
    {
      "id": "2825",
      "title": "Surveys are great when you know a lot about your product/service but still have a couple specific questions you want to answer.  Surveys are not good when you are in early stage validation and have a lot of unknowns.  They take a lot of time to setup and you can't sit face to face with your customers and discover what you ought to be asking.  ",
      "body": "-"
    },
    {
      "id": "2826",
      "title": "The first step towards developing a solution to your problem is properly validating the problem and solution.",
      "body": "-"
    },
    {
      "id": "2827",
      "title": "The most accurate form of validation is for you to have a product/service that exists and ask the end-users to buy it.  If you don't have a product/service available here are a couple tricks. ",
      "body": "-"
    },
    {
      "id": "2828",
      "title": "Throughout the validation process, respondents will be trying to guess what you are working on.  Once they do, they are biased.  To prevent bias, add random questions that don't relate to your product or service.  ",
      "body": "-"
    },
    {
      "id": "2829",
      "title": "To learn how to competitor usability test, YouTube 'Steve Krug Do-It-Yourself Usability Testing with Steve Krug'. ",
      "body": "-"
    },
    {
      "id": "2830",
      "title": "Validating an idea may sound easy but it's surprisingly difficult to get reliable information.  Asking your friends and family if they like your idea doesn't help you discover whether you end customer will pay for it.  ",
      "body": "-"
    },
    {
      "id": "2831",
      "title": "Watch These YouTube Videos",
      "body": "-"
    },
    {
      "id": "2832",
      "title": "When you have many unknowns, the best approach is to meet in-person with 3 to 5 people that accurately represent your targeted end-user.  Have prepared a set of questions but don't be afraid to go off-script.   Look for patterns in their responses.  Use the information you learned from them to redefine your idea and next round of interviews.  Do it repeatedly until you keep hearing the same thing.    ",
      "body": "-"
    },
    {
      "id": "2833",
      "title": "When you validate, people will share their surface level problems and often not realize that they have a deeper problem that they haven't even recognized.  Try to uncover those deeper issues by continually asking 'why is that a problem or why is that important'. ",
      "body": "-"
    },
    {
      "id": "2834",
      "title": "You can't validate your idea unless you get of the building and your comfort zone to talk to people you don't know.  Don't be afraid to ask for their time.  People want to help.  It is part of our human nature.  ",
      "body": "-"
    },
    {
      "id": "2835",
      "title": "You don't need to test everything at once.  Ask yourself what is your biggest unknown and devise the smallest test you can to clarify that unknown.  ",
      "body": "-"
    }
  ]
}

