{
  "subject": "GOAL SETTING CHECKLIST",
  "credit": "GOAL SETTING CHECKLIST",
  "todos": [
    {
      "id": "2836",
      "title": "Roadblocks",
      "body": "Write down what prevents you from achieving those goals."
    },
    {
      "id": "2837",
      "title": "3 year goals",
      "body": "What it feels and looks like to work at the company in three years and what type of numbers you are hitting."
    },
    {
      "id": "2838",
      "title": "Sound Goal",
      "body": "Verify that your outcome is ecologically sound and desirable, it must benefit you and other people."
    },
    {
      "id": "2839",
      "title": "90 day rocks",
      "body": "Usually include 3-5 medium projects you want to accomplish in each quarter that get you to your 1 year goal (we are in Q2 - April to June)"
    },
    {
      "id": "2840",
      "title": "Review Rules",
      "body": "Review your goals with the rules above."
    },
    {
      "id": "2841",
      "title": "Four Most Important",
      "body": "Pick out the four most important goals for this year and write down why you will absolutely achieve them."
    },
    {
      "id": "2842",
      "title": "Resources",
      "body": "Make a list of important resources you already have at your disposal.  Focus on times you’ve used those resources most skillfully."
    },
    {
      "id": "2843",
      "title": "Evidence Procedure Rule",
      "body": "Have an evidence procedure (what will outcome look like)."
    },
    {
      "id": "2844",
      "title": "Traction Goals",
      "body": "Goals should be in 10y, 3y, 1y, 90day, and 1week, 1day"
    },
    {
      "id": "2845",
      "title": "Timing",
      "body": "Estimate when you plan to achieve each outcome."
    },
    {
      "id": "2846",
      "title": "Physiology",
      "body": "Describe the kind of person you would need to be to fulfill those goals."
    },
    {
      "id": "2847",
      "title": "10 year goals",
      "body": "Big hairy audacious dreams (ex  be on the cover of Sport’s Illustrated)"
    },
    {
      "id": "2848",
      "title": "Specific Terms Rule",
      "body": "Be as specific as possible, how does your outcome, look, sound, feel, smell, exactly when will you achieve it."
    },
    {
      "id": "2849",
      "title": "Always Prioritize",
      "body": "All goals should be prioritized meaning the most important are listed first and you always work on the most important (there is a common misconception that the most important goals things should be reactive items like putting out fires but instead they should be proactive)"
    },
    {
      "id": "2850",
      "title": "Be in control",
      "body": "Your outcome must be initiated and maintained by you.  It cannot be dependent upon another specific person."
    },
    {
      "id": "2851",
      "title": "Develop Models",
      "body": "Write down three to five people who have achieved what you want and specify words or behaviors that made them successful.  Close your eyes and imagine each of these people giving you advice.  "
    },
    {
      "id": "2852",
      "title": "Atmosphere",
      "body": "What does your home environment need to accomplish these goals.  Design your perfect environment.  What tools would you need, what does it look like, smell, feel, sound like.  "
    },
    {
      "id": "2853",
      "title": "Breaking Down Goals",
      "body": "The best way to accomplish a big hairy audacious goal is to break it down into smaller goals leading up to what are you going to do today.  "
    },
    {
      "id": "2854",
      "title": "Daily high pay off activities or high value targets (HPA/HVT)",
      "body": "The 3-5 tasks you want to get done each day to help achieve your weekly scorecards and quarterly rocks"
    },
    {
      "id": "2855",
      "title": "Imagine Better and It Will Happen",
      "body": "Take your finger, point it out, and swing it behind you and see how far you can rotate, now imagine in your mind going further and swing your arm back around, do it again."
    },
    {
      "id": "2856",
      "title": "Plan",
      "body": "Take four most important goals and write down a step by step plan.  "
    },
    {
      "id": "2857",
      "title": "Positive Terms Rule",
      "body": "State outcome in positive terms (what you want to happen, not what you want to avoid)."
    },
    {
      "id": "2858",
      "title": "Weekly scorecard measurable",
      "body": "Numbers you should track each week (think if you were a CEO on vacation and someone came to you and handed you only a sheet of numbers about your business, what would need to be on there for you to determine if you stay an extra week or need to head home)"
    },
    {
      "id": "2859",
      "title": "Dreams",
      "body": "Make an inventory of your dreams (things you want to have , do, be, and share)"
    },
    {
      "id": "2860",
      "title": "Gratitude Diary",
      "body": "Make a list of things that you already have that were once goals.  "
    },
    {
      "id": "2861",
      "title": "Set and Forget",
      "body": "In time you will be so good at setting goals that you will be able to set them and forget them (in other words, its not a great practice to be constantly changing your goals mid term).  That said, you should never start a goal if you know that it is no longer a priority or value added.  "
    },
    {
      "id": "2862",
      "title": "Binary v. Quantative",
      "body": "Goals can be measured by yes or no (project oriented goals such as Implementing CRM) or by numbers (quantitative goals such as on-board 25 customers)"
    },
    {
      "id": "2863",
      "title": "1 year goals",
      "body": "Focused on big picture projects, project development milestones, fundraising, cash flow, revenue, profit, customers, etc. that get you to your 3 year goal"
    },
    {
      "id": "2864",
      "title": "Ideal Day",
      "body": "Create your ideal day to achieve these goals."
    },
    {
      "id": "2865",
      "title": "Goals",
      "body": "A study was done following a large graduate class at Yale.  The study found that the 3 percent of the class that had written goals were worth more than the entire other 97%.  When the mind has a target it will focus and refocus until it completes its target."
    },
    {
      "id": "2866",
      "title": "Qualitative Goals",
      "body": "A qualitative goal is the type that is felt more than measured. The achievement of such goals is not based on measurable terms but on the impact of the satisfaction and worth it creates on a person (usually a manager, customer, team, survey group, etc)."
    }
  ]
}

