{
  "subject": "Hard Thing About Hard Things – Ben Horowitz",
  "credit": "Hard Thing About Hard Things – Ben Horowitz",
  "todos": [
    {
      "id": "3052",
      "title": "Both peacetime/wartime",
      "body": "Some CEOS aren’t equipped to be both peacetime and war-time CEOs."
    },
    {
      "id": "3053",
      "title": "Horowitz Beliefs",
      "body": "I believe in artificial deadlines, I believe in playing one against the other, I believe in doing anything and everything short of illegal or immoral to get the damned deal done."
    },
    {
      "id": "3054",
      "title": "Secret of being a CEO",
      "body": "Focus and make the best move when there are no good moves.  "
    },
    {
      "id": "3055",
      "title": "Wartime CEO",
      "body": "Fending off imminent existential threats."
    },
    {
      "id": "3056",
      "title": "Management Flaw #1",
      "body": "Failure to do performance meetings."
    },
    {
      "id": "3057",
      "title": "Struggle Checklist",
      "body": "Don’t put it all on your shoulders, there is always a move to play, don’t take it personally, play long enough and you’re bound to get lucky, this is what separates the women from the girls.  "
    },
    {
      "id": "3058",
      "title": "Two things technology company must do",
      "body": "Build a product that is ten times better than any other product.  Take it to market."
    },
    {
      "id": "3059",
      "title": "Good CEO",
      "body": "You must do many things that will upset people in the short run, unnatural things."
    },
    {
      "id": "3060",
      "title": "Technical debt",
      "body": "Writing or building shitty products that you have to go back and fix."
    },
    {
      "id": "3061",
      "title": "Nobody cares",
      "body": "When things go wrong in your company, nobody cares.  Don’t elaborate your misery, find the impossible solution to get out of your mess."
    },
    {
      "id": "3062",
      "title": "Scaling Management",
      "body": "We are doubling employees, therefore you will have a new and very different job and we will want to reevaluate you on the basis of that job.  If it makes you feel better, the rule gores for everyone on the team, including me."
    },
    {
      "id": "3063",
      "title": "CEO focus",
      "body": "vision, goals, motivation, decision, follow up.  "
    },
    {
      "id": "3064",
      "title": "Me vs We",
      "body": "The right kind of ambition is in the form of a team and should be heard as we.  "
    },
    {
      "id": "3065",
      "title": "Functional Training",
      "body": "The knowledge and skill people need to do their jobs.  "
    },
    {
      "id": "3066",
      "title": "Matching Executives",
      "body": "The job of a big company CEO is very different than the job of a small company CEO."
    },
    {
      "id": "3067",
      "title": "Single Biggest Personal Improvement as CEO",
      "body": "The day I stopped being too positive.  Don’t hold back because you think you will make the problem worse if you transfer it to employees.  Employees can often handle losses much better because they are not as attached to the company.  It will encourage trust, get more brains on the solution, and build culture."
    },
    {
      "id": "3068",
      "title": "Founders",
      "body": "Technical founders are the best to run companies."
    },
    {
      "id": "3069",
      "title": "Acquisitions",
      "body": "Talent and technology $5 to $50 million, product $25 to $250 million, business $250 and above."
    },
    {
      "id": "3070",
      "title": "Priority",
      "body": "Take care of the people, the products, and the profits in that order."
    },
    {
      "id": "3071",
      "title": "Shit sandwich",
      "body": "Surrounding negative feedback with positive crap.  Isn’t a great long-term solution."
    },
    {
      "id": "3072",
      "title": "Peter Principle",
      "body": "Sooner or later people get promoted to a position where they are not competent."
    },
    {
      "id": "3073",
      "title": "Silver vs. lead bullets",
      "body": "Silver bullets are the times you need to pivot.  Lead bullets are when the customer is buying but just not your product.  You have to build a better product."
    },
    {
      "id": "3074",
      "title": "Management debt",
      "body": "Short term management decisions with long-term consequences."
    },
    {
      "id": "3075",
      "title": "Calm nerves",
      "body": "Share with friends, write it on paper."
    },
    {
      "id": "3076",
      "title": "Management Training",
      "body": "Setting expectations for management team."
    },
    {
      "id": "3077",
      "title": "Peacetime CEO",
      "body": "Research and development, make things better, expand on the market.  "
    },
    {
      "id": "3078",
      "title": "Two in the box",
      "body": "Putting two people to run one leadership position.  Bad because there is no accountability."
    },
    {
      "id": "3079",
      "title": "Reasons for bad hire",
      "body": "Poor job defining the position, hired for lack of weakness instead of strength, hired for scale too soon, hire for a generic position, wrong kind of ambition, failed to integrate the person."
    },
    {
      "id": "3080",
      "title": "Shelf life",
      "body": "No technology company has a long shelf life.  Even the best ideas become terrible ideas after time."
    },
    {
      "id": "3081",
      "title": "CEOs",
      "body": "Must be good at gathering info and brainstorming and also getting things done.  Can the leader articulate a vision that’s interesting, dynamic, and compelling."
    },
    {
      "id": "3082",
      "title": "User experience",
      "body": "Many young companies focus too much on user retention and not enough on user experience.  "
    },
    {
      "id": "3083",
      "title": "Fundraising",
      "body": "Look for a market of one.  You only need one investor to invest, even if you have 30 that say no.  "
    },
    {
      "id": "3084",
      "title": "Clients and Investors",
      "body": "Like people who deliver what they say they are going to deliver."
    },
    {
      "id": "3085",
      "title": "Types of networks",
      "body": "large companies to sell to, executives to hire, engineers to hire, press and analysts, investors and acquirers."
    },
    {
      "id": "3086",
      "title": "Good product managers",
      "body": "Know the market, competition, CEO of product, well rounded, no excuses, focus, define target, create great collateral for communication, take written positions on important issues, think about value, think about story, err on side of clarity, report weekly.  "
    },
    {
      "id": "3087",
      "title": "Warrior mentality",
      "body": "Keep death in your mind so that you will live each day as it might be your last."
    },
    {
      "id": "3088",
      "title": "Single Man Holdup",
      "body": "It always comes down to a single person who can hold the entire project up.  Don’t let people get stuck on things for more than 24 hours."
    },
    {
      "id": "3089",
      "title": "Company is more than one person",
      "body": "If you strike out with one person at a company, find out who else you could approach.   "
    },
    {
      "id": "3090",
      "title": "CA Clause",
      "body": "If you release a new version of your software that has functionality of previous version and a new name, then that product is covered under original agreement."
    },
    {
      "id": "3091",
      "title": "Fire with Integrity",
      "body": "If you don’t treat the people who leave kindly then the people who stayed would have never trusted us."
    },
    {
      "id": "3092",
      "title": "Don’t Nibble",
      "body": "If you are going to eat shit, don’t nibble away at it, swallow it at once and move on."
    },
    {
      "id": "3093",
      "title": "Wartime Speech",
      "body": "I need you to do home tonight and have a serious conversation with your wife, husband, significant other, or whoever cares most about you and tell them ‘Ben needs me for the next six months.’ I need you to come in early and stay late.  I will buy you dinner, and I will stay here with you.  Make no mistake, we have one bullet left in the gun and we must hit the target.  "
    },
    {
      "id": "3094",
      "title": "Wartime General (Mark Cranney)",
      "body": "I don’t give a fuck how well trained you are.  If you don’t bring me five hundred thousand dollars a quarter I am going to put a bullet in your head."
    },
    {
      "id": "3095",
      "title": "Hype hyper target",
      "body": "Hyper target where your hype should go so you build enough momentum.  "
    },
    {
      "id": "3096",
      "title": "Colin Powell Moto",
      "body": "Hire for strength rather than lack of weakness."
    },
    {
      "id": "3097",
      "title": "Crippling the army",
      "body": "Giving your team a task that they cannot possibly perform.  "
    },
    {
      "id": "3098",
      "title": "Council Review",
      "body": "Give promotions via councils."
    },
    {
      "id": "3099",
      "title": "Freaky Friday",
      "body": "Get people to switch shoes."
    },
    {
      "id": "3100",
      "title": "Law of Crappy People",
      "body": "For any title level, the talent on that level will eventually converge to the crappiest person with that tile."
    },
    {
      "id": "3101",
      "title": "Scaling",
      "body": "Find a mentor that’s done it before.  Give ground, specialize, improve communication resources, who makes decisions, process for mitigating issues."
    },
    {
      "id": "3102",
      "title": "Three emotions of startups",
      "body": "Euphoria, terror, and hope."
    },
    {
      "id": "3103",
      "title": "Partnerships",
      "body": "Either become too tense to tolerate or not tense enough to be productive. Find that middle line."
    },
    {
      "id": "3104",
      "title": "Dump",
      "body": "Don’t rely too heavily on one client.  "
    },
    {
      "id": "3105",
      "title": "Laying off people",
      "body": "Don’t let it break the culture, get your head right, don’t delay, it is a company failure, not an individual failure, managers must layoff their own people, address the entire company, be visible afterwards, help the employee move on, use decisive language."
    },
    {
      "id": "3106",
      "title": "Solo decision",
      "body": "Despite many people being involved in the process, only the CEO should make the final decision.  Avoids politics."
    },
    {
      "id": "3107",
      "title": "Culture",
      "body": "Demand cultural compliance."
    },
    {
      "id": "3108",
      "title": "Andreesen Horowitz model",
      "body": "Connect clients to a firm-wide grid of new opportunities.  Firm is more powerful than any one agent."
    },
    {
      "id": "3109",
      "title": "Giving good feedback",
      "body": "be authentic, come from the team perspective, don’t get personal, don’t clown in front of peers, not one-sized fits all, be direct but not mean.  "
    },
    {
      "id": "3110",
      "title": "Size",
      "body": "At certain size, your company will do things so bad that you never imagined you would be associated with such incompetence."
    },
    {
      "id": "3111",
      "title": "When Scared",
      "body": "Ask yourself what would you do if you went bankrupt."
    },
    {
      "id": "3112",
      "title": "Perks",
      "body": "Are not culture (yoga, dogs, etc.)"
    },
    {
      "id": "3113",
      "title": "Cultural rules",
      "body": "Andreesen Horowitz maker people pay $10 for every minute they are late to a meeting with an entrepreneur to show a sign of respect for that entrepreneur."
    },
    {
      "id": "3114",
      "title": "CEO knowledge",
      "body": "A great CEO should get to know and act in every role in the company."
    }
  ]
}

