{
  "subject": "Henry Ford",
  "credit": "Henry Ford",
  "todos": [
    {
      "id": "3115",
      "title": "Upgrade Philosophy",
      "body": "We build our machines so that the new models don’t replace the old models but that all parts are all interchangeable.  We don’t want to force people to buy new vehicles every few years."
    },
    {
      "id": "3116",
      "title": "Purpose of Machines",
      "body": "Machines are not human’s enemy.  Unless we take time to understand the machines we will have no time to appreciate the rivers, trees, and birds."
    },
    {
      "id": "3117",
      "title": "Secret Recipe",
      "body": "Find a secret process or material (Vanadium Steel) to be 10x better."
    },
    {
      "id": "3118",
      "title": "Limit Choices",
      "body": "“Any customer can have any car in any color as long as it is black.”"
    },
    {
      "id": "3119",
      "title": "Strength",
      "body": "Weight does not equal strength.  Stay agile, light, and strong."
    },
    {
      "id": "3120",
      "title": "Machinery",
      "body": "We put more machinery per SF than any other factory."
    },
    {
      "id": "3121",
      "title": "Experts",
      "body": "We don’t keep experts around.  Men should always be looking to improve their skills and look for what’s next.  We are never satisfied with the way things are being done, there is always room for improved efficiencies."
    },
    {
      "id": "3122",
      "title": "Titles",
      "body": "We don’t believe in titles or hierarchies."
    },
    {
      "id": "3123",
      "title": "Unions",
      "body": "We deal only with our employees and never with outside parties."
    },
    {
      "id": "3124",
      "title": "Cash Reserves",
      "body": "We always keep a large amount of cash for a rainy day or golden opportunity.  "
    },
    {
      "id": "3125",
      "title": "Blocking True Service (2)",
      "body": "Waste and greed are what block the delivery of true service."
    },
    {
      "id": "3126",
      "title": "War",
      "body": "War is bad for business in long run.  Peace is a business’ best asset.  "
    },
    {
      "id": "3127",
      "title": "Tinkering",
      "body": "There is an immense amount you can learn from tinkering with things.  "
    },
    {
      "id": "3128",
      "title": "Institutionalism",
      "body": "The ordinary way of doing business is usually never the best way."
    },
    {
      "id": "3129",
      "title": "“To Order”",
      "body": "Production should be made “just in time”.  Storing things is a waste of resources."
    },
    {
      "id": "3130",
      "title": "Time Saving",
      "body": "One second of time saved can add quickly when you are doing repetitive work.  Most jobs are repetitive.  "
    },
    {
      "id": "3131",
      "title": "Two Fools",
      "body": "One is the millionaire who thinks that by hoarding his money he can somehow accumulate real power.  The other is the penniless reformer who thinks that if only he can take the money from one class and dive it to another, all the world’s problems will be fixed.  "
    },
    {
      "id": "3132",
      "title": "Volume",
      "body": "Never forget that you can increase revenue by lowering your prices and increasing unit sales."
    },
    {
      "id": "3133",
      "title": "Foreign Trade",
      "body": "Nations should be mostly self-supporting.  Only then can they start using their competitive advantages to setup a successful trade strategy.  "
    },
    {
      "id": "3134",
      "title": "Toys",
      "body": "My toys were always tools and they still are."
    },
    {
      "id": "3135",
      "title": "Money",
      "body": "Money is only worth what it will help buy you.  "
    },
    {
      "id": "3136",
      "title": "Saving",
      "body": "Instead of putting money in a bank or stocks, invest it in yourself or a means of production."
    },
    {
      "id": "3137",
      "title": "Charity",
      "body": "Giving unilateral handouts are disrespectful.  Everyone has something to contribute no matter how tough his or her situation is.  Fear is the root of poverty.  Banish fear and people will be self-reliant."
    },
    {
      "id": "3138",
      "title": "Core Business",
      "body": "Focus on your core business."
    },
    {
      "id": "3139",
      "title": "Poverty",
      "body": "Focus on providing equal opportunities for disenfranchised to get out of poverty.  Don’t give handouts."
    },
    {
      "id": "3140",
      "title": "Simplicity",
      "body": "Everything that we make is more complex than it needs to be.  "
    },
    {
      "id": "3141",
      "title": "Charity",
      "body": "Business and charity should not be combined.  "
    },
    {
      "id": "3142",
      "title": "Underdog",
      "body": "Be the underdog.  Everyone wants to root for the underdog.  "
    },
    {
      "id": "3143",
      "title": "Learning",
      "body": "Be interested in every subject and ignore limitations.  "
    },
    {
      "id": "3144",
      "title": "Knowledge",
      "body": "An educated person is not one whose memory is trained to carry a few dates in history he is one who can accomplish things.  School is a great investment in your future but you cannot learn in school what the world is going to do next year.  A man may be unlearned and very useful."
    },
    {
      "id": "3145",
      "title": "Resumes",
      "body": "A resume doesn’t tell whether a man can think and behave.  "
    },
    {
      "id": "3146",
      "title": "Time Allocated",
      "body": "A process must be setup so that a man is never rushed but doesn’t have extra time after completion."
    },
    {
      "id": "3147",
      "title": "Production Rules",
      "body": "1. Place men and tools in the sequence of the operation.  2. Use work slides so that once a persons work is done they can use gravity to drop the item and they don’t have to worry about it anymore. 3. Use sliding assembly lines where parts can be assembled and delivered at convenient distances.  "
    },
    {
      "id": "3148",
      "title": "Financial Management",
      "body": "1. Finance should not be placed ahead of work, 2. Thinking of money before work causes fear and failure, 3.  The way is clear for those who think in terms of service (doing the best work in the easiest way)."
    },
    {
      "id": "3149",
      "title": "Elements of Success",
      "body": "1. Absence of fear of future and veneration of past, 2. Disregard for competition, 3. Putting service before profit, 4. Buy fairly, transforming with the smallest amount of additional cost, and selling as low as reasonably possible."
    }
  ]
}

