{
  "subject": "Hope Is Not a Method Checklist",
  "credit": "Hope Is Not a Method Checklist",
  "topic": "Grit",
  "todos": [
    {
      "id": "3267",
      "title": "Plan for Failure",
      "body": "Whatever you plan for will always be wrong. What matters is in the moment when things happen that you have the infrastructure and flexibility to get it right."
    },
    {
      "id": "3268",
      "title": "De-Stress",
      "body": "Use music, nature, meditation, exercise, and spirituality to take a break."
    },
    {
      "id": "3269",
      "title": "Auto Suggestion",
      "body": "Tell yourself, every day we are getting better and better."
    },
    {
      "id": "3270",
      "title": "Leadership cycle",
      "body": "Sensing, reflecting, deciding, acting, learning, teaching."
    },
    {
      "id": "3271",
      "title": "Individual Dignity Entitlement",
      "body": "see Motorola is an example, list of questions to determine whether an employee has all they need to be successful at the job such as training resources prevention from harassment racism etc."
    },
    {
      "id": "3272",
      "title": "Leadership Goal",
      "body": "Reinforce values not facts."
    },
    {
      "id": "3273",
      "title": "Stress inoculation",
      "body": "Put yourself in really stressful situations to get used to it (ex  drill Sargent yelling at cadets)"
    },
    {
      "id": "3274",
      "title": "Power Projection",
      "body": "Projecting strength to prevent others from competing with you."
    },
    {
      "id": "3275",
      "title": "Visual Learning",
      "body": "Make people illustrate their thoughts, words are hard to communicate and dont express as much as pictures."
    },
    {
      "id": "3276",
      "title": "Leadership",
      "body": "Leadership is not about what you do but is about what you can influence others to do."
    },
    {
      "id": "3277",
      "title": "Survival Learning",
      "body": "is learning how to survive and respond to events."
    },
    {
      "id": "3278",
      "title": "Generative Learning",
      "body": "Is learning how to improve and become better even when things are going well."
    },
    {
      "id": "3279",
      "title": "After Action Review Planning",
      "body": "Implement after action review his learning and improving on the next time. Put those into sprint meetings.  Spend 25% on what happened, 25% on why it happened, and 50% on how to enforce the good and prevent the bad from happening again"
    },
    {
      "id": "3280",
      "title": "Forcing functions",
      "body": "Functions that require people to adapt to new changes and learn new things."
    },
    {
      "id": "3281",
      "title": "Teaching elements",
      "body": "Face-to-face conversation, repetition, proven value, listening ."
    },
    {
      "id": "3282",
      "title": "Change",
      "body": "Embrace change every day."
    },
    {
      "id": "3283",
      "title": "Doing Things Too Well",
      "body": "Dont be complacent, continue to change and re-invent or others will surpass you.  "
    },
    {
      "id": "3284",
      "title": "Three Leadership Traps",
      "body": "Doing things too well, being in the wrong business, making yesterday perfect."
    },
    {
      "id": "3285",
      "title": "Lessons Learned",
      "body": "Create a library or catalog for lessons learned. Model validation after army's center for army lessons learned, send someone on product meetings or client meetings to witness the good and the bad."
    },
    {
      "id": "3286",
      "title": "Change as a process",
      "body": "Changing on a consistent basis to make sure you stay ahead of outside events."
    },
    {
      "id": "3287",
      "title": "Humility",
      "body": "Be humble and people will exhalt you. Be braggadocios and people will try to squash you. Brag with energy and excitement for what you are doing, not with your accomplishments."
    },
    {
      "id": "3288",
      "title": "Values & Goals in Your Pocket",
      "body": "Traction chart printed on business card and given to employees."
    },
    {
      "id": "3289",
      "title": "Grit",
      "body": "Success is good for the body. Failure is good for the mind."
    },
    {
      "id": "3290",
      "title": "Reflection",
      "body": "Step back and reflect, What is happening, what is not happening, and how can I influence out coming actions"
    },
    {
      "id": "3291",
      "title": "Being in the Wrong Business",
      "body": "Set high visions, always step back and make sure you are in the right business, that you understand underlying causes and aren't stepping over the quarter to pickup the penny."
    },
    {
      "id": "3292",
      "title": "Handbooks",
      "body": "Handbook for every department, programming, financial, sales, marketing, branding, user experience, etc."
    },
    {
      "id": "3293",
      "title": "Making Yesterdays Perfect",
      "body": "Don't overweigh or spend too much time fixing past mistakes when the world is constantly changing and those corrections may not protect you in the future.  Always be looking forward.  "
    },
    {
      "id": "3294",
      "title": "Change as a condition",
      "body": "Changing due to outside events."
    },
    {
      "id": "3295",
      "title": "Positive aggressive action",
      "body": "-"
    }
  ]
}

