{
  "subject": "Issue IDS Checklist",
  "credit": "Issue IDS Checklist",
  "todos": [
    {
      "id": "3509",
      "title": "Discuss",
      "body": "Say what you believe but only say it once, more than once is politicking.  When the discussion, becomes redundant, move on."
    },
    {
      "id": "3510",
      "title": "Question the Issue",
      "body": "Is it the right issue, meaningful, specific?  "
    },
    {
      "id": "3511",
      "title": "IDS",
      "body": "Identify, Discuss, Solve."
    },
    {
      "id": "3512",
      "title": "Tangent Alert",
      "body": "When someone goes on a tangent, notify everyone."
    },
    {
      "id": "3513",
      "title": "Solution Statement",
      "body": "What is going to happen when the issue is solved (Barbara is going to do this…).  There needs to be accountability, concise action, and a measurable outcome.   "
    },
    {
      "id": "3514",
      "title": "Definition of Solved",
      "body": "What does solved look like."
    },
    {
      "id": "3515",
      "title": "Three Types Issues",
      "body": "Problem has to be solved, information that needs to be agreed upon and communicated to entire team, idea or opportunity that needs feedback, brainstorming, insight, green light.  Say things like  “I just want to make sure that everyone is clear and agrees on…”"
    },
    {
      "id": "3516",
      "title": "Prioritize Issues",
      "body": "Most important issues aren’t always mentioned first or in the proper order.  After brainstorming all issues, rank the top three.  They should fall in the important and proactive quadrant."
    },
    {
      "id": "3517",
      "title": "Solve",
      "body": "Make every decision as if you are going to the Super Bowl (in other words going to be the best at what you do in the whole world)."
    },
    {
      "id": "3518",
      "title": "Pros and cons",
      "body": "List out the pros and cons of each issue with the group (if they are cordial) or with just the decision maker if it is a heated discussion.    "
    },
    {
      "id": "3519",
      "title": "Three Resolutions",
      "body": "Issue solved, here’s the action to take, issue is awareness (ex  we all agree the meeting should start on time), issue needs more research or facts (we will gather this and decide next week).  "
    },
    {
      "id": "3520",
      "title": "Ten Commantments of Solving Issues",
      "body": "Don’t rule by consensus, most issues come from a lack of courage by someone that needs to not be a weenie, make decisions quickly and implement them slowly, don’t rely on secondhand information, egos aside and focus on greater good, don’t try to solve them all, live with it end it or change it, discuss and solve the issues you fear the most, take a shot and propose a solution.  "
    },
    {
      "id": "3521",
      "title": "Person Issues",
      "body": "Don’t forget to identify, discuss, and solve people’s personal issues so that they can focus on the business issues.  "
    },
    {
      "id": "3522",
      "title": "Break it down",
      "body": "Ask them to break down the issue into smaller issue and identify what part is the biggest."
    },
    {
      "id": "3523",
      "title": "Identify - What is really the issue we are trying to solve.  Most of the time the stated problem is a symptom caused by the real issue.  Don’t rush identifying this issue.  There has to be trust to identify the elephant in the room.  ",
      "body": ""
    },
    {
      "id": "3524",
      "title": "Open & Honest – Identify and solving issues cannot occur if there is not trust between everyone involved.  ",
      "body": ""
    }
  ]
}

