{
  "subject": "INNOVATOR'S CHECKLIST",
  "credit": "INNOVATOR'S CHECKLIST",
  "topic": "Innovators",
  "todos": [
    {
      "id": "3408",
      "title": "Visit New Places",
      "body": "Visit places and snatch up ideas."
    },
    {
      "id": "3409",
      "title": "Strength of Weak Ties",
      "body": "Use unknown people as sounding boards.  "
    },
    {
      "id": "3410",
      "title": "Run-Exercise-Meditate",
      "body": "Use exercise, running, meditation, and monotonous activities to help your brain clear itself.  Only when your brain is clear can it be filled with new ideas or processes."
    },
    {
      "id": "3411",
      "title": "Understand Synergies",
      "body": "Understand which industries are symbiotic so that you can capitalize on how they will spur each other.  "
    },
    {
      "id": "3412",
      "title": "Encourage Creativity",
      "body": "The more open and unstructured a workplace, the faster new ideas will be sparked."
    },
    {
      "id": "3413",
      "title": "Peace by Information",
      "body": "The greatest non-violent weapon of all is information flow.  "
    },
    {
      "id": "3414",
      "title": "Commercialize Like Edison, Not Tesla",
      "body": "Tesla could never commercialize his products.  Be like Edison.  If you invent something, you've got to actually get it into the world, produce it, or else it doesn't help anybody.  "
    },
    {
      "id": "3415",
      "title": "Learn Something New",
      "body": "Take night classes to learn how to do something new."
    },
    {
      "id": "3416",
      "title": "Only the Paranoid Will Survive, High Output Management ' Grove",
      "body": "Success breeds complacency.  Complacency breeds failure."
    },
    {
      "id": "3417",
      "title": "Study User Behavior",
      "body": "Study user behavior and the time it takes for users to use your features and then re-design to reduce that time.  Each brings its own superior skills to the partnership.  Human's plus computers will outperform anything.  Engineering and design must come hand in hand."
    },
    {
      "id": "3418",
      "title": "Study History",
      "body": "Read books, interview people, know the past.  "
    },
    {
      "id": "3419",
      "title": "Encourage Creative Abrasion",
      "body": "Question each other. Play devil's advocate. Eviscerate ideas.  Constructive criticism."
    },
    {
      "id": "3420",
      "title": "Be Recursive",
      "body": "Programs should loop and involve circles that grow their strength and power.  PageRank was established by ranking each page by the number and quality of links coming into it, and the quality of these links was determined by the number and quality of links to the pages that originated them, and so on.  "
    },
    {
      "id": "3421",
      "title": "Join Art & Science ",
      "body": "Power comes from joining art to science the way that Leonardi da Vinci did.  "
    },
    {
      "id": "3422",
      "title": "Be Disruptive | ",
      "body": "Pong disrupted Space Wars."
    },
    {
      "id": "3423",
      "title": "Have The Most Influence On Course Of Subsequent Developments | |",
      "body": "Opposite of Apple, Microsoft's success was not its superior or fully integrated product, it was that they were eager to license their operating system to any hardware makers thus gaining a larger market share.  Give away your product for free to encourage others to adopt your technology as the standard.  Best product does not beat the most widely used product.   * Here we start to see the importance of choosing whether your product will be the cheapest and most widely used, most superior product, or first to meet a new market (Time-Value-Money).  Can't get stuck in the middle.  "
    },
    {
      "id": "3424",
      "title": "Be Simple | |",
      "body": "It is important to be simple, unintimidating, and even a bit sappy.  "
    },
    {
      "id": "3425",
      "title": "Study How it Applies to Kids ",
      "body": "Is there a children's application."
    },
    {
      "id": "3426",
      "title": "Get Publicity",
      "body": "Innovations need publicity to be accepted.  "
    },
    {
      "id": "3427",
      "title": "Collaborate With People That Have a Wide Array of Specialties | | | | | | | |",
      "body": "Innovations come from the collaboration between skilled entrepreneurs (visionaries), engineers (executors).  Skills may include  theoretical physicisists, experimentalists, material scientists, mathematicians, engineers, businessmen, and builders.  People are more collaborative when they are together.  "
    },
    {
      "id": "3428",
      "title": "Pitch Clearly",
      "body": "Innovation requires clear articulation.  If you stumble on a sentence when you try to read it outloud, you better fix that sentence.  "
    },
    {
      "id": "3429",
      "title": "Replicative Validation",
      "body": "If you hire someone to do something.  Replicate exactly what they gave you so that you have your own identical set of the code.  This will help you to understand the product in detail and also help to make sure they have no errors.  "
    },
    {
      "id": "3430",
      "title": "Disregard Limitations",
      "body": "Have a healthy disregard for the impossible.  "
    },
    {
      "id": "3431",
      "title": "Execution",
      "body": "Great conceptions are worth little without precision execution.  "
    },
    {
      "id": "3432",
      "title": "Three Drivers of Technology",
      "body": "Government funded.  Private enterprise.  Voluntary peer sharing.  "
    },
    {
      "id": "3433",
      "title": "Build Followers",
      "body": "Get people to follow you by selling them your mission."
    },
    {
      "id": "3434",
      "title": "Be Gates Intensive",
      "body": "Gates intensity and all-night programming allowed Microsoft to meet insane software deadlines and beat other competitors to the market.  It also allowed him to sell for cheaper since he had little overhead.  "
    },
    {
      "id": "3435",
      "title": "Design for Markets",
      "body": "Figure out how to conjure up new markets.  Create products that consumers do not yet know that they need."
    },
    {
      "id": "3436",
      "title": "Exercise Your Brain",
      "body": "Exercise your brain and be able to do complex calculations in your head.  Study and practice on logic games."
    },
    {
      "id": "3437",
      "title": "Be Ev Williams Focused | | | ",
      "body": "Don't try to do thirty things at once.  Don't try to do just one thing.  "
    },
    {
      "id": "3438",
      "title": "Defend Against Spam |",
      "body": "Design a system that cannot be damaged by spam, click fraud, negative trolling, etc."
    },
    {
      "id": "3439",
      "title": "Integrate Like Apple",
      "body": "Customers want technology to be simple and fully integrated so that their job is effortless.  "
    },
    {
      "id": "3440",
      "title": "Encourage Office Intersections",
      "body": "Creative offices should be designed so that people who would not normally interact are forced into contact with each other.  Share information, be transparent.  "
    },
    {
      "id": "3441",
      "title": "Separate Services",
      "body": "Considering separating the business side from the research and development side.  "
    },
    {
      "id": "3442",
      "title": "Design Mechanical Process",
      "body": "Conjuring up a mechanical process ' an imaginary machine ' and applying it to the problem.  "
    },
    {
      "id": "3443",
      "title": "Join Man and Computer (Man-Computer Symbiosis) - J.C.R. Licklider | | |  | | | | ",
      "body": "Computers should interact with people in real time, have intuitive interfaces, and feature delightful graphic displays.  Machines should work well with the human mind, not replace it.  Innovations should inspire and awe people when they see them run.  Even if you have to add unnecessary features just to put on a show.  "
    },
    {
      "id": "3444",
      "title": "Connect Communities | | | |",
      "body": "Computers should be used to help people take control of their lives and build better communities.  Finding unknown people with shared interests.  Facilitate communication."
    },
    {
      "id": "3445",
      "title": "Combining Faculty",
      "body": "Combining innovations that had cropped up due to experience in other fields.  "
    },
    {
      "id": "3446",
      "title": "Breakdown Everything | ",
      "body": "Breakdown every complex problem into simpler steps that can be repeated if necessary (subroutines)."
    },
    {
      "id": "3447",
      "title": "Lead the Way Firmly | | ",
      "body": "Be incredibly stubborn yet incredibly open minded and willing to change your ways.  Brutal honesty.  Demanding drive for excellence."
    },
    {
      "id": "3448",
      "title": "Back From Dead",
      "body": "Apple came back from the dead because of financial restructuring and a bold new product (Steve Jobs movie)."
    },
    {
      "id": "3449",
      "title": "Don't forget to have a warm tolerance for human frailty.  Sometime the difference between a genius and jerk hinges on whether their ideas turn out to be right.  ",
      "body": "-"
    }
  ]
}

