{
  "subject": "Jesus CEO",
  "credit": "Jesus CEO",
  "topic": "Innovators",
  "todos": [
    {
      "id": "3543",
      "title": "Feedback",
      "body": "Praise in public, criticize in private."
    },
    {
      "id": "3544",
      "title": "WOWSE",
      "body": "Be confident that you can carry out your plan with or without someone else.  Don't be afraid of rejection."
    },
    {
      "id": "3545",
      "title": "Branch Out",
      "body": "You will learn more from outside your own circles.  "
    },
    {
      "id": "3546",
      "title": "Winners",
      "body": "Whoever forms the best team to carry out the best ideas wins."
    },
    {
      "id": "3547",
      "title": "Let It Go",
      "body": "When you have done everything humanly possible then let it go."
    },
    {
      "id": "3548",
      "title": "Call the Question",
      "body": "We love to discuss more than to decide.  Sometimes you have to call the question.  "
    },
    {
      "id": "3549",
      "title": "Judgment",
      "body": "We cannot judge things as good or bad because we do not have all the information.  All things work together for the good of those who are called according to God's purpose.  "
    },
    {
      "id": "3550",
      "title": "Equality",
      "body": "Treat everyone as the child of God."
    },
    {
      "id": "3551",
      "title": "Fragile",
      "body": "Touch the fragile things.  Look out for little guy."
    },
    {
      "id": "3552",
      "title": "Purpose",
      "body": "The world is yours to do good in."
    },
    {
      "id": "3553",
      "title": "Never Fail",
      "body": "Take your hits and keep going."
    },
    {
      "id": "3554",
      "title": "Empower Women",
      "body": "Surround yourself with women."
    },
    {
      "id": "3555",
      "title": "People",
      "body": "Remember your end product is the people you create to carry on your mission.  "
    },
    {
      "id": "3556",
      "title": "Pray for Others",
      "body": "Pray for your team, clients, competition, and self."
    },
    {
      "id": "3557",
      "title": "Bigger than Yourself",
      "body": "People will follow things that are bigger than themselves when they understand the importance of their individual contribution.  "
    },
    {
      "id": "3558",
      "title": "Set Example",
      "body": "People learn from what they see, not what they hear."
    },
    {
      "id": "3559",
      "title": "Benefits",
      "body": "People are willing to give up something if they can attain something else of greater perceived value."
    },
    {
      "id": "3560",
      "title": "To the End",
      "body": "Never slam a door or burn a bridge."
    },
    {
      "id": "3561",
      "title": "Resources",
      "body": "Money is the least important.  Remember that every person you meet could introduce you to 250 more people.  "
    },
    {
      "id": "3562",
      "title": "Message",
      "body": "Many times unfortunate events are a message to us.  "
    },
    {
      "id": "3563",
      "title": "Healthy Ways to Express Oneself",
      "body": "Make sure to invest in healthy ways for people to express themselves in life or they will stray towards false idols and addictions.  "
    },
    {
      "id": "3564",
      "title": "Bold",
      "body": "Make statements."
    },
    {
      "id": "3565",
      "title": "Love",
      "body": "Love all.  Nobody wins until we all do."
    },
    {
      "id": "3566",
      "title": "Blocks",
      "body": "Life gives us everything we need.  We just need to take the blocks and re-arrange them.  "
    },
    {
      "id": "3567",
      "title": "Rise Above",
      "body": "Leaders must be able to rise above controversies, jealousies, personal attacks, and ego slights."
    },
    {
      "id": "3568",
      "title": "Feeling Chart",
      "body": "Know your emotions.  "
    },
    {
      "id": "3569",
      "title": "Boss",
      "body": "Know who your boss is and keep in contact with them daily.  Stay in touch with people you serve.  Draw a picture of your food chain."
    },
    {
      "id": "3570",
      "title": "Be Visible",
      "body": "Jesus was not a low-profile person."
    },
    {
      "id": "3571",
      "title": "Train Replacements",
      "body": "Jesus spent two thirds of his time teaching and educating his disciples."
    },
    {
      "id": "3572",
      "title": "Mission",
      "body": "Jesus knew that his mission was to teach people the love of God.  He did not heal everyone or raise everyone from the dead.  He stuck to his mission.  "
    },
    {
      "id": "3573",
      "title": "Transparency",
      "body": "Jesus had no hidden agenda."
    },
    {
      "id": "3574",
      "title": "Fear",
      "body": "Jesus faced his fears.  "
    },
    {
      "id": "3575",
      "title": "Enroll",
      "body": "Its easy to make the sales presentation, its tough to ask for the order.  Make sure to sign people up.  Be silent after you ask question."
    },
    {
      "id": "3576",
      "title": "Commitment",
      "body": "It is better to be hot as fire or cold as ice, because if you are lukewarm I will spit you out."
    },
    {
      "id": "3577",
      "title": "Seeds v. Bouquet",
      "body": "Invest in the seeds, for they will create a better future for you and your children.  "
    },
    {
      "id": "3578",
      "title": "Fire",
      "body": "If you have not been tested by fire you do not know who you are."
    },
    {
      "id": "3579",
      "title": "Go Big",
      "body": "I bargained with life for a penny, only to learn, dismayed, that any wage I would have asked of life, life would have paid."
    },
    {
      "id": "3580",
      "title": "Expect More",
      "body": "Hold people to higher standards.  "
    },
    {
      "id": "3581",
      "title": "Sprinkler Phenomenon of Management",
      "body": "Grass is brown closest to sprinkler head.  Avoid this by managing from the inside out.  "
    },
    {
      "id": "3582",
      "title": "Dance",
      "body": "God loves to dance."
    },
    {
      "id": "3583",
      "title": "Believe in Staff",
      "body": "Give them your faith but always verify.  Spend time with them.  "
    },
    {
      "id": "3584",
      "title": "Celebrate",
      "body": "Find reasons and be always be prepared with ways to celebrate.  "
    },
    {
      "id": "3585",
      "title": "Focus",
      "body": "Don't get distracted."
    },
    {
      "id": "3586",
      "title": "Difficult Things",
      "body": "Do what is necessary, not what is safe and easy.  The tendency of the masses is towards mediocrity (Huxley)."
    },
    {
      "id": "3587",
      "title": "Anchors",
      "body": "Do not seek approval of others but seek approval from God.  "
    },
    {
      "id": "3588",
      "title": "Energy Leaks",
      "body": "Distractions.  Do not waste time or energy on meaningless battles.  "
    },
    {
      "id": "3589",
      "title": "Defend",
      "body": "Customers and staff are always right, leadership should take responsibility for errors."
    },
    {
      "id": "3590",
      "title": "Foolish",
      "body": "Be willing to look foolish.  "
    },
    {
      "id": "3591",
      "title": "Simplicity",
      "body": "Be bright, be brief ant be gone."
    },
    {
      "id": "3592",
      "title": "Confidence",
      "body": "Always think and speak positively about yourself.   Never arrogant or cocky.  "
    },
    {
      "id": "3593",
      "title": "Forgiveness",
      "body": "Allowing others to make mistakes while you and they keep moving forward.  Does not mean being a doormat.  "
    },
    {
      "id": "3594",
      "title": "Plan",
      "body": "A good idea is worth one dollar, the plan to implement the idea is worth a million dollars.  Plan your work and work your plan.  Most of the time the plan just involves showing up."
    }
  ]
}

