{
  "subject": "Jay Wilkonson Leadership Checklist",
  "credit": "Jay Wilkonson Leadership Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "3525",
      "title": "Values Test",
      "body": "Your core values should pass the following five part test, 1. Is the value unique to your organization and distinguished (striving for 'integrity' is not unique), 2. Are you obsessed with the value, 3. Will the value outlive us, 4. Would we sacrifice money to protect it, 5. Can we actually 'live' it every day."
    },
    {
      "id": "3526",
      "title": "Don't Go Chasing Waterfalls",
      "body": "Stick to what you are good at."
    },
    {
      "id": "3527",
      "title": "Trust",
      "body": "Managers should trust their team and not micromanage."
    },
    {
      "id": "3528",
      "title": "Simplify",
      "body": "Managers should strive to simplify everything."
    },
    {
      "id": "3529",
      "title": "Live Values",
      "body": "Managers should live and reinforce your values."
    },
    {
      "id": "3530",
      "title": "Give Opportunity to Leave",
      "body": "Managers should let employees know that if they don't want to be here, they have their back and will help them exit successfully.  "
    },
    {
      "id": "3531",
      "title": "Balance",
      "body": "Managers should help team find balance and not glorify overtime."
    },
    {
      "id": "3532",
      "title": "Better Way",
      "body": "Managers should encourage everyone to find a better way, not their way."
    },
    {
      "id": "3533",
      "title": "Make Decisions",
      "body": "Managers should be the ones not afraid to step in and make the decisions."
    },
    {
      "id": "3534",
      "title": "Vulnerability",
      "body": "Managers should be the first to become vulnerable."
    },
    {
      "id": "3535",
      "title": "LMA",
      "body": "Managers should be able to lead, manage, and hold accountable."
    },
    {
      "id": "3536",
      "title": "Servant Leaders",
      "body": "Managers serve the team, the team doesn't serve them. Flip the accountability chart."
    },
    {
      "id": "3537",
      "title": "Be Heard",
      "body": "Manager should encourage everyone to be heard and to add issues and opportunities to team meetings."
    },
    {
      "id": "3538",
      "title": "Fewer is better",
      "body": "Fewer core values and goals is better."
    },
    {
      "id": "3539",
      "title": "No assholes allowed rule",
      "body": "Don't allow someone that is toxic too be a part of your environment.  It doesn't matter how skilled they are."
    },
    {
      "id": "3540",
      "title": "Breakdown Goals",
      "body": "Big hairy audacious goals are achieved by breaking them down into smaller easily accomplished goals."
    },
    {
      "id": "3541",
      "title": "Know Your Big Hairy Goals",
      "body": "Be able to defend your big goals by showing a plan on how you will achieve those goals."
    }
  ]
}

