{
  "subject": "Less Dumb Checklist",
  "credit": "Less Dumb Checklist",
  "todos": [
    {
      "id": "3855",
      "title": "Cognitive Dissonance",
      "body": "Your view of the world fits with how you feel or what you’ve done."
    },
    {
      "id": "3856",
      "title": "Embodied Cognition",
      "body": "Your physical state is translated into words and those words form a ton of associations.  Meeting someone with a warm cup of coffee will make you feel warm to them."
    },
    {
      "id": "3857",
      "title": "Benjamin Franklin Effect",
      "body": "You grow to like people for whom you do nice things and hate people you harm.  Ask people to do you a favor in order to gain their liking.  The more harm you cause someone the more hate you will feel.  "
    },
    {
      "id": "3858",
      "title": "Confabulations",
      "body": "Unintentional lies.  Perceived truths.  "
    },
    {
      "id": "3859",
      "title": "Agency",
      "body": "Thinking behind and event.  Concept that other people and non-human objects have their own minds and thoughts."
    },
    {
      "id": "3860",
      "title": "Ego Depletion",
      "body": "The more you have to restrain your pleasure side (Id), the more difficult it is to restrain it.  Not only do making choices that refrain from pleasure deplete your ego but anytime you take the helm of your mind to make a choice you deplete the ego.  To avoid ego depletion try to stay away from situation which require the most volition."
    },
    {
      "id": "3861",
      "title": "Illusion of Asymmetrical Insight",
      "body": "The idea that you know others better than they know you and you know them better than they know themselves.  Our minds tend to divide us into groups and divide us against other groups.  Peace is possible by breaking down the definitions and uniting people towards commonly shared problems.  We usually just have a basic and inaccurate view of the other side."
    },
    {
      "id": "3862",
      "title": "Ego",
      "body": "Realistic part of the mind that considers the consequences of actions.  "
    },
    {
      "id": "3863",
      "title": "Id",
      "body": "Primal part of the mind residing in the unconscious and always seeking pleasure.  "
    },
    {
      "id": "3864",
      "title": "Global Evaluation",
      "body": "People that have an appreciation for one trait in a person or thing are more likely to defend the other traits of that person or thing when under criticism.  Be careful of labels such as genius or beautiful.  Keep attributes separate.  This is why reputation is so important for businesses."
    },
    {
      "id": "3865",
      "title": "Heuristics",
      "body": "Objects or actions that make big, complex, daunting ideas tiny and easy to manage."
    },
    {
      "id": "3866",
      "title": "Super-Ego",
      "body": "Moralistic part of the mind that criticizes actions as good or bad."
    },
    {
      "id": "3867",
      "title": "Common Belief Fallacy",
      "body": "If most people believe something is true you are likely to think the same.  The truth is a belief is not more likely to be accurate just because a lot of people believe it.  Look into the part and think of all the silly things people have believed in.  This comes from people being unable to explain certain things and making up ludicrous explanations."
    },
    {
      "id": "3868",
      "title": "Predictive Truth",
      "body": "Humans are terrible at making predictions but great at re-writing our memories to make it seem as if they were right all along."
    },
    {
      "id": "3869",
      "title": "Self Delusion",
      "body": "Each creature’s version of reality is unique to its own nervous system."
    },
    {
      "id": "3870",
      "title": "Enclothed Cognition",
      "body": "Clothing communicates to the outside world who you are.  Clothing also effects how we think about ourselves.  People wearing glasses and a lab coat will perform better on test because they associate the two things with intelligence.  Sports teams wearing black will be more aggressive.  "
    },
    {
      "id": "3871",
      "title": "Port Hoc Fallacy",
      "body": "“After this therefore because of this.”  The irrational belief that one event causes another event just because it comes before.  Does not take into consideration hidden or intermediary causes.  Leads to superstition and quantified lifestyles.  If you push a button and get a soda, it doesn’t mean the button made the soda.  "
    },
    {
      "id": "3872",
      "title": "Impression Management Theory",
      "body": "You present to your peers not the person you are but the person you want to be.  Our labels and possessions define our actions.  We are professional because we wear suits, we don’t buy sits because we are professional, we champion social actions because we label ourselves as Democrats.  We must be very careful what we pretend to be."
    },
    {
      "id": "3873",
      "title": "Self-Confidence Bias",
      "body": "You are attracted to situations where you are certain that you will receive a confidence boost or compliment.  Learn about others and find ways to give them honest compliments.  "
    },
    {
      "id": "3874",
      "title": "Placebo Effect",
      "body": "Whenever you want something to work sometimes your faith alone can alter your perception.  Most traffic buttons and some office thermostats are placebos and don’t work anymore."
    },
    {
      "id": "3875",
      "title": "Backfire Effect",
      "body": "When someone has a string belief contradictory evidence to their belief only strengthens their position.  A simple myth is more attractive than an over-complicated truth.  "
    },
    {
      "id": "3876",
      "title": "Illusion of External Agency",
      "body": "We are biased to overestimate emotional impact of future events.  People usually point the happiness caused by this towards outside causes instead of crediting themselves.  "
    },
    {
      "id": "3877",
      "title": "Incongruence",
      "body": "The gap between how you see yourself and reality.  Well-being actually comes from an unrealistic view of reality or resorting to optimism and delusion.  People who are brutally honest with themselves are not as happy as people with unrealistic assumptions.  People who take credit for when things go their way and blame others when things go wrong are happier."
    },
    {
      "id": "3878",
      "title": "Self-Enhancement Bias",
      "body": "The body is made to resist excessive self-doubt.  "
    },
    {
      "id": "3879",
      "title": "Ostracism",
      "body": "Studies have shown that when people feel ostracized and unwander, the can’t solve problems as well, are less likely to cooperate, less motivated, more likely to be addicts and also suffer from worse ego depletion.  Build a strong network of supporters.  "
    },
    {
      "id": "3880",
      "title": "Narrative Scripts",
      "body": "Statements that may or may not be true but confirm your beliefs.  Facebook edits your posts so that you only see narrative scripts."
    },
    {
      "id": "3881",
      "title": "No True Scotsman",
      "body": "Shifting your definitions to protect your ideologies.  People who define themselves as part of a class and then someone in that class acts inappropriately will tend to redefine the class to exclude that person and their actions.  People should just admit their mistakes and not be so attached to their labels."
    },
    {
      "id": "3882",
      "title": "Depressive Realism",
      "body": "People who see the world not as great dread or bounding delight but just see the world.  Occurs in about 20 percent of people.  They have a strange superpower of being able to see the world closer to what it really is.  They get depression more often than not."
    },
    {
      "id": "3883",
      "title": "Over-Justificiation Effect",
      "body": "People who get paid doing what they love to do may lose passion for it because they attribute their motivation to external rewards (extrinsic) and not internal feelings (intrinsic).  Base your pay not off quotas calculated by machines but based instead by competence."
    },
    {
      "id": "3884",
      "title": "Sunk Cost Fallacy",
      "body": "People place more emphasis on avoiding threats and what they may lose than on what they may stand to gain.  People make bad decisions because they are more worried about protecting what they have already invested into something rather than getting ahead."
    },
    {
      "id": "3885",
      "title": "Post Hoc Rationalization",
      "body": "People must create stories and reasoning behind events in order to stay sane.  These stories do not necessarily reflect the Truth but reflect our best account of the truth.  We do this so that we can move on and don’t continually second guess life’s motivation.  The truth is that in fact that true cause and effect is beyond our comprehension."
    },
    {
      "id": "3886",
      "title": "Deindividuation",
      "body": "People are more likely to misbehave when they can act anonymously. People are more likely to be anonymous when they are in a large group of people.  “Doing together what you would not do alone.”  People feel a sense of arousal when they can influence others to do good or bad.  Events occurring by groups are more likely to get out of hand because there is no individual responsibility."
    },
    {
      "id": "3887",
      "title": "Double Blind Study",
      "body": "Neither researcher or subject know which test is the placebo."
    },
    {
      "id": "3888",
      "title": "Money",
      "body": "Money is a moving target.  In modern America most people need to make about $75,000 to be happy.  On average a person who makes $250,000 has no greater emotional well-being (varies base on cost of living).  "
    },
    {
      "id": "3889",
      "title": "Subjective Optimization",
      "body": "Mind rationalizing bad events and turning lemons into lemonade.  "
    },
    {
      "id": "3890",
      "title": "Narrative Bias",
      "body": "Humans prefer information in narrative format in storytelling format.  Narration is why we dream in stories and is the last thing we dive up before we die."
    },
    {
      "id": "3891",
      "title": "Pluralistic Ignorance",
      "body": "Fear that your thought is in the minority when actually it is the majority of thoughts but everyone is too afraid to admit there true beliefs because of fear of embarrassment or ostracism.  Occurs more in people who are constantly around other people.  Don’t be afraid to speak up or ask around."
    },
    {
      "id": "3892",
      "title": "Scientific Method",
      "body": "Disproving that a cause leads to an effect.  Tearing apart models looking for weakness.  Every human effort should systematically pause and ask if it is currently mistaken."
    },
    {
      "id": "3893",
      "title": "Misattribution of Arousal",
      "body": "Arousal is the heightened sense of being usually onset by intense or stressful situations.  People who experience situations of arousal are more likely to incorrectly associate the feeling with the other person and not the situation or experience.  Couples that perform and succeed at difficult tasks together are more likely to stay together.  Many successful dates occur on rollercoasters and horror films."
    },
    {
      "id": "3894",
      "title": "Halo Effect",
      "body": "A person considered great in one area will more likely be considered great in all areas (often applies to beauty)."
    }
  ]
}

