{
  "subject": "Magnitude Leadership Checklist",
  "credit": "Magnitude Leadership Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "3956",
      "title": "Etiquette",
      "body": "Smile, appreciation, call people by name, handshake, courteous of time, connected, vulnerable, think before you hit send."
    },
    {
      "id": "3957",
      "title": "Entrance",
      "body": "Your entrance and first impression are the most important part of your company.  It may be your landing web page, door, reception, physical appearance, phone call, etc.  "
    },
    {
      "id": "3958",
      "title": "Gravity",
      "body": "The heaviness you can put on situations. Your ability to be both confidently assertive and supportively collaborative.  Your composure or how calm you can be in the midst of stress or conflict.  "
    },
    {
      "id": "3959",
      "title": "Gravitas",
      "body": "Remember others are watching, manage your personal brand, set goals, assess results."
    },
    {
      "id": "3960",
      "title": "Profanity",
      "body": "Never use profanity.  "
    },
    {
      "id": "3961",
      "title": "Attention",
      "body": "Leaders don't seek attention, they give it.  As a leader you must simply attend to others in the moment in a way that demands putting everything else on hold.  "
    },
    {
      "id": "3962",
      "title": "Style",
      "body": "Hygiene, appearance, culture, dress."
    },
    {
      "id": "3963",
      "title": "Presence",
      "body": "How you and your company present itself.  In all encompassing ways.  Presence gains trust.  No two leaders or company will manifest the same presence.  Having presence is what makes people want to pay $200/hour or follow you.  "
    },
    {
      "id": "3964",
      "title": "One Habit",
      "body": "Focus on one habit and it will change everything."
    },
    {
      "id": "3965",
      "title": "Communication",
      "body": "Consider expectations, ask clarifying questions, be clear about purpose, read to improve vocab, ask others to evaluate your facial expressions, look people in the eye.  "
    },
    {
      "id": "3966",
      "title": "Relational Transparency",
      "body": "Authentic honesty in your relationships."
    },
    {
      "id": "3967",
      "title": "Smile",
      "body": "Always be smiling and laughing, no matter what type of day you are having.  "
    }
  ]
}

