{
  "subject": "Making Good Decisions Checklist",
  "credit": "Making Good Decisions Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "3968",
      "title": "Emotion Free Zone",
      "body": "Wait until you aren't emotional.  To know if you are emotional pay attention to your monkey mind."
    },
    {
      "id": "3969",
      "title": "Data",
      "body": "Use numbers to analyze the decision."
    },
    {
      "id": "3970",
      "title": "Experience",
      "body": "Try to experience what it would be like if you made the decision or if you didn't make the decision (if buying a house, spend a full 24 hours in house).  "
    },
    {
      "id": "3971",
      "title": "Review Core Ideology",
      "body": "Strip everything down to the basic purpose."
    },
    {
      "id": "3972",
      "title": "Mentors/References",
      "body": "Send your decision, not options to group of trusted advisors to get their feedback.  Ask people you trust that don't have agendas and won't get offended if you don't take their advice."
    },
    {
      "id": "3973",
      "title": "Checklists",
      "body": "Review checklists centered around decision."
    },
    {
      "id": "3974",
      "title": "Read",
      "body": "Read a book that centers around the decision.  "
    },
    {
      "id": "3975",
      "title": "Dirt Dive",
      "body": "Meditate on it, win in your mind before you make decision."
    },
    {
      "id": "3976",
      "title": "Few",
      "body": "Make few decisions and stick with them.  Work smarter not harder."
    },
    {
      "id": "3977",
      "title": "Intuition",
      "body": "Listen to your brain, heart and gut.  "
    },
    {
      "id": "3978",
      "title": "Pros/Cons",
      "body": "List the pros and cons and see which are more valuable.  "
    },
    {
      "id": "3979",
      "title": "Sleep on it",
      "body": "Let the information consolidate.  Be a little patient."
    },
    {
      "id": "3980",
      "title": "Simplicity",
      "body": "Is the decision simple or does it promote simplicity."
    },
    {
      "id": "3981",
      "title": "Parallel Options",
      "body": "Have you formulated and compared your parallel options.  "
    },
    {
      "id": "3982",
      "title": "Fail Fast",
      "body": "Fail fast and fail forward.  If a decision was a mistake and the boat has more holes then can be repaired, it is best to find a new ship.  Make sure the boat truly has more holes that can fix and you are not sabotaging it in your mind.  To determine this, list out successes and failure and see how they weigh out."
    },
    {
      "id": "3983",
      "title": "Integrity",
      "body": "Always take the high road.  Be truthful, direct, respectful and remember that you can afford to lose time and money but not reputation.   "
    },
    {
      "id": "3984",
      "title": "Confirmation Bias",
      "body": "Have we preferentially been looking for evidence to support what we want to believe?  Do we ask leading questions or present our solution before asking heir problems?"
    },
    {
      "id": "3985",
      "title": "Over-Confidence",
      "body": "Don't make decision if you have been overly confident about your predictions and estimates.  "
    },
    {
      "id": "3986",
      "title": "Sunk Costs",
      "body": "Don't let sunk costs deter you from making right decision moving in a different direction."
    },
    {
      "id": "3987",
      "title": "Anchoring",
      "body": "Don't let irrelevant information or first impressions or words by a influential source lead to undue influence on decision.  Remember, any piece of advice is just one piece of data.  Even the most experienced people can be wrong in the situation."
    },
    {
      "id": "3988",
      "title": "Status Quo",
      "body": "Don't let doing nothing outweigh change or innovation."
    },
    {
      "id": "3989",
      "title": "Past Experiences",
      "body": "Do you have the past experiences that can help you make this decision."
    },
    {
      "id": "3990",
      "title": "Conservatism Trap",
      "body": "Do people's personal risk aversion get in the way for what is right for the company?  What is your personal risk aversion right now?"
    },
    {
      "id": "3991",
      "title": "Box Breathing",
      "body": "Breath, 2, 3, 4, Hold, 2, 3, 4, Exhale, 2, 3, 4, Breathe, 2, 3, 4."
    },
    {
      "id": "3992",
      "title": "Recency Bias",
      "body": "Are you overly influenced by dramatic, memorable, or recent events that blind you?  Are these events random or patterns?"
    }
  ]
}

