{
  "subject": "Josh Jones-Dilworth –Marketing Checklist",
  "credit": "Josh Jones-Dilworth –Marketing Checklist",
  "todos": [
    {
      "id": "3595",
      "title": "Internal University",
      "body": "You will never be engineer rich so you must limit your technology and maximize the number of users and profitability."
    },
    {
      "id": "3596",
      "title": "Giving Back",
      "body": "Sponsor open source projects, give code, process, hacks, and tools to the good guys.  Democratize art and science of data and give it to everybody.  Non-commercial program (for every $1 of $10 we use that to pay for a staff member to work for a non-profit)  .org program.  Donor call sheets.  Do good by doing well."
    },
    {
      "id": "3597",
      "title": "Show over tell",
      "body": "Case studies, case studies, case studies.  Blog postings.  Narrative storytelling.  Customer success.  Publish 2,000 word stories of success.    Over-do the case studies.  Hire an in-house writer/journalist to to in-depth research on your impact.  Blog about eating your own dog food.  Talk about web of people, places, and things, vs. a web of documents."
    },
    {
      "id": "3598",
      "title": "Have the courage to be incomplete",
      "body": "Be provocative so that you spur further inquiry and they will want to learn more, beg them for questions, talk less, pause, be confident in the mystery.  "
    },
    {
      "id": "3599",
      "title": "Data pitch",
      "body": "We have attracted lots of dogs.  Dogs eat food.  Can you buy me more food to give to the dogs.   Need to be in 5 cities."
    },
    {
      "id": "3600",
      "title": "Determining Target Market",
      "body": "Venn diagram balancing Demand, Money, Purpose.  "
    },
    {
      "id": "3601",
      "title": "Don’t force them to realize they are shit",
      "body": "Turn the frown upside down.  Message and brand to what’s going to be awesome, not what is shitty.  Paint the sunny days on a sandy beach scenario.  "
    },
    {
      "id": "3602",
      "title": "Fundraising",
      "body": "Need to have your end picture before you start raising money.  Raising money is an acceleration of growth and stress.  Once you take VC money you have to grow as fast as possible."
    },
    {
      "id": "3603",
      "title": "Naming",
      "body": "Name should be evocative or descriptive.  Not made up.  Read article about naming on Jones-Dilworth website.  "
    },
    {
      "id": "3604",
      "title": "Don’t tell me what you do, tell me what you do for me",
      "body": "Benefits should be the majority of your presentation.  No one gives a fuck what you do.  The just want to satisfy their own emotional drivers.  Find those drivers.  (Story, I will pay you $200K more for you to hire a guy that sits in our office and just emails me what to do)"
    }
  ]
}

