{
  "subject": "McDonald’s Checklist",
  "credit": "McDonald’s Checklist",
  "todos": [
    {
      "id": "4077",
      "title": "Ray Kroc",
      "body": "Went without payroll for over 5 years."
    },
    {
      "id": "4078",
      "title": "Borrowing",
      "body": "By borrowing, you lock in a rate and eventually pay off the loan.  But you are never through paying for an equity financing, because the dilution on the stock is permanent and you pay dividends forever.  "
    },
    {
      "id": "4079",
      "title": "Sonneborn Speech",
      "body": "We are not in the food business, we are in the real estate business.  The only reason we sell fifteen cent hamburgers is because they are the greatest producer of revenue from which our tenants (franchisees) can pay us our rent."
    },
    {
      "id": "4080",
      "title": "Advertising Coops",
      "body": "Used common good to help pay for advertising campaigns that benefitted all parties involved.  "
    },
    {
      "id": "4081",
      "title": "Kroc/Sonneborn",
      "body": "Successful because one cared about making money (revenue) and the other cared about non spending too much money (expenses).  Worked in separate parts of the country so that they gave each other autonomy in their areas."
    },
    {
      "id": "4082",
      "title": "Perfecting Product",
      "body": "Spent $3 million to perfect its leadings products like French fry.  Invested in their own machine to make the perfect fry."
    },
    {
      "id": "4083",
      "title": "Avoid Cash Buyouts",
      "body": "Sell stock or debentures to people.  When you demand cash, they enter hell."
    },
    {
      "id": "4084",
      "title": "Kroc",
      "body": "Salesman first.  Entrepreneur second.  Archetypical corporate founder who dominated his subordinates.  Able to put himself in the position of his customer’s self-interests, and not his own.  Challenged his customers to help them do their business better.  Didn’t start working on McDonald’s until the age of 37.  Incredible public speaker.  Could remember names and faces.  Intensely emotional with strong opinions.  Fired lots of people but never personally fired anyone."
    },
    {
      "id": "4085",
      "title": "Small Suppliers",
      "body": "Relied on small suppliers outside of the mainstream because they would work harder for less money and were willing to get creative.  McDonalds was very loyal to suppliers.  Leveraged suppliers to find new and efficient ways to do things better.   Developed a distribution center so that they could reduce number of weekly deliveries from 28 to 5."
    },
    {
      "id": "4086",
      "title": "Sonneborn",
      "body": "Real estate genius who developed profit model for McDonald’s.  Benhind the scenes operator only preoccupied with the financial side of the business.  Bought properties, fixed mortgage on property, leased to franchisee with escalators and % rent overages, required security deposit that they could float (use to make interest or supply cash reserves), and were able to use the leases to help reinforce franchise rights.  His job was to encourage franchisees to sign leases and banks to make mortgages.  Had no reservation challenging bank presidents head on."
    },
    {
      "id": "4087",
      "title": "Midblock",
      "body": "Preferred over corner because of reduced traffic congestion and they were cheaper.  "
    },
    {
      "id": "4088",
      "title": "Children",
      "body": "One of the first to discover the importance of children as a marketing target.  Mastered the experience of taking your kid to get a meal without pulling your hair out."
    },
    {
      "id": "4089",
      "title": "Playlands",
      "body": "Nothing to do with food but everything to do with bringing people in the door and the experience.  Similar to Walmart’s ice cream machines.  "
    },
    {
      "id": "4090",
      "title": "Common Good",
      "body": "Not set by chief executive by is the product of interaction amongst all the players."
    },
    {
      "id": "4091",
      "title": "Test at Scale",
      "body": "McDonald’s would draw their store plans out on a large tennis court and walk through the whole experience before they drew out plans.  "
    },
    {
      "id": "4092",
      "title": "Real Estate Game",
      "body": "McDonald’s started making money when it became a real estate company.  Buying property and leasing it back to franchisees. Kroc’s version of McDonald’s was financially bankrupt, Harry Sonneborn turned it into a profitable real estate venture."
    },
    {
      "id": "4093",
      "title": "Prediction",
      "body": "McDonald’s crew began cooking and packaging food products in anticipation of orders, rather than in response to them."
    },
    {
      "id": "4094",
      "title": "Quality Control",
      "body": "Major variable in McDonald’s success.  Employed hundreds of field agents, protocols, inspections, training, etc."
    },
    {
      "id": "4095",
      "title": "Efficiency",
      "body": "Invested in the equipment to get the job done in half time, like the clamshell cooker which cooked a burger on both sides at same time."
    },
    {
      "id": "4096",
      "title": "Hamburger University",
      "body": "Invested in a $40 million dollar training center."
    },
    {
      "id": "4097",
      "title": "Debriefing",
      "body": "Incredible at documenting discoveries and gave their franchises huge operating manuals to be successful.  "
    },
    {
      "id": "4098",
      "title": "Tenacity",
      "body": "In setting up its operating systems, McDonald’s had no particular genius, just tenacity."
    },
    {
      "id": "4099",
      "title": "Cleanliness",
      "body": "Important factor of McDonald’s success."
    },
    {
      "id": "4100",
      "title": "Yes Man",
      "body": "If a corporation has two executives that think alike, one of them is unnecessary."
    },
    {
      "id": "4101",
      "title": "Bid Research",
      "body": "Helping companies determine how they should price their products/services."
    },
    {
      "id": "4102",
      "title": "Communication",
      "body": "Gave franchisees effective communication channels to management through advisory boards."
    },
    {
      "id": "4103",
      "title": "Franchise System",
      "body": "Empowers thousands of mini-entrepreneurs.  When balanced correctly with common economic incentives, it can have incredible results.  Made it fair and balanced.  Designed to encourage the success of the franchise first."
    },
    {
      "id": "4104",
      "title": "Debt",
      "body": "Don’t be afraid to take out some debt. McDonald’s took on a huge amount of debt in the early hears, nearly twenty two times their equity in the company."
    },
    {
      "id": "4105",
      "title": "Pilot",
      "body": "Don Conley, McDonald’s first franchising president was a pilot and able to get to sites twice as efficiently."
    },
    {
      "id": "4106",
      "title": "Cash Flow Solutions",
      "body": "Changed payroll from weekly to bi-weekly, persuaded largest suppliers to buy debentures in company, found institutional money, found someone helpful in raising money."
    },
    {
      "id": "4107",
      "title": "Proven",
      "body": "Buy into existing concepts.  When something is proven, you have a big head start.  "
    },
    {
      "id": "4108",
      "title": "Absentee Owners",
      "body": "Avoid these people like the plague."
    },
    {
      "id": "4109",
      "title": "Trip Pattern Survey",
      "body": "Asked customers where they were before and after their visit to McDonald’s.  Helped them identify exactly where revenue came from and how to locate new stores."
    },
    {
      "id": "4110",
      "title": "Ombudsmen",
      "body": "All the people’s men."
    },
    {
      "id": "4111",
      "title": "PR",
      "body": "Aggressively used PR to promote the company.  Charity is one of the best forms of PR."
    },
    {
      "id": "4112",
      "title": "Buy Back",
      "body": "After time, McDonald’s started buying back some of their stores.  It worked well initially but then they realized they were destroying the entrepreneurial spirit of the franchisees and their competitive advantage.  "
    },
    {
      "id": "4113",
      "title": "Early Site Selection",
      "body": "Aerial photos spotting auto routs, schools, and church steeples."
    }
  ]
}

