{
  "subject": "Myths of Entrepreneurship",
  "credit": "Myths of Entrepreneurship",
  "todos": [
    {
      "id": "4179",
      "title": "8.      I SHOULDN’T TELL ANYONE ABOUT MY IDEA OR THEY WILL STEAL IT",
      "body": "Not always true.  You must tell the right people about your idea to execute it properly.  Most billion-dollar entrepreneurs have never signed a confidentiality agreement in their life.  Your idea should be evolving so if someone tries to steal it, you will already be working on a better version."
    },
    {
      "id": "4180",
      "title": "7.      IF YOUR IDEA IS GOOD, YOU’LL BE SUCCESSFUL",
      "body": "Not always true.  There are countless stories of people who invented Facebook before Mark Zuckerberg or Walmart before Sam Walton.  There is a famous phrase that a good idea is worth a dollar, but the execution of a good idea is worth a billion dollars.   "
    },
    {
      "id": "4181",
      "title": "11.  YOU MUST HAVE A LOT OF RELEVANT EXPERIENCE TO BE A SUCCESSFUL ENTREPRENEUR",
      "body": "Not always true.  Richard Branon, Thomas Edison, Arianna Huffington, Andrew Carnegie, Walt Disney, Ray Kroc, and Coco Chanel had no training or experience in their industry when they first started."
    },
    {
      "id": "4182",
      "title": "9.      ONLY ONE IN 12 ENTREPRENEURS ARE SUCCESSFUL",
      "body": "Not always true.  Only one in every few ideas may survive but an overwhelming majority of entrepreneurs who are persistent and learn from their mistakes will be part of a profitable and successful business.  "
    },
    {
      "id": "4183",
      "title": "1.      YOU HAVE TO BE A HIGH-TECH WIZARD TO BE SUCCESSFUL",
      "body": "Not always true.  Only a small percentage of new businesses are run by high-tech founders.  Even the most successful high-tech companies can be run by non-tech entrepreneurs.  Pandora’s CEO was a guitar player.  Airbnb’s CEO was a designer.  Other companies with non-tech founders  Pinterest, Snapchat, Groupon, Alibaba, Amazon, and Apple."
    },
    {
      "id": "4184",
      "title": "6.      YOUR FIRST IDEA BETTER BE GREAT",
      "body": "Not always true.  Most successful companies started with a different idea than what they are currently doing.  3M started as a mining company, Abercrombie & Fitch a sporting goods store, Avon a Bookseller, Microsoft a traffic data system software, Nokia a paper mill, Hasbro Toys a textile remnants company.  If you want to be successful, just start selling something you are passionate about.  Figure out what people are buying and pivot to their needs."
    },
    {
      "id": "4185",
      "title": "3.      IF YOU FAIL, YOUR COMMUNITY, FRIENDS, AND FAMILY WILL THINK LESS OF YOU",
      "body": "Not always true.  Most entrepreneurs fail two or three times and remain highly regarded members of their communities.  There are countless stories of entrepreneurs and athletes who will tell you that they actually felt more loved and accepted in times of failure and struggle."
    },
    {
      "id": "4186",
      "title": "5.      YOU NEED LOTS OF MONEY TO START A BUSINESS",
      "body": "Not always true.  Most businesses start out in a garage, dorm room, or living room.  Sometimes having to much money can kill a business.  Here’s a list of companies and how much they started with  Subway - $1,000, Hewlett Packard - $538, Apple - $1,500 (from selling a calculator and VW Van), Dell Computers - $1,000, Wrigley Chewing Gum - $32, Starbucks - $1,350."
    },
    {
      "id": "4187",
      "title": "2.      YOU MUST QUIT COLLEGE AND START EARLY TO BE SUCCESSFUL",
      "body": "Not always true.  Lots of entrepreneurs don’t even start their own business until after they are 30 years old, including  Jack Dorsey–Twitter, Tim Westergren–Pandora, Jan Koum–WhatsApp, Jack Ma–Alibaba, and Sam Walton–Walmart.  Lots of entrepreneurs have worked for other companies before starting their own business.  "
    },
    {
      "id": "4188",
      "title": "4.      YOU MUST HAVE A CO-FOUNDER",
      "body": "Not always true.  Based on a study by Crunchbase, the percentage of companies who had a solo founder, and successfully exited, is 52.3%.  The percentage of companies who had two co-founders and successfully exited is 30.1%.  Most solo founders eventually find their ideal partner, but bad partnerships can often ruin good ideas.  Examples of solo founders include Jeff Bezos – Amazon, Henry Ford – Ford, and Drew Houston – DropBox."
    },
    {
      "id": "4189",
      "title": "10.  YOU MUST HAVE REALLY FAST GROWTH TO BE SUCCESSFUL",
      "body": "Not always true.  \"A disruptive process can take longer to develop than by the conventional approach and the risk associated to it is higher than the other more incremental or evolutionary forms of innovations, but once it is deployed in the market, it achieves a much faster penetration and higher degree of impact on the established markets.[7]\" (Source  Assink, Marnix, Christenson, Clayton).\""
    }
  ]
}

