{
  "subject": "Net Promoter Score Checklist",
  "credit": "Net Promoter Score Checklist",
  "topic": "Service",
  "todos": [
    {
      "id": "4223",
      "title": "Software",
      "body": "Budget money to support IT that allows you to efficiently implement your NPS program.  "
    },
    {
      "id": "4224",
      "title": "Pay to Quit",
      "body": "appos CEO offers $2,000 to any employee that wants to quit.  It makes sure that people working there want to be there."
    },
    {
      "id": "4225",
      "title": "Web Resources",
      "body": "www.netpromotersystem.com"
    },
    {
      "id": "4226",
      "title": "Metrics to Record",
      "body": "What % of customers receive NPS, what % of detractors get a closed loop response in 48 hours, what % of employees know NPS score, what is difference in lifetime value between a promoter and detractor.  "
    },
    {
      "id": "4227",
      "title": "Promoter Sales Force",
      "body": "Using your customer to promote your company."
    },
    {
      "id": "4228",
      "title": "Feature/Product Development",
      "body": "Use NPS to drive feature and product development."
    },
    {
      "id": "4229",
      "title": "Emoticons",
      "body": "Use emoticons to match scale."
    },
    {
      "id": "4230",
      "title": "Fighting Bias",
      "body": "Use email if you can get high response rates, else use phone, make scores transparent to promote community policing, use a third party to collect feedback, educate importance of NPS.  "
    },
    {
      "id": "4231",
      "title": "Intuit's Mission",
      "body": "To make the customer feel so good about the product that they'll go tell five other people to buy it.  "
    },
    {
      "id": "4232",
      "title": "Good Profits",
      "body": "Things that bring the customer back for more.  The golden rule is the best way to create good profits."
    },
    {
      "id": "4233",
      "title": "Why People Give Referrals",
      "body": "They 1.) must believe the company offers superior vale in terms of price, features, quality, functionality, ease of use and 2.) must feel good about their relationship with the company."
    },
    {
      "id": "4234",
      "title": "Promoters",
      "body": "Respond with a 9 or 10, they take up the company to others."
    },
    {
      "id": "4235",
      "title": "Passive",
      "body": "Respond with a 7 or 8, satisfied customers, not necessarily loyal and they probably don't talk about you.  "
    },
    {
      "id": "4236",
      "title": "Detractors",
      "body": "Respond with a 0 to 6, their lives have been diminished by dealings with you, they probably don't say nice things about you.  "
    },
    {
      "id": "4237",
      "title": "Balance",
      "body": "Remember that the goal of creating promoters has to be balanced wit the need to ensure that your store is profitable.    Settle with creating passive customers until you can create promoters."
    },
    {
      "id": "4238",
      "title": "Cut It Out",
      "body": "Reduce all activities that don't create a passive or promoter score in NPS."
    },
    {
      "id": "4239",
      "title": "Quantifying NPS",
      "body": "Read The Loyalty Factor, go to www.netpromoterscore.com."
    },
    {
      "id": "4240",
      "title": "Customer Satisfaction",
      "body": "Putting kindness and intelligence into action."
    },
    {
      "id": "4241",
      "title": "Three Groups",
      "body": "Promoters, passives, detractors."
    },
    {
      "id": "4242",
      "title": "Bad Profits",
      "body": "Profits at the expense of the customer relationship.  Whenever a customer feels misled, mistreated, ignored, coerced (Ex  $40 late fees that only cost the bank $0.82).  Too much dependence on scorecards or commissions can cause bad profits.  "
    },
    {
      "id": "4243",
      "title": "Capacity",
      "body": "Outbound sales should only be as much as you can service customers (Ex   AOL CDS caused so many new customers to signup that it crashed their system)."
    },
    {
      "id": "4244",
      "title": "Use of Score",
      "body": "Net promoter scores should be reported to investors and should be used to drive budget and resource allocation."
    },
    {
      "id": "4245",
      "title": "NPS",
      "body": "Net promoter score is a way to establish accountability for the customer experience through a simple one question proven feedback; 'On a scale from xero to ten, how likely are you to recommend our services/product to a friend'what is the primary reason for giving us this score?'"
    },
    {
      "id": "4246",
      "title": "Behaviors",
      "body": "Make sure you are linking customer behavior to NPS scores to insure that it is an accurate reading of promoters, passives, and detractors."
    },
    {
      "id": "4247",
      "title": "Survey Best Practices",
      "body": "Keep them as short as possible (one or two questions), avoid anonymous so you can close loop, structure in the language of the customer, not researcher, ask NPS question and very little else."
    },
    {
      "id": "4248",
      "title": "Disruptions",
      "body": "Industries with lots of bad profits are usually ripe for disruption (Ex   Blockbusters late fees setup Netflix to disrupt them)."
    },
    {
      "id": "4249",
      "title": "Always 0 to 10",
      "body": "If you use 1 to 10 then some people will think 1 are the best and will transpose the survey.  "
    },
    {
      "id": "4250",
      "title": "Rank Bad Profits",
      "body": "Have your employees and company members rank ways you get bad profits and cut the bottom ones out.  "
    },
    {
      "id": "4251",
      "title": "Employee NPS",
      "body": "Have employees and investors take the NPS but be warned that they will probably be more harsh than customers."
    },
    {
      "id": "4252",
      "title": "CFO",
      "body": "Has to be a friend fo the NPS."
    },
    {
      "id": "4253",
      "title": "Customer Communities",
      "body": "Groups that provide regular feedback on company products and services.  Try to get detractors to come to these groups as well."
    },
    {
      "id": "4254",
      "title": "Combat Survey Fatigue",
      "body": "Get customer to make a verbal commitment to it, communicate with customer after the survey, structure surveys like vote so they can see the purpose of their feedback."
    },
    {
      "id": "4255",
      "title": "Misleading Financials",
      "body": "Financial results can't distinguish a dollar of good profit from a dollar of bad profit.  You must look at repeat customers or NPS score."
    },
    {
      "id": "4256",
      "title": "NPS Bias (and solutions)",
      "body": "Fear of retribution (insure confidentiality, have a third party do the survey, tell them you are averaging the scores, tell them the moral code of your company), bribes to get high ratings (educate employees and customers, enforce strict ethical rules, provide a place for people to report unethical behavior confidentially)."
    },
    {
      "id": "4257",
      "title": "Follow me homes/to work",
      "body": "Employees get permission to watch the customer use their product."
    },
    {
      "id": "4258",
      "title": "Apple's NPS Software",
      "body": "Emails survey to customers, store managers receive all responses on their iPhone after customer hits send, headquarters gets data to put into CRM, managers can pull up customer history, logging, on their phone, managers can click on phone to call the customer for a closed loop feedback, managers can submit tasks to system.  "
    },
    {
      "id": "4259",
      "title": "Face-to-face",
      "body": "Design your office and company so that managers are forced to have face to face conversations with customers.  (Ex   Apple created their retail stores to make sure their employees were seeing exactly what problems their customers were having.).  Get rid of phone trees, make sure a human answers the phone."
    },
    {
      "id": "4260",
      "title": "Know Who Is Who",
      "body": "Categorize promoters and detractors so you know who they are and can see if there are patterns in their profile."
    },
    {
      "id": "4261",
      "title": "Compensation Performance",
      "body": "Avoid linking NPS to compensation, it will encourage gaming and manipulation.  "
    },
    {
      "id": "4262",
      "title": "Closing Loop",
      "body": "At Apple, store managers call every detractor within twenty four hours.  They discovered that every hour calling detractors was generating more than $1,000 in new revenue."
    },
    {
      "id": "4263",
      "title": "Model NPS Companies",
      "body": "Apple, Amazon, Costco, USAA have NPS of 60-80%.  The average firm has an NPS of 10-20%.  NPS leaders grow at twice the rate of other companies in their industry."
    },
    {
      "id": "4264",
      "title": "High Response Rates",
      "body": "Aim for high response rates from a small audience versus a small response rates from a large audience.  This will insure you get a more diverse response instead of just response from those that are naturally inclined to respond."
    },
    {
      "id": "4265",
      "title": "Close The Loop",
      "body": "Act on what you learn, follow up with detractors to see how you can improve your service, follow up with promoters to leverage them as referrals, make sure management gets weekly feedback to improve company, use feedback for product development.  "
    },
    {
      "id": "4266",
      "title": "Measurement",
      "body": "A mission without measurement is a failure 100% of the time."
    }
  ]
}

