{
  "subject": "Onboarding Checklist",
  "credit": "Onboarding Checklist",
  "topic": "Service",
  "todos": [
    {
      "id": "4316",
      "title": "Consultative",
      "body": "Understand their industry and bringup ideas that they might not have thought about.  "
    },
    {
      "id": "4317",
      "title": "To minimize that initial churn, smart businesses focus on onboarding",
      "body": "the process by which you help a customer go from (1) to (2). Making that transition as fast and smooth as possible for your customers will win you higher retention and happier customers."
    },
    {
      "id": "4318",
      "title": "Welcome Message",
      "body": "Make the onboarding experience personal."
    },
    {
      "id": "4319",
      "title": "Welcome Manual",
      "body": "About Us, Goals, If We Are Missing Something Let Us Know, How To, Troubleshooting"
    },
    {
      "id": "4320",
      "title": "Get them to First Success",
      "body": "A disproportionate amount of your customer churn will take place between (1) and (2). That's where customers abandon your product because they get lost, don't understand something, don't get value from the product, or simply lose interest."
    },
    {
      "id": "4321",
      "title": "Source",
      "body": "10 Great Examples of Customer Onboarding That You Can Learn From - Len Markidan"
    },
    {
      "id": "4322",
      "title": "Association and Familiarity",
      "body": "When describing things, relate them to what the user is accustomed or familiar with doing in other products."
    },
    {
      "id": "4323",
      "title": "Monitor Use & Analytics",
      "body": "Watch what they are doing so you can help them correct problems before you even know they occur."
    },
    {
      "id": "4324",
      "title": "Set Goals",
      "body": "Make sure to have clearly set goals for the first onboarding session."
    },
    {
      "id": "4325",
      "title": "Usability Testing",
      "body": "If they are an early adopter, get them involved in usability testing."
    },
    {
      "id": "4326",
      "title": "Respond Quickly",
      "body": "Get back to them as soon as possible."
    },
    {
      "id": "4327",
      "title": "Small Steps",
      "body": "Don't overwhelm them in the first session.  "
    },
    {
      "id": "4328",
      "title": "Avoid Fales Promises",
      "body": "Be clear about expectations and deliverables."
    }
  ]
}

