{
  "subject": "On Intelligence Checklist",
  "credit": "On Intelligence Checklist",
  "topic": "Data",
  "todos": [
    {
      "id": "4291",
      "title": "Pattern Recognition",
      "body": "To retrieve a pattern in your memory you must provide the pattern you want to retrieve.  Fortunately you don't have to have the entire pattern to retrieve it, only a portion.  Patterns are stored in a hierarchy."
    },
    {
      "id": "4292",
      "title": "Experts",
      "body": "Recognizing patterns on patterns."
    },
    {
      "id": "4293",
      "title": "Prediction",
      "body": "Is best when you have multiple sensors providing information.  Prediction is when people fit existing ideas into new frameworks.  "
    },
    {
      "id": "4294",
      "title": "Sequencing",
      "body": "Collapsing patterns into named objects.  You don't need to know every detail but you do need to know if a change occurs in the sequence."
    },
    {
      "id": "4295",
      "title": "Intelligence",
      "body": "Capacity to remember and predict patterns in the world.  "
    },
    {
      "id": "4296",
      "title": "Saccade",
      "body": "Your eye fixates on one point and jumps to another.  Happens about three times a second.  Vision is more like a song than a painting."
    },
    {
      "id": "4297",
      "title": "Patience",
      "body": "When you don't know how to proceed, often the best strategy is to make no changes until your options become clear.'"
    },
    {
      "id": "4298",
      "title": "Hebbian Learning",
      "body": "Two neurons that fire at the same time wire together.  "
    },
    {
      "id": "4299",
      "title": "Language",
      "body": "Through language one human can evoke memories and create new juxtapositions of mental objects in another human.  "
    },
    {
      "id": "4300",
      "title": "Parallel",
      "body": "Thinking, predicting, and doing all happen at the same time, not one at a time.  "
    },
    {
      "id": "4301",
      "title": "Senses",
      "body": "There are way more than five senses (motion, color, luminance, pressure, temperature, pain, vibration, joint sensors, gut, inner ear)."
    },
    {
      "id": "4302",
      "title": "Paul Erdos",
      "body": "The simplest mathematical proogs already exist in some thereal book and a mathematician's job was to find them.  "
    },
    {
      "id": "4303",
      "title": "Age",
      "body": "The more you know the less you remember.  Once you are exposed to the same non-important things over and over, you are less likely to remember the details of it.  This is why children can easily remember trivial things such as signs because it is a novel experience to them."
    },
    {
      "id": "4304",
      "title": "Feedback",
      "body": "The brain is saturated with feedback connections."
    },
    {
      "id": "4305",
      "title": "Cortex",
      "body": "The brain has layers that information passes through to make sense and to create what you need."
    },
    {
      "id": "4306",
      "title": "Columns",
      "body": "The brain has columns in it to carry out different tasks or storage.  Many can be activated at once but eventually the brain picks a winner.  "
    },
    {
      "id": "4307",
      "title": "Stored Intelligence",
      "body": "The brain doesn't just compute problems, it retrieves the answers from memory it stored a long time ago."
    },
    {
      "id": "4308",
      "title": "Simplicity",
      "body": "The best solutions to scientific problems are simple and elegant."
    },
    {
      "id": "4309",
      "title": "Creativity",
      "body": "Taking something and applying it to a different field or situation.  The way to be more creative is to assume that there is an answer to the problem and then letting your mind wander."
    },
    {
      "id": "4310",
      "title": "Kludge",
      "body": "Programs written without foresight."
    },
    {
      "id": "4311",
      "title": "Hear What We Want to Hear",
      "body": "Our brains fill in what they miss with what they expect to hear."
    },
    {
      "id": "4312",
      "title": "Artificial Intelligence",
      "body": "Machines won't be to able to do what humans do because they don't have sexual urges, hunger, pulse, muscles, emotions.  Humans are much more than intelligent machines."
    },
    {
      "id": "4313",
      "title": "In-betweeners",
      "body": "Like a telephone network, there is not a single connection from every neuron to another, the connections pass through high capacity lines and then spread out at the end.  "
    },
    {
      "id": "4314",
      "title": "Context",
      "body": "Information and language cannot be understood without context.  "
    },
    {
      "id": "4315",
      "title": "Variation",
      "body": "Computers are terrible at handling variation."
    }
  ]
}

