{
  "subject": "The Advantage - Organizational Health",
  "credit": "The Advantage - Organizational Health",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "5948",
      "title": "Six Critical Questions",
      "body": "Why do we exist, how do we behave, what do we do, how will we succeed, what is most important right now, who must do what?"
    },
    {
      "id": "5949",
      "title": "Vulnerability Based Trust",
      "body": "Team members are comfortable being transparent, honest, and naked with each other.  Leader must go first.  "
    },
    {
      "id": "5950",
      "title": "Healthy Organization",
      "body": "Minimal politics, minimal confusion, high morale, high productivity, low turnover."
    },
    {
      "id": "5951",
      "title": "Behavioral Trust",
      "body": "Knowing how a person will behave in a particular situation."
    },
    {
      "id": "5952",
      "title": "Smart Organization",
      "body": "Focuses on strategy, marketing, finance, and technology."
    },
    {
      "id": "5953",
      "title": "Hire for Fit",
      "body": "Your interview process should be designed to make sure prospects are a good cultural fit.  If you have an informal environment, ask the interviewee to change out his sweat pants for khaki shorts during the meeting and see how they react.  "
    },
    {
      "id": "5954",
      "title": "Strategic Durability",
      "body": "When barriers to entry are low and innovation is high, strategy needs to be reviewed and revised more frequently."
    },
    {
      "id": "5955",
      "title": "Profiling",
      "body": "Using metrics like Myers-Briggs Type Indicator to determine a persons type and how they interact with other types.  "
    },
    {
      "id": "5956",
      "title": "Rumors",
      "body": "The best way to make sure information gets through and organization is to spread rumors about it (versus formally announcing).  Information should be cascaded face to face, not through e-mails.  "
    },
    {
      "id": "5957",
      "title": "Mining For Conflict",
      "body": "Leaders that sense there is conflict should try to bring it out.  Leaders should encourage conflict as long as it is done in a constructive manner.  People don't have to like the decision of the conflict but they must understand it and support it for the greater good."
    },
    {
      "id": "5958",
      "title": "Accidental Values",
      "body": "Leaders need to watch out for accidental values that develop (such as just hiring white males).  "
    },
    {
      "id": "5959",
      "title": "Value Check",
      "body": "Is you organization more committed to this value than 99 percent of other companies in the industry?"
    },
    {
      "id": "5960",
      "title": "Simplify Values",
      "body": "If everything is important then nothing is important."
    },
    {
      "id": "5961",
      "title": "Chief Reminding Officer",
      "body": "Great leaders are tasked with setting the direction of the organization and then reminding people of that direction on a daily basis.  Repetition is key to learning.  The message should come from different channels."
    },
    {
      "id": "5962",
      "title": "Firing",
      "body": "Firing someone is not necessarily the sign of accountability but is often the last act of cowardice for a leader who doesn't know how or isn't willing to hold people accountable.  People should quit because they know they can't be held accountable for the team's goals."
    },
    {
      "id": "5963",
      "title": "Conflict",
      "body": "Conflict is healthy in organizations as long as it is done constructively and is not mean spirited.  People should not be singled out.  Fear of conflict (meandering) is un-healthy.  People from different cultures respond to conflict differently."
    },
    {
      "id": "5964",
      "title": "Conflict v. Accountability",
      "body": "Conflict is about issues and ideas, accountability is about performance and behavior."
    }
  ]
}

