{
  "subject": "ORGANIZATIONAL/VISIONARY COMPANIES CHECKLIST",
  "credit": "ORGANIZATIONAL/VISIONARY COMPANIES CHECKLIST",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "4329",
      "title": "Home Grown Management",
      "body": "Is your management internally run and promoted from within?"
    },
    {
      "id": "4330",
      "title": "Thirty Percent Rule",
      "body": "Does your division generate 30% of revenue from products introduced in just last three years?"
    },
    {
      "id": "4331",
      "title": "Bottom Line",
      "body": "Does your company strive to serve people, make great products, and then make profits (in order)?  * Sometimes economic blunders that benefit people or product seem like curses in the short-run but end up being blessings in the long-run."
    },
    {
      "id": "4332",
      "title": "Genesis Grants",
      "body": "Does your company award internal grans for prototypes, seed funding, etc.?"
    },
    {
      "id": "4333",
      "title": "Embracing Goals",
      "body": "Do your employees and partners embrace these goals?"
    },
    {
      "id": "4334",
      "title": "Does it Stick",
      "body": "Do you try a lot of stuff and see if it works (accidently stumbling onto projects)?"
    },
    {
      "id": "4335",
      "title": "Translation",
      "body": "Do you translate your core ideology into practice?"
    },
    {
      "id": "4336",
      "title": "Small Steps",
      "body": "Do you take small steps and 'make a little, sell a little' (big things often evolve from little things)?"
    },
    {
      "id": "4337",
      "title": "OR v. AND",
      "body": "Do you strive to have your cake AND eat it too?"
    },
    {
      "id": "4338",
      "title": "BHAG",
      "body": "Do you set big hair audacious goals that disregard what's possible (BHAG should require no explanation)?"
    },
    {
      "id": "4339",
      "title": "Rank Employees",
      "body": "Do you rank employees for performance (democratically)?"
    },
    {
      "id": "4340",
      "title": "Profit Sharing",
      "body": "Do you implement employee profit sharing or stock options?"
    },
    {
      "id": "4341",
      "title": "Hubris Factor",
      "body": "Do you have self-confidence bordering on hubris?"
    },
    {
      "id": "4342",
      "title": "Dream Team",
      "body": "Do you have a vision of your dream team?"
    },
    {
      "id": "4343",
      "title": "Education Centers",
      "body": "Do you have a strong education center?"
    },
    {
      "id": "4344",
      "title": "Credo",
      "body": "Do you have a credo (lists responsibilities to different people involved in your business and how you will treat them)?"
    },
    {
      "id": "4345",
      "title": "Store within a Store (Walmart)",
      "body": "Do you give your employees overarching goals and authority to operate on their own?"
    },
    {
      "id": "4346",
      "title": "Tortoise & Hare",
      "body": "Do you get off to a slow start but win in the long run?"
    },
    {
      "id": "4347",
      "title": "Fail Fast",
      "body": "Do you fail fast and avoid waste?"
    },
    {
      "id": "4348",
      "title": "Beat Yesterday",
      "body": "Do you establish dashboard that show whether you are beating the same day, week, month from last year?"
    },
    {
      "id": "4349",
      "title": "Cult-like Culture",
      "body": "Do you establish clear and cult like culture (clear expectations, elitism, strict rules combined with incredible autonomy and flexibility, core ideology, tightness of fit)?"
    },
    {
      "id": "4350",
      "title": "Fifteen Percent Rule",
      "body": "Do you encourage technical people to spend 15% of their time on their own project (then allow them to run the new product division)?"
    },
    {
      "id": "4351",
      "title": "Synergies",
      "body": "Do you encourage synergies and linkages?"
    },
    {
      "id": "4352",
      "title": "Change",
      "body": "Do you encourage change and discourage complacency/status quo (create discomfort even if the company is doing well, there is no such thing as standing still)?"
    },
    {
      "id": "4353",
      "title": "Talent",
      "body": "Do you bring out the energy and talent of your employees and partners?"
    },
    {
      "id": "4354",
      "title": "Internal Competition",
      "body": "Do you allow your employees, products, shareholders, vendors, to constructively compete against each other?"
    },
    {
      "id": "4355",
      "title": "Gambler",
      "body": "Are you willing to take gambles and fail fast?"
    },
    {
      "id": "4356",
      "title": "Persistence",
      "body": "Are you persistent?"
    },
    {
      "id": "4357",
      "title": "First Failure",
      "body": "Are you more concerned about the company as the ultimate creation instead of any given product as the ultimate creation?"
    },
    {
      "id": "4358",
      "title": "Beat Yourself",
      "body": "Are you more concerned about beating yourself than competition?"
    },
    {
      "id": "4359",
      "title": "Organizational Leaders",
      "body": "Are you more concerned about architecting an enduring institution than being a great leader?"
    },
    {
      "id": "4360",
      "title": "Tomorrow",
      "body": "Are you always looking for opportunities of tomorrow and are you leading the change?"
    },
    {
      "id": "4361",
      "title": "One Person Owners",
      "body": "16 of 35 'Visionary' companies were founded by one person, the rest by multiple partners."
    }
  ]
}
