{
  "subject": "PATTERN LANGUAGE SUMMARY",
  "credit": "PATTERN LANGUAGE SUMMARY",
  "todos": [
    {
      "id": "4389",
      "title": "Hoteling’s problem",
      "body": "business tend to cluster and end up competing with each other instead of spreading out.  Franchises have more ability to cluster but new local shops should separate themselves."
    },
    {
      "id": "4390",
      "title": "A space for a person to feel comfortable must have at least two windows.  ",
      "body": ""
    },
    {
      "id": "4391",
      "title": "A town needs public squares that are not too large.  ",
      "body": ""
    },
    {
      "id": "4392",
      "title": "Add interior windows for connecting spaces.  ",
      "body": ""
    },
    {
      "id": "4393",
      "title": "An alcove provide a person the chance to be alone and to be together.  ",
      "body": ""
    },
    {
      "id": "4394",
      "title": "Angle town-homes sideways.",
      "body": ""
    },
    {
      "id": "4395",
      "title": "Artificial separation of houses and work create intolerable rifts in people’s inner lives.  Scatter workplaces throughout the city.",
      "body": ""
    },
    {
      "id": "4396",
      "title": "Avoid closed off or separate offices.  Make workrooms for 2-3 people.  ",
      "body": ""
    },
    {
      "id": "4397",
      "title": "Avoid long sterile corridors.",
      "body": ""
    },
    {
      "id": "4398",
      "title": "Avoid urban sprawl",
      "body": ""
    },
    {
      "id": "4399",
      "title": "Balconies and porches which are less than six feet deep are hardly ever used.",
      "body": ""
    },
    {
      "id": "4400",
      "title": "Bath should be large enough for two or three people.  ",
      "body": ""
    },
    {
      "id": "4401",
      "title": "Build a children’s home where children can stay.",
      "body": ""
    },
    {
      "id": "4402",
      "title": "Build a greenhouse.",
      "body": ""
    },
    {
      "id": "4403",
      "title": "Build a hill of houses.  ",
      "body": ""
    },
    {
      "id": "4404",
      "title": "Build an enclosed outdoor area that is protected from sun.  ",
      "body": ""
    },
    {
      "id": "4405",
      "title": "Build child caves.",
      "body": ""
    },
    {
      "id": "4406",
      "title": "Build closets between rooms.",
      "body": ""
    },
    {
      "id": "4407",
      "title": "Build complexes of small buildings, not large monolithic buildings.  Buildings must have a singular center.",
      "body": ""
    },
    {
      "id": "4408",
      "title": "Build secret rooms.",
      "body": ""
    },
    {
      "id": "4409",
      "title": "Build thick walls that actually occupy space.",
      "body": ""
    },
    {
      "id": "4410",
      "title": "Buildings should be built on the worst parts of land, not the best.",
      "body": ""
    },
    {
      "id": "4411",
      "title": "Cars give people wonderful freedom but they kill social life by spreading people apart and keeping them apart.",
      "body": ""
    },
    {
      "id": "4412",
      "title": "Cities need more green space.",
      "body": ""
    },
    {
      "id": "4413",
      "title": "Create a children’s realm.",
      "body": ""
    },
    {
      "id": "4414",
      "title": "Create a smooth and graceful transition between the street and the inside of a building.  ",
      "body": ""
    },
    {
      "id": "4415",
      "title": "Create alcoves that provide function but do not take the same space as if you created a separate room.",
      "body": ""
    },
    {
      "id": "4416",
      "title": "Design external, not internal staircases.",
      "body": ""
    },
    {
      "id": "4417",
      "title": "Develop the marriage bed into something special.",
      "body": ""
    },
    {
      "id": "4418",
      "title": "Do not let the ground area covered by buildings exceed 50% of the site.",
      "body": ""
    },
    {
      "id": "4419",
      "title": "Don’t build cupboards too deep.  If you cannot see an item, you will not use it.",
      "body": ""
    },
    {
      "id": "4420",
      "title": "Each subculture needs a center for its public life, a place where you can go to see people, and to be seen.",
      "body": ""
    },
    {
      "id": "4421",
      "title": "Encourage children walking or biking to school.",
      "body": ""
    },
    {
      "id": "4422",
      "title": "Encourage diversity in a neighborhood.  ",
      "body": ""
    },
    {
      "id": "4423",
      "title": "Encourage learning, not teaching.  So that children learn to think and act for themselves.  ",
      "body": ""
    },
    {
      "id": "4424",
      "title": "Encourage markets with multiple owners, not large supermarkets.",
      "body": ""
    },
    {
      "id": "4425",
      "title": "Encourage master and apprentice.  ",
      "body": ""
    },
    {
      "id": "4426",
      "title": "Encourage outdoor areas in negative spaces between buildings.",
      "body": ""
    },
    {
      "id": "4427",
      "title": "Encourage self-governing workshops and offices of 5 to 12 workers.  More than 12 people cannot sit in a meeting together.",
      "body": ""
    },
    {
      "id": "4428",
      "title": "Encourage sleeping on streets.",
      "body": ""
    },
    {
      "id": "4429",
      "title": "Encourage sports and physical activity.",
      "body": ""
    },
    {
      "id": "4430",
      "title": "Encourage stair seating.",
      "body": ""
    },
    {
      "id": "4431",
      "title": "Encourage subcultures within a city.  Subcultures must have physical boundaries to remain strong.",
      "body": ""
    },
    {
      "id": "4432",
      "title": "Every neighborhood should have a corner grocery store.",
      "body": ""
    },
    {
      "id": "4433",
      "title": "Groups must have areas for communal eating.  ",
      "body": ""
    },
    {
      "id": "4434",
      "title": "Houses should be in clusters.",
      "body": ""
    },
    {
      "id": "4435",
      "title": "Houses should have an area for kids, area for adults, and an area that is shared.",
      "body": ""
    },
    {
      "id": "4436",
      "title": "If the right rooms face south, a house is bright and sunny and cheerful; if the wrong rooms face south, the house is dark and gloomy.  Place most important rooms on south side.",
      "body": ""
    },
    {
      "id": "4437",
      "title": "In bathing we tend to ourselves and our bodies.  It is one of the most simple ways of unwinding.",
      "body": ""
    },
    {
      "id": "4438",
      "title": "In work places, people prefer to be in a group of 2 to 8 people.  Break institutions into smaller groups.",
      "body": ""
    },
    {
      "id": "4439",
      "title": "Individuals have no effective voice in any community of more than 5,000 to 10,000 people.",
      "body": ""
    },
    {
      "id": "4440",
      "title": "It is not possible to make an environment fit for human use when more than 9 percent of it is given to parking (30 cars per acre).  Divide parking amongst the land.   Any additional parking should be put in garages (preferably underground).",
      "body": ""
    },
    {
      "id": "4441",
      "title": "Keep workspaces on the same floor.  ",
      "body": ""
    },
    {
      "id": "4442",
      "title": "Kitchen needs sun more than any other rooms.",
      "body": ""
    },
    {
      "id": "4443",
      "title": "Let the site tell you its secrets.",
      "body": ""
    },
    {
      "id": "4444",
      "title": "Maintain sacred sites.",
      "body": ""
    },
    {
      "id": "4445",
      "title": "Make 70 percent of meeting rooms for 12 people or less.",
      "body": ""
    },
    {
      "id": "4446",
      "title": "Make ceiling height vary.",
      "body": ""
    },
    {
      "id": "4447",
      "title": "Make sure there is always space for bulk storage.",
      "body": ""
    },
    {
      "id": "4448",
      "title": "Metropolitan regions will not come to balance until each one is small and autonomous enough to be an independent sphere of culture.",
      "body": ""
    },
    {
      "id": "4449",
      "title": "Need an entrance room for any building.",
      "body": ""
    },
    {
      "id": "4450",
      "title": "Never position doors in a way that creates a pattern of movement that is disruptive to the room.  ",
      "body": ""
    },
    {
      "id": "4451",
      "title": "No one can be close to each other without also having opportunity to be alone.  ",
      "body": ""
    },
    {
      "id": "4452",
      "title": "People need an identifiable spatial unit to belong to.",
      "body": ""
    },
    {
      "id": "4453",
      "title": "People seek out concentrations of other people.",
      "body": ""
    },
    {
      "id": "4454",
      "title": "People use open space if it is sunny and do not use it if it isn’t, in all but desert climates.  Always place buildings to the north of outdoor space.",
      "body": ""
    },
    {
      "id": "4455",
      "title": "People want to sit where their backs are protected.",
      "body": ""
    },
    {
      "id": "4456",
      "title": "People will gravitate to rooms that are lit on more than one side.  ",
      "body": ""
    },
    {
      "id": "4457",
      "title": "People will only walk 3 minutes to a green space.",
      "body": ""
    },
    {
      "id": "4458",
      "title": "Population should be balanced between small villages and big cities.  ",
      "body": ""
    },
    {
      "id": "4459",
      "title": "Provide a place for dressing and undressing, not just a bedroom.",
      "body": ""
    },
    {
      "id": "4460",
      "title": "Provide access to water.",
      "body": ""
    },
    {
      "id": "4461",
      "title": "Raise pedestrian paths 18 inches above vehicles.",
      "body": ""
    },
    {
      "id": "4462",
      "title": "Receptions should be welcoming, not just a room with a desk.  Have receptionist come from another room to great guests and sit with them until there meeting.  There purpose should be to create a relationship with the guest, not simply check them in.  Have other activities in the reception room (pool table, café, books, etc.).  The guest chosen activity while they wait will help explain their character.",
      "body": ""
    },
    {
      "id": "4463",
      "title": "Restrict buildings to four-stories.  High buildings make people go crazy.  People should not live in buildings above four stories.  ",
      "body": ""
    },
    {
      "id": "4464",
      "title": "Sleep on the east of home so the sun awakens you.",
      "body": ""
    },
    {
      "id": "4465",
      "title": "Small parking lots should not have more than 7 stalls.  A collection of more than seven things is “many things.”",
      "body": ""
    },
    {
      "id": "4466",
      "title": "Social groups cannot survive without constant formal contact.",
      "body": ""
    },
    {
      "id": "4467",
      "title": "Start a beer hall where people can sing, and drink and shout and drink, and let go of their sorrows.",
      "body": ""
    },
    {
      "id": "4468",
      "title": "The area immediately south of a building should be designed as a place where people can bask in the sun.",
      "body": ""
    },
    {
      "id": "4469",
      "title": "The faster the traffic and larger the car is, the more separated people will be.  ",
      "body": ""
    },
    {
      "id": "4470",
      "title": "The life of a public square forms naturally around the edges.  If the edge fails, then the space never becomes lively.",
      "body": ""
    },
    {
      "id": "4471",
      "title": "There is no substitute for real fire.",
      "body": ""
    },
    {
      "id": "4472",
      "title": "Transportation features must have an incentive to connect to each other at interchanges.  Surround interchanges with businesses.  ",
      "body": ""
    },
    {
      "id": "4473",
      "title": "Turn an old house into an office.",
      "body": ""
    },
    {
      "id": "4474",
      "title": "Universities should let diverse people with different backgrounds teach classes.",
      "body": ""
    },
    {
      "id": "4475",
      "title": "Use general assumptions with $/SF to determine feasibility of site.",
      "body": ""
    },
    {
      "id": "4476",
      "title": "Use the staircase as a stage.",
      "body": ""
    },
    {
      "id": "4477",
      "title": "Vast parking lots wreck the land for people.",
      "body": ""
    },
    {
      "id": "4478",
      "title": "Wherever there is a sharp separation between residential and non-residential parts of town, the nonresidential areas will quickly turn into slums.",
      "body": ""
    }
  ]
}

