{
  "subject": "Personal Improvement Checklist",
  "credit": "Personal Improvement Checklist",
  "todos": [
    {
      "id": "4574",
      "title": "Too many connections",
      "body": "I try to maintain too many relationships and not just the key or top level ones.  I need to focus in like a sniper and maintain a few core relationships."
    },
    {
      "id": "4575",
      "title": "Dictator v Committee",
      "body": "Design by dictator is preferred for time-driven projects with straightforward requirements, consequences of error are tolerable, and stakeholder buy-in is unimportant.  Design by committee is preferred when projects are quality driven, complex, can be consequential, and buy in is important.  I need to recognize the project quality and lead accordingly."
    },
    {
      "id": "4576",
      "title": "Slow Down",
      "body": "Slow down when giving presentations. Be careful about saying “you know”, “um”, etc.  Make sure you tell audience to stop you at any point.  Don’t try to impress with technical jargon."
    },
    {
      "id": "4577",
      "title": "Methodical",
      "body": "Identify the true problem, outline criteria for success, focus in on multiple alternatives before you jump into a solution.  Make sure to communicate those alternatives and why you chose the current solution so that others can converge upon the same conclusion.  "
    },
    {
      "id": "4578",
      "title": "Independent",
      "body": "I rank really high in independence.  I need to communicate well, visualize my ideas, back them up with data, and make sure others are on the same page and caught up.  I need to make sure others are committed before I move forward. I need to make sure to not become a control freak and let others contribute."
    },
    {
      "id": "4579",
      "title": "Aggressive",
      "body": "I rank low in aggressive behavior.  I need to be firmer but also kind and funny.  Direct, Honest, & Gentle."
    },
    {
      "id": "4580",
      "title": "Perfection",
      "body": "I need to ship early and not wait for perfection.  Perfection is the enemy of profit.  It’s better to be annoying and valuable that to be respectfully fired.  Ask yourself, “is this good enough?”"
    },
    {
      "id": "4581",
      "title": "Engagement",
      "body": "I need to make sure that those around me are engaged in our company’s purpose.  I need to make sure that we are a purpose led environment and that we connect employee’s passions with our purpose.  I need to use engagement as a variable and use PXT to determine whether a person ranks high in engagement with the organization."
    },
    {
      "id": "4582",
      "title": "Focus",
      "body": "I like to always be thinking about the future and new projects.  I need to work better at managing and making money from what we have at hand.  I need to work on simplifying and committing to the simplification.  I need to focus in on one model and commit.  Don’t mission drift.  Those who focus on less usually accomplish more."
    }
  ]
}

