{
  "subject": "Pipeline Module Debrief",
  "credit": "Pipeline Module Debrief",
  "todos": [
    {
      "id": "4583",
      "title": "3 whys",
      "body": "Why is this worth pursuing, why now, why this team?"
    },
    {
      "id": "4584",
      "title": "Core Values",
      "body": "no typing necessary, easy and fast, stays accurate and updated."
    },
    {
      "id": "4585",
      "title": "Test",
      "body": "Get people to test macro excel prototypes.  Get people to send you incomplete spreadsheets and the get filled out within certain time."
    },
    {
      "id": "4586",
      "title": "Worth",
      "body": "Your worth is not tied to your company worth.  Your friends, family, and God will not love you any more or less if it fails or succeeds.  "
    },
    {
      "id": "4587",
      "title": "Pitch",
      "body": "You can buy hubspot and know your customer in two years or buy our product and know them in five minutes.  You can pay a guy in India $500 dollars to build you a spreadsheet or you can pay us $50 so you can create it.  "
    },
    {
      "id": "4588",
      "title": "Zappos Prototype",
      "body": "Took pictures of shoes at shoe stores and posted them online to test if the world would buy shoes online.  How can you test before you build?"
    },
    {
      "id": "4589",
      "title": "Simplify",
      "body": "Too many words on a presentation drive people away.  Best presentation has few words supported by cool pictures and requires the audience to be engaged kinesthetically.  "
    },
    {
      "id": "4590",
      "title": "Four types of companies",
      "body": "Technology creators that sell IP, network orchestrators that connect values, service providers that sell human capital, asset builders that sell physical property.  "
    },
    {
      "id": "4591",
      "title": "Long-term",
      "body": "Sometimes you need to sacrifice short term revenue to build long term wealth.  "
    },
    {
      "id": "4592",
      "title": "Presell",
      "body": "Presell motherfucker.  Sell the vision, not the finished product.  Don’t be afraid to ask for things upfront.  Don’t be a perfectionist.  "
    },
    {
      "id": "4593",
      "title": "Key to Fundraising",
      "body": "Meet with them, tell them you are going to do something, ask them whether they think that is a good plan, actually do it, tell them that you did it.  "
    },
    {
      "id": "4594",
      "title": "Two models",
      "body": "Let people use the program, we use the program and supply people the results.  "
    },
    {
      "id": "4595",
      "title": "Validation",
      "body": "Heres a product sales package (great story with beautiful images), here’s a $20 gift card for reading it, 1 question, be honest, what would you call it/would you buy it/would you invest in it?  "
    },
    {
      "id": "4596",
      "title": "IP Management",
      "body": "Great technology are really good at managing IP and their proprietary advantage."
    },
    {
      "id": "4597",
      "title": "Value chain",
      "body": "Follow the money, follow the steps.  "
    },
    {
      "id": "4598",
      "title": "Story2",
      "body": "Cook the story, add some feelings, reactions, descriptions, reactions, analogies, chunk the story, pause frequently in between points, paint the scene, ad description but not too much, include your reactions, add dialogue, establish the norm and then contrast the norm, describe the turning point, the height of the interaction, post comment reactions or descriptions."
    },
    {
      "id": "4599",
      "title": "CEO Duties",
      "body": "Build vision, build a team, fundraise.  "
    },
    {
      "id": "4600",
      "title": "Pitch",
      "body": "Be able to describe you business with intrigue in five words or less.  We are a data marketplace for stupid people.  "
    },
    {
      "id": "4601",
      "title": "Story",
      "body": "Be a fucking great storyteller.  Keep a story book, match stories with lessons, practice stories, don’t try to be perfect, be vulnerable, create the setting, introduce characters, what unfolds, describe conflict, tell what was learned."
    },
    {
      "id": "4602",
      "title": "Ask for Advice",
      "body": "Ask for a meeting and tell them you aren’t going to pitch them."
    },
    {
      "id": "4603",
      "title": "Find a better CFO.",
      "body": ""
    },
    {
      "id": "4604",
      "title": "Gigster",
      "body": ""
    }
  ]
}

