{
  "subject": "PITCH CHECKLIST",
  "credit": "PITCH CHECKLIST",
  "todos": [
    {
      "id": "4695",
      "title": "Screen",
      "body": "Work with them at computer, not on big screen.  Older folks like bigger screen because it is easier to see.  "
    },
    {
      "id": "4696",
      "title": "Elevator Pitch",
      "body": "We help X do Y by doing Z.  Who, what, why."
    },
    {
      "id": "4697",
      "title": "Proprietary Invention",
      "body": "Talk about proprietary invention/algorithm early on."
    },
    {
      "id": "4698",
      "title": "Font",
      "body": "Stick to a few fonts, size of font should be the oldest person in the room divided by two.  "
    },
    {
      "id": "4699",
      "title": "Practice",
      "body": "Steve Jobs practiced one hour for every 1 minute of his pitch.  He never rehearsed without an audience."
    },
    {
      "id": "4700",
      "title": "Lambs",
      "body": "Standard responses to common questions asked by customers."
    },
    {
      "id": "4701",
      "title": "Nervous Ticks",
      "body": "So, Um, What We Do, Hands in front of crouch"
    },
    {
      "id": "4702",
      "title": "Sit-With",
      "body": "Sit next to, not across from them.  "
    },
    {
      "id": "4703",
      "title": "SAM",
      "body": "Simile (it’s like), analogy (we do for X what Y does for Z), metaphor (we turn water into money)."
    },
    {
      "id": "4704",
      "title": "Calendar Invite",
      "body": "send calendar invite to make sure you have same time on calendar."
    },
    {
      "id": "4705",
      "title": "Details",
      "body": "Reveal details to their level of sophistication."
    },
    {
      "id": "4706",
      "title": "Response",
      "body": "Respond to e-mail within 1 to 24 hours.  Respond to a meeting within 24 to 48 hours."
    },
    {
      "id": "4707",
      "title": "Stories",
      "body": "Relate, remember, retell."
    },
    {
      "id": "4708",
      "title": "Use the word “because”",
      "body": "Reason"
    },
    {
      "id": "4709",
      "title": "Last Slide",
      "body": "Put cover as last slide with contact information so that investors can take snapshot if they need to get in touch with you."
    },
    {
      "id": "4710",
      "title": "Simple Choice",
      "body": "Providing to many choices will cause the customer to stick around more but they will buy less.  "
    },
    {
      "id": "4711",
      "title": "Format",
      "body": "Presentation should be 16 9"
    },
    {
      "id": "4712",
      "title": "Note",
      "body": "Practice pitch with timer counting down and counting up so it doesn’t throw you off."
    },
    {
      "id": "4713",
      "title": "Two decks",
      "body": "Pitch deck should be different than email deck.  Pitch deck should not have lots of words on it, you should speak those words."
    },
    {
      "id": "4714",
      "title": "www.nathangold.com/pipeline pwd",
      "body": "pipeline2016"
    },
    {
      "id": "4715",
      "title": "Build Trust",
      "body": "People are more willing to buy if there is a personal connection.  "
    },
    {
      "id": "4716",
      "title": "Personal Connection",
      "body": "People are more willing to buy if there is a personal connection.  "
    },
    {
      "id": "4717",
      "title": "Video",
      "body": "No more than 2 minutes on video.  Video Pixi."
    },
    {
      "id": "4718",
      "title": "Q&A",
      "body": "Never lose control, set the agenda, it is not a comedy session, don’t embarrass the person asking the question, don’t say “that’s a great question”, repeat and reframe the question, keep it brief, more questions you can answer the better, don’t fake an answer, say you’ll find out and get back to them, if people don’t ask questions, ask it for them, you decide when Q&A is over, wrap it up with a bow.  "
    },
    {
      "id": "4719",
      "title": "First impressions",
      "body": "Must be memorable (i.e. impressive, bold, or funny)."
    },
    {
      "id": "4720",
      "title": "Audiences with mixed expertise",
      "body": "Make the pitch understandable for a 3rd grader.  Get into more detail and answer more technical questions in the Q&A.  "
    },
    {
      "id": "4721",
      "title": "Decision Maker",
      "body": "Make sure you are talking to whoever can make decisions.  "
    },
    {
      "id": "4722",
      "title": "Know Decision Maker",
      "body": "Make sure you are talking to whoever can make decisions.  "
    },
    {
      "id": "4723",
      "title": "Professional Look",
      "body": "Make sure images are clear and have good resolution.  "
    },
    {
      "id": "4724",
      "title": "Emotion",
      "body": "Look for ways to provide a message that invokes emotion and empathy."
    },
    {
      "id": "4725",
      "title": "Persuade",
      "body": "Look for ways to provide a message that invokes emotion and empathy."
    },
    {
      "id": "4726",
      "title": "Memorize",
      "body": "Know your problems and solutions in long-term memory."
    },
    {
      "id": "4727",
      "title": "Problems",
      "body": "Know their problems before you meet with them."
    },
    {
      "id": "4728",
      "title": "It’s like",
      "body": "It’s like this.  Avoid tech reference being the first thing you say.  "
    },
    {
      "id": "4729",
      "title": "Surprise",
      "body": "Include a surprise."
    },
    {
      "id": "4730",
      "title": "Surprise",
      "body": "Include a surprise in your presentation so people will talk about you and remember what you said."
    },
    {
      "id": "4731",
      "title": "6 signals you must give any audience",
      "body": "I will not waste your time, I know who you are, I am well organized, I know my subject, Here is my most important point, I am finished by ending with a great story or last thought."
    },
    {
      "id": "4732",
      "title": "Value",
      "body": "Have useful data for them.  "
    },
    {
      "id": "4733",
      "title": "Physical Product",
      "body": "Have a physical license to have in front of them."
    },
    {
      "id": "4734",
      "title": "Hand Position",
      "body": "Hands to side"
    },
    {
      "id": "4735",
      "title": "Brag",
      "body": "Go to Nathangold.com/brag to learn how to brag"
    },
    {
      "id": "4736",
      "title": "Take-Away",
      "body": "Get decisions and commitments from clients."
    },
    {
      "id": "4737",
      "title": "Emphasize Your Commitment",
      "body": "Emphasize skin in the game.  Emphasis no debt and that you are not going to take backpay for 2.5 years of work."
    },
    {
      "id": "4738",
      "title": "Mimicry",
      "body": "Dress like them."
    },
    {
      "id": "4739",
      "title": "Chunking Preparation",
      "body": "Chunk to prepare for Lambs and Preparations.  "
    },
    {
      "id": "4740",
      "title": "Impress",
      "body": "Be able to impress them."
    },
    {
      "id": "4741",
      "title": "Speaking rate",
      "body": "Average person speaks between 120-140 words per minute.  Pipeline presentation is 7.75 minutes and should have approximately 1,007 words."
    },
    {
      "id": "4742",
      "title": "Entertainment",
      "body": "A memorable pitch should have all of these aspects, Why, Wow, What, How, heckling, fuckwithery, gaming, audience participation, seriousness, irony, contrasting emotions, consistent/repetitive parts, irony, satire, lots of facial expressions, humility, ego, poking fun, music, lights, smoke, costumes, improve, magic, mind reading, comedy, did he just do that, absurdness, apologizing for being absurd.   "
    },
    {
      "id": "4743",
      "title": "E-mail Subject",
      "body": "“Realbot + Other Company” or “Realbot – Other Company”"
    },
    {
      "id": "4744",
      "title": "Pitch Meal",
      "body": "Your pitch should include an appetizer (teaser), main course (heavy content), and a desert (best part that gets you back for more).  Don’t make it too heavy, don’t make it too light.  Repeat the best flavors you have to offer."
    },
    {
      "id": "4745",
      "title": "Handshake Intro",
      "body": "Who are you, what do you do, who do you do it for, why do they need or want it, how do they change or transform?"
    },
    {
      "id": "4746",
      "title": "Face-to Face",
      "body": "When presenting to just one or two people, work with them at computer, not on big screen."
    },
    {
      "id": "4747",
      "title": "Incentives",
      "body": "What incentives do users have to signup."
    },
    {
      "id": "4748",
      "title": "We do for X what X does for",
      "body": "We do for surfing what lifts do for downhill skiing.  "
    },
    {
      "id": "4749",
      "title": "Simple and Complex",
      "body": "Use simple language when pitching.  Use complex terminology when asked questions."
    },
    {
      "id": "4750",
      "title": "How Serious is The Relationship",
      "body": "The more serious the relationship, the slower you will want to build it out and the slower you will want to close the deal.  Make it very clear if you don’t have a past with them that you would like to find a way to establish trust and prove your value."
    },
    {
      "id": "4751",
      "title": "Offline",
      "body": "That’s a great question that we will have to have at the bar one night.   "
    },
    {
      "id": "4752",
      "title": "Celebrity Appeal",
      "body": "Tell about a celebrity that has endorsed your product."
    },
    {
      "id": "4753",
      "title": "Hook",
      "body": "Taking the listener’s current reality and putting it together with the delta change into a slogan.   Exs   You want guaranteed next day delivery, “when it absolutely positively has to be there overnight.”, you want strategy implemented, “this strategy is the key to getting us to retirement early”, you want them to sign the order, “accepting this order today means profits tomorrow”, you want another meeting, “let me come back on Thursday and I’ll show you how we can improve your ratings.”"
    },
    {
      "id": "4754",
      "title": "Revise",
      "body": "Take note of any objection and use that feedback to improve the pitch.  "
    },
    {
      "id": "4755",
      "title": "Surprise",
      "body": "Surprise the audience with the benefits, revenue channels, ect."
    },
    {
      "id": "4756",
      "title": "Story Matrix",
      "body": "Success, Failure, Fun, Legend as column headers.  Make up your own row labels such as customer, investor, mentor, sales, pitch, me.  "
    },
    {
      "id": "4757",
      "title": "Pitch role models",
      "body": "Steve Jobs, Tony Robbins, Les Brown, Craig Valentine, Daniel Pink, Shane Koyczan, Tomonari Ishiguro (Black), Eric Ryan, Richard Bandler (NLP), John Grindor."
    },
    {
      "id": "4758",
      "title": "Sales Process",
      "body": "State the length of your sales process and amount paid per client."
    },
    {
      "id": "4759",
      "title": "Legal",
      "body": "State current legal challenges."
    },
    {
      "id": "4760",
      "title": "Sit on Same Team",
      "body": "Sit next to, not across from them, it will appear like you are already working together.  "
    },
    {
      "id": "4761",
      "title": "Domain Knowledge",
      "body": "Show your knowledge of the industry."
    },
    {
      "id": "4762",
      "title": "Timeline",
      "body": "Show the history of how you’ve developed."
    },
    {
      "id": "4763",
      "title": "Emotions",
      "body": "Show how this software fixes a major problem."
    },
    {
      "id": "4764",
      "title": "Habit",
      "body": "Show how this is involved in everyday habits."
    },
    {
      "id": "4765",
      "title": "Trendy",
      "body": "Show how it is more than just a trend."
    },
    {
      "id": "4766",
      "title": "Viral Multiplier",
      "body": "Show how each new client gets you new business."
    },
    {
      "id": "4767",
      "title": "Revenue Channels",
      "body": "Show all the revenue channels.  Show industry market size.  Show why you are worth X and how you make Y per year."
    },
    {
      "id": "4768",
      "title": "Pitch",
      "body": "Should be a movie trailer not a movie.  You want people to get to the movie, not be everything.  Tease them and give them reasons to want more.  What are things you can leave for next meeting.  "
    },
    {
      "id": "4769",
      "title": "Body Language",
      "body": "Sell through your confident expressions.  People on absorb 7% of your words, 38% of your voice tone, and 55% of your facial expressions.  Be confident."
    },
    {
      "id": "4770",
      "title": "Don’t Railroad",
      "body": "Responding too quickly to a question is bad."
    },
    {
      "id": "4771",
      "title": "Zeros",
      "body": "Remove zeros (000) from financial statements.  Numbers should be in an easy to read fond.  "
    },
    {
      "id": "4772",
      "title": "Use Analogy/Similes",
      "body": "Relate your product to things people already know.  It’s like LinkedIn but… If you don’t set this conversation, others will make it up and might get it wrong."
    },
    {
      "id": "4773",
      "title": "How to Win Friends and Influence People",
      "body": "Read it a million times repeatedly."
    },
    {
      "id": "4774",
      "title": "CRAP",
      "body": "Quality design is C.R.A.P. – Contrasting, Repetitive, Aligned, Proximity.  Contrasting means that are next to each other but different should contrast significantly in color, font style, size, boldness, etc.  Repetitive means that you should use the same fonts, colors, sizes, boldness, images, shapes, etc. throughout the entire design.  Good design should only have 2-3 fonts, colors, sizes, boldness, images, shapes, etc.  Aligned means that objects that are together should be consistently aligned.  Proximity means that objects that are similar should be grouped together and objects that are not similar should be separated.  If something looks off, it usually falls within one of these four categories."
    },
    {
      "id": "4775",
      "title": "Use Cases",
      "body": "Put in use cases for how it can be used so people understand it."
    },
    {
      "id": "4776",
      "title": "Simple",
      "body": "Put complicated docs and spreadsheets in a leave behind."
    },
    {
      "id": "4777",
      "title": "Choice Chaos",
      "body": "Providing to many choices will cause the customer to stick around more but they will buy less.  "
    },
    {
      "id": "4778",
      "title": "Prepping Clients",
      "body": "PRAWN.  Know their Problems.  Research them.  Ask questions and present upfront contract.  Make sure technology is Working.  Determine Next steps (follow up)."
    },
    {
      "id": "4779",
      "title": "Don’t Bore The With Your Story",
      "body": "No one care about your story unless it is really good, funny, relevant to them, or you disclose good tricks, tips, hacks along the way.  "
    },
    {
      "id": "4780",
      "title": "Naming",
      "body": "Name should match what you do."
    },
    {
      "id": "4781",
      "title": "Schedule Preparation & Follow-up Time",
      "body": "Mark out calendar 30 min before to prepare and do upfront contract, 30 min immediately after to debrief (Mtg Notes), and a 30 min time within 36 hours to do follow up e-mail."
    },
    {
      "id": "4782",
      "title": "Practice",
      "body": "Many times.  Write down your entire script."
    },
    {
      "id": "4783",
      "title": "Alignment",
      "body": "Make sure you passions are in alignment with your work.  People don’t care what you do until they know why you do it.   "
    },
    {
      "id": "4784",
      "title": "Selling Ain’t telling",
      "body": "Listen to their problems, don’t tell them about your product, be patient and listen to needs.  "
    },
    {
      "id": "4785",
      "title": "Power of three",
      "body": "List things in three.  Only use three colors.  Three is the most things you should list things in a sentence so if there are more than three it seems too busy.  Your slides should have no more than three points or images for the human brain to feel comfortable."
    },
    {
      "id": "4786",
      "title": "Location",
      "body": "Know what locations and times are appropriate to meet at.  Know if they have working WiFi.  "
    },
    {
      "id": "4787",
      "title": "Do Your Homework",
      "body": "Know their problems before you meet with them.  Setup a discovery call or email before you meet to get a good idea of the specific problems you should address.  "
    },
    {
      "id": "4788",
      "title": "Delta Model",
      "body": "Know the specific change you want from each communication.  When you finish this communication, your receivers will…"
    },
    {
      "id": "4789",
      "title": "Story",
      "body": "Include good stories."
    },
    {
      "id": "4790",
      "title": "Division Chart",
      "body": "If your company does multiple services, products, or is in multiple markets, be clear what percent of profits come from each thing."
    },
    {
      "id": "4791",
      "title": "Audience Domain Knowledge",
      "body": "If your audience doesn’t have domain knowledge find a way to educate them quickly or provide them with a third party that could do due diligence on you."
    },
    {
      "id": "4792",
      "title": "Control the Conversation",
      "body": "If they ask for something, take control and send them what you think they need to see.  They want to see the confidence that you can take control of a situation or room and do what is right.  "
    },
    {
      "id": "4793",
      "title": "Upfront contract",
      "body": "If I can do A… will you do B…"
    },
    {
      "id": "4794",
      "title": "Relationships",
      "body": "Humans on average know 148 people (strong stable relationships).  95% confidence interval is 100 to 230.  "
    },
    {
      "id": "4795",
      "title": "Defense, University, Porn, Gov’t, Private",
      "body": "How does it affect each major industry."
    },
    {
      "id": "4796",
      "title": "Show Interest",
      "body": "How do you show interest among clients/investors."
    },
    {
      "id": "4797",
      "title": "Deal Lead",
      "body": "Get a term sheet.  Say things like  “We want you to lead this deal.  In the end, if you don’t want in I don’t care, we’ve got people to replace you but it would mean a lot if you helped us out.”"
    },
    {
      "id": "4798",
      "title": "Notes",
      "body": "Explain how you are not creepy early on, demo early on, share your philosophy early on, share your value proposition early on, move for purpose, not just to move."
    },
    {
      "id": "4799",
      "title": "Fear of Missing Out",
      "body": "Everything should be phrased as if you are hot shit but in a non-cocky and authentic way.  Say things like   We might have $150k but I think we have it all wrapped up.  I might be able to squeeze you in.  I’m not sure if you’ll be able to make our deadline.  We don’t really need your money.  You’re not in our space.  You’re not our usual suspect.  We’ve got this deadline.  "
    },
    {
      "id": "4800",
      "title": "Contrast",
      "body": "Every pitch should be about building your character (walk close to audience, playful, fun, jokes, engagement) and selling your business (closer to slides and product, intense energy, passion, eye contact, posture, confidence).  "
    },
    {
      "id": "4801",
      "title": "Pitch Materials for Investors",
      "body": "Email deck, Standup deck, One-Pager, Business Plan, Financials Appendix"
    },
    {
      "id": "4802",
      "title": "Story",
      "body": "Each slide should flow to the next."
    },
    {
      "id": "4803",
      "title": "Compartmentalized",
      "body": "Each slide should address one and only one question.  "
    },
    {
      "id": "4804",
      "title": "Own Needs",
      "body": "Don’t let your own needs to talk a lot, be funny, or get approval to interfere with the change you want in your receivers…"
    },
    {
      "id": "4805",
      "title": "Go Slow",
      "body": "Don’t have too many slides and only include content if you have time to talk about it.  "
    },
    {
      "id": "4806",
      "title": "Better than",
      "body": "Don’t brag, say “unlike X we do this…” differentiate rather than brag."
    },
    {
      "id": "4807",
      "title": "Offline",
      "body": "Don’t be afraid to take things offline if the conversation is getting pulled into a tangent that is not part of your object.  "
    },
    {
      "id": "4808",
      "title": "I don’t know",
      "body": "Don’t be afraid to confidently say “I don’t know but I will get you an answer by tomorrow”."
    },
    {
      "id": "4809",
      "title": "Technology",
      "body": "Does venue have Wi-Fi, cable adapters, projector, etc."
    },
    {
      "id": "4810",
      "title": "Current Reality",
      "body": "Do your homework and get them to be open and honest with you by revealing one of your vulnerabilities.  "
    },
    {
      "id": "4811",
      "title": "Visual Language",
      "body": "Describe things in tangible form so that people can see what you do (ex   Machine turns water into money, not platform that does data analytics)."
    },
    {
      "id": "4812",
      "title": "Good Openings",
      "body": "Demo, I’ve got a little confession, can you keep a secret, value proposition, tell your story (#1 best opening), go to whiteboard."
    },
    {
      "id": "4813",
      "title": "FailCon",
      "body": "Conference for failures.  Failure stories resonate more with investors than success stories.  "
    },
    {
      "id": "4814",
      "title": "Blue Ocean",
      "body": "Clearly show what separates you from competitors."
    },
    {
      "id": "4815",
      "title": "Confidence",
      "body": "Be very confident.  Don’t move at all when being asked a question.  "
    },
    {
      "id": "4816",
      "title": "Timing",
      "body": "Be good with timing."
    },
    {
      "id": "4817",
      "title": "Funny",
      "body": "Be funny."
    },
    {
      "id": "4818",
      "title": "Focus",
      "body": "Be focused on one industry.  If told it could be great for another vertical market state   “there are lots of use cases but… and we’ve got to fight this battle first.”"
    },
    {
      "id": "4819",
      "title": "Bad Openings",
      "body": "Asking people to raise their hands with obvious questions, asking audience to imagine, don’t use statistics if they are too obvious, never read to audience, bad jokes that don’t relate to your business,"
    },
    {
      "id": "4820",
      "title": "Question to Test Experience",
      "body": "Ask your audience how familiar they are with (your field), if they aren’t familiar then use a simile, analogy, or metaphor."
    },
    {
      "id": "4821",
      "title": "Advice, Not Capital",
      "body": "Ask for capital and you will get advice.  Ask for advice and you will get capital."
    },
    {
      "id": "4822",
      "title": "Passion",
      "body": "A good pitch should be passionate but never argumentative.  "
    },
    {
      "id": "4823",
      "title": "We turn water into money",
      "body": "A better way of saying river turbines that generate electricity."
    },
    {
      "id": "4824",
      "title": "Wow Statement",
      "body": "30 second statement that wows the listener (makes them say well how do you do that)."
    },
    {
      "id": "4825",
      "title": "5-Q Framework",
      "body": ""
    },
    {
      "id": "4826",
      "title": "Doing business with people who believe what you believe.  ",
      "body": ""
    },
    {
      "id": "4827",
      "title": "Excuse me, I have 5 pages.",
      "body": ""
    },
    {
      "id": "4828",
      "title": "I’m not going to even try to tell you what we are doing, I’m going to show you.  ",
      "body": ""
    },
    {
      "id": "4829",
      "title": "May I use the Xerox machine because I need to make some copies? – 93% positive response",
      "body": ""
    },
    {
      "id": "4830",
      "title": "May I use the Xerox machine because I’m in a rush? – 94% positive response",
      "body": ""
    },
    {
      "id": "4831",
      "title": "May I use the Xerox machine? – 60% positive response",
      "body": ""
    },
    {
      "id": "4832",
      "title": "What do you do ant the problem, Why you or your team, What does the world like with you, How do you make money, What do you need.  ",
      "body": ""
    },
    {
      "id": "4833",
      "title": "www.nathangold.com",
      "body": ""
    }
  ]
}

