{
  "subject": "Pitch ' Steve Jobs Checklist",
  "credit": "Pitch ' Steve Jobs Checklist",
  "topic": "Pitch",
  "todos": [
    {
      "id": "4605",
      "title": "End",
      "body": "With you headline, key theme, and advice."
    },
    {
      "id": "4606",
      "title": "Three types of learners",
      "body": "Visual (sight), auditory (sound), and kinesthetic (touch).  Incorporate something for all of them."
    },
    {
      "id": "4607",
      "title": "Headline",
      "body": "The one big idea you want to leave with your audience.  "
    },
    {
      "id": "4608",
      "title": "Slide/Script/Delivery Method Table",
      "body": "Put your slide text, script text, and delivery method (pauses, inflection, tone) in columns in a table next to each other.  "
    },
    {
      "id": "4609",
      "title": "Inspiring Communicators",
      "body": "Create something meaningful out of esoteric or everyday products.  Your widget doesn't inspire me.  Show me how your widget improves my life, and you've won me over."
    },
    {
      "id": "4610",
      "title": "Presentation Elements",
      "body": "Conflict, resolution, villains, and heroes."
    },
    {
      "id": "4611",
      "title": "Analogies",
      "body": "Comparison between two different things to highlight area of similarity.  Ex   It's like the microprocessor for your brain.  "
    },
    {
      "id": "4612",
      "title": "10 min",
      "body": "Your audience checks out after ten minutes, not a second later.  You need to finish in this time or transitions to something exciting, different, a video, etc.  "
    },
    {
      "id": "4613",
      "title": "Why should I care",
      "body": "You need to answer why customers should care about this.  If you don't you will fail.  Audience doesn't care about your product, they care about themselves and how it meets their needs.  Sell dreams, not products."
    },
    {
      "id": "4614",
      "title": "PLAIN ENGLISH CAMPAIGN",
      "body": "Write in plain English so everyone can understand you.  Avoid big words and complex terminology.  Usingenglish.com."
    },
    {
      "id": "4615",
      "title": "Share The Stage",
      "body": "With customers, audience members, partners, employees, etc."
    },
    {
      "id": "4616",
      "title": "Punch",
      "body": "When you're ready, don't be afraid to land the first punch at competitors."
    },
    {
      "id": "4617",
      "title": "Ultimate Elevator Pitch",
      "body": "What do you do, what problem do you solve, how are you different, why should I care."
    },
    {
      "id": "4618",
      "title": "Different",
      "body": "We want to sell to people that have always wanted to be a little different."
    },
    {
      "id": "4619",
      "title": "Charisma",
      "body": "Using people's first name, looking at them in the eyes with a laser like stare.  Rhythm of speech."
    },
    {
      "id": "4620",
      "title": "Metaphors",
      "body": "Using a familiar term that people are familiar with but then highlighting the difference.  Its like the '.  For'."
    },
    {
      "id": "4621",
      "title": "Use Props",
      "body": "Use props."
    },
    {
      "id": "4622",
      "title": "Rule of three",
      "body": "Two is too few things, and four is too many to remember.  Every point should have three or less things.  Three is the magic number."
    },
    {
      "id": "4623",
      "title": "Complex Ideas",
      "body": "The more complex the idea, the more important to use rhetorical devices such as analogies and metaphors to facilitate understanding."
    },
    {
      "id": "4624",
      "title": "Hero",
      "body": "The heroes job is not necessarily to crush the bad guy, it is to make our lives better.  "
    },
    {
      "id": "4625",
      "title": "Roadmap",
      "body": "Tell the audience the three things that you are going to show them before you show them."
    },
    {
      "id": "4626",
      "title": "Bucket Method",
      "body": "Take any question you've ever been asked and put it into a bucket so you have common responses for categories of questions.  "
    },
    {
      "id": "4627",
      "title": "Software",
      "body": "Start with the customer experience and work backward to the technology.  "
    },
    {
      "id": "4628",
      "title": "Passion",
      "body": "Some entrepreneurs are afraid to express emotion about their dream but it is passion and emotion that will attract and motivate others."
    },
    {
      "id": "4629",
      "title": "Language",
      "body": "Should be simple, non technical, specific, short, emotional, descriptive.  Insecure manager and entrepreneurs create complexity to inflate their ego."
    },
    {
      "id": "4630",
      "title": "Perseverance",
      "body": "Separates successful entrepreneurs from the unsuccessful ones."
    },
    {
      "id": "4631",
      "title": "Anaphora",
      "body": "Repetition of the same words in consecutive sentences.  Ex  I have a dream'"
    },
    {
      "id": "4632",
      "title": "Narration",
      "body": "Present words in a narration, not a visual on-screen text."
    },
    {
      "id": "4633",
      "title": "Practice",
      "body": "Practice 1 hour for every minute you pitch.  Never practice alone.  Record yourself presenting and play it back to yourself."
    },
    {
      "id": "4634",
      "title": "Put Numbers in Context",
      "body": "People don't understand what 5GB or 3G is.  They do understand the concepts of 1,000 songs in your pocket, twice as fast, watch the difference.  Address things in context.  Show the difference side by side.  "
    },
    {
      "id": "4635",
      "title": "Simplification",
      "body": "Most important part of Apple's design process.  Keep slides simple.  If you can't explain something simply, you don't know it well enough.  "
    },
    {
      "id": "4636",
      "title": "Eye Contact",
      "body": "Memorize everything so you can stare into audience's eyes.  "
    },
    {
      "id": "4637",
      "title": "Common terms",
      "body": "It's like, more of what they love, twice as, half the, just one click, most, greenest, reinvents, fastest, what we've found in our research, why do you need this, who cares, quantum leap, one more thing, look back, extraordinary, thank you, it feels great, how thrilled I am,"
    },
    {
      "id": "4638",
      "title": "Pictures",
      "body": "It is better to present an explanation in words and pictures.  People remember 10 percent of oral presentations and about 65% when you add pictures."
    },
    {
      "id": "4639",
      "title": "Introduce Antagonist",
      "body": "Introduce an antagonist, an enemy, and a problem, in need of a solution.  "
    },
    {
      "id": "4640",
      "title": "Core Values",
      "body": "Individuals are inspired by core values and a sense of purpose."
    },
    {
      "id": "4641",
      "title": "Personal Passion Statement",
      "body": "In one sentence, tell your prospects why you are genuinely excited about working with them.  "
    },
    {
      "id": "4642",
      "title": "Twitter Like Headlines",
      "body": "Headlines you create that work so well that media will use them word for word.  Ex   World's thinnest notebook. Must be specific, memorable and can fit in a twitter post.  They need to use third grader English.  Ex   A thousand songs that can fit in your pocket.   Consistently repeat your headline."
    },
    {
      "id": "4643",
      "title": "Nine Elements of Great Presentation",
      "body": "Headline, passion statement, three key messages (and no more), metaphors and analogies, demonstrations, partners, customer endorsement, show and tell."
    },
    {
      "id": "4644",
      "title": "Evangelists",
      "body": "Driven by a messianic zeal to create new experiences."
    },
    {
      "id": "4645",
      "title": "Dress",
      "body": "Dress appropriately for the culture.  Dress like the leader you want to become, not the position you currently have."
    },
    {
      "id": "4646",
      "title": "Surprise",
      "body": "Don't let them expect a surprise every time."
    },
    {
      "id": "4647",
      "title": "Open Posture",
      "body": "Don't cross your arms or stand behind a lectern.  Start on stage but don't be afraid to roam around the audience.  "
    },
    {
      "id": "4648",
      "title": "Have Fun",
      "body": "Don't be afraid to entertain and mess with the audience.  Frame things that went wrong as if they were supposed to happen."
    },
    {
      "id": "4649",
      "title": "Bullet Points",
      "body": "Do not use."
    },
    {
      "id": "4650",
      "title": "Reading Slides",
      "body": "Do not do."
    },
    {
      "id": "4651",
      "title": "Three keys to great presentation",
      "body": "Customer wants to be informed, educated, and entertained."
    },
    {
      "id": "4652",
      "title": "Reality distortion field",
      "body": "An ability to convince anyone of practically anything."
    },
    {
      "id": "4653",
      "title": "Paper & Pen",
      "body": "Always sketch things out first."
    },
    {
      "id": "4654",
      "title": "Holy Shit Moment",
      "body": "Always plan for one moment that takes the audience by surprise and amazement.  Ex   Pulling macbook air out of an envelope.  Build up to the moment.  "
    }
  ]
}

