{
  "subject": "Pitching Your Business",
  "credit": "Pitching Your Business",
  "todos": [
    {
      "id": "4834",
      "title": "Practice",
      "body": "Steve Jobs practiced one hour for every 1 minute of his pitch.  He never rehearsed without an audience."
    },
    {
      "id": "4835",
      "title": "Nervous Ticks",
      "body": "Record a video of your pitch so you can see if you have any nervous ticks such as saying “ummm” between each sentence.  Nervous ticks can be removed through preparation and the confidence to slow down and pause between thoughts.    "
    },
    {
      "id": "4836",
      "title": "Professional Look",
      "body": "Make sure images are clear and have good resolution.  Your smallest text size should be the age of the oldest audience member divided by two.  "
    },
    {
      "id": "4837",
      "title": "Technology",
      "body": "Make sure ahead of your presentation that the technology is working.  Does venue have Wi-Fi, cable adapters, projector, etc?"
    },
    {
      "id": "4838",
      "title": "Fear of Missing Out",
      "body": "Make investors feel like they could be missing out.  Say things like  “We want you to lead this deal.  In the end, if you don’t want in, that’s okay, we’ve got people that can, but it would mean a lot if you were involved.”"
    },
    {
      "id": "4839",
      "title": "Six Signals to Give Audience",
      "body": "I will not waste your time, I know who you are, I am well organized, I know my subject, here is my most important point, I am finished by ending with a great story or last thought."
    },
    {
      "id": "4840",
      "title": "SSAME",
      "body": "Great wow statements include  Stories, Similes (“it’s like Uber but for bicycles”), Analogies (“we do for surfing what chairlifts do for skiing”), Metaphors (“we turn water into money”), or Examples.  "
    },
    {
      "id": "4841",
      "title": "Emphasize Your Commitment",
      "body": "Emphasize your skin in the game.  "
    },
    {
      "id": "4842",
      "title": "Common Slides",
      "body": "Cover, Wow Statement, Problem, Target Customers, Current Solutions, Breakthrough, Team, How the Product Works, Differentiation from Competition, How It Works for Customer, Traction, How It Works for Your Business, Milestones, Financials, Market Size, Barriers to Entry, Your Skin in Game, End Goal, Ask, and Contact Info.  "
    },
    {
      "id": "4843",
      "title": "Speaking Rate",
      "body": "Average person speaks between 120-140 words per minute.  When writing your presentation, plan for 130 words per minute (more if you tend to speak faster when presenting)."
    },
    {
      "id": "4844",
      "title": "Headline/Wow Statement",
      "body": "30 second statement that wows the listener.  Your wow statement is successful if it makes them say  “how do you do that” (Ex  “1,000 songs in your pocket, thinnest notebook in the world).  This is the statement that you want every newspaper in the U.S. to print as the headline.  "
    },
    {
      "id": "4845",
      "title": "Control the Conversation",
      "body": "You don’t have to give them everything they ask for.  Be respectful.  Remember, they want to see that you can take control of a situation or room and do what is right.  "
    },
    {
      "id": "4846",
      "title": "Conclude",
      "body": "You decide when Q&A is over.  Wrap it up with a closing statement.  "
    },
    {
      "id": "4847",
      "title": "Third grader test",
      "body": "Use simple language when pitching.  A third grader should understand every sentence in your presentation.  It’s okay to use complex terminology when you are asked technical questions."
    },
    {
      "id": "4848",
      "title": "Watch presentation videos from",
      "body": "Steve Jobs, Tony Robbins, Nathan Gold, Les Brown, Craig Valentine, Daniel Pink, Shane Koyczan, Tomonari Ishiguro, Eric Ryan, Richard Bandler, John Grindor."
    },
    {
      "id": "4849",
      "title": "Focus",
      "body": "Only present one product aimed at one target market at a time.  If asked whether it could be great for another vertical market, say  “there are lots of other markets we could apply this to, but we’ve got to fight this battle first.”"
    },
    {
      "id": "4850",
      "title": "* Credits",
      "body": "Nathan Gold.  Demo Coach."
    },
    {
      "id": "4851",
      "title": "Alignment",
      "body": "Make sure your passions are in alignment with your work.  People don’t care what you do until they know why you do it.   "
    },
    {
      "id": "4852",
      "title": "Upfront contract",
      "body": "If I can do A… will you do B…"
    },
    {
      "id": "4853",
      "title": "Compartmentalized",
      "body": "Each slide should address one and only one question.  Each slide should flow to the next."
    },
    {
      "id": "4854",
      "title": "Prizing",
      "body": "Don’t view money as a prize to be won.  That is taking a low status position.  You are not performing for investors.  You are the prize to be won.  Money should seek you out.  Money is nothing without companies into which it can be invested.  "
    },
    {
      "id": "4855",
      "title": "Responding Appropriately",
      "body": "Don’t respond too quickly (“railroading”).  Never be argumentative or embarrass your audience.  Handle objections, with “I feel what you are saying, I’ve felt the same way at times, what we’ve found is…”"
    },
    {
      "id": "4856",
      "title": "Power of 3",
      "body": "Don’t overwhelm your audience with busy slides.  Limit everything to groupings of three.  Only use three colors and font styles.  Each slide should have no more than three points, columns, rows, or images."
    },
    {
      "id": "4857",
      "title": "Be Honest",
      "body": "Don’t fake an answer, say you’ll find out and get back to them.  Don’t be afraid to take things offline if the conversation is getting pulled into a tangent.  "
    },
    {
      "id": "4858",
      "title": "Confidence",
      "body": "Be very confident.  Sell through your confident expressions. Make eye contact.  Hands to side when not presenting."
    },
    {
      "id": "4859",
      "title": "Advice, Not Capital",
      "body": "Ask for capital and you will get advice.  Ask for advice and you will get capital."
    },
    {
      "id": "4860",
      "title": "1.      DON’T BORE YOUR AUDIENCE",
      "body": ""
    },
    {
      "id": "4861",
      "title": "2.      PITCH DECK",
      "body": ""
    },
    {
      "id": "4862",
      "title": "3.      DON’T LOWER YOUR STATUS",
      "body": ""
    },
    {
      "id": "4863",
      "title": "4.      KNOW HOW TO CLOSE",
      "body": ""
    },
    {
      "id": "4864",
      "title": "5.      RESPONDING TO QUESTIONS",
      "body": ""
    },
    {
      "id": "4865",
      "title": "6.      PRACTICE AND PREPARE",
      "body": ""
    },
    {
      "id": "4866",
      "title": "7.      A CONFUSED MIND SAYS NO",
      "body": ""
    },
    {
      "id": "4867",
      "title": "8.      ADDITIONAL RESOURCES",
      "body": ""
    }
  ]
}

