{
  "subject": "Pitch Anything Checklist",
  "credit": "Pitch Anything Checklist",
  "todos": [
    {
      "id": "4655",
      "title": "Novel",
      "body": "It also wants things novel, if I have already solved this, don’t deal with it again, ignore it, its not novel or dangerous.  Filters out information that is not new or not dangerous.  "
    },
    {
      "id": "4656",
      "title": "Info",
      "body": "Information has no convincing power.  People can usually only tell things in the way they experienced it.  Your own story is not the selling story.  The selling story is the big idea.  “The world is changing”, “today, people are getting overwhelmed with…”,  “it used to be you could…”,  “it is going to affect every…” how is it high stakes, how does it fit in the world, “people who don’t adapt to this kind of change will…(lose careers, jobs)”why is it important, why is it important today, “but now…”, “without this you would never be able to see it”, “problem is there are a thousand young people that are going to adapt technology to overcome that…”, “are you guys???”,  solution “let me show you how this works…our tech is a …..”, “we 1….2…3…4…”, “nothing else can get you this close to…..”, “you can do this but you are not going to get…” competition/differentiation, “we protect our interest with these barriers to entry….” economics around it.  "
    },
    {
      "id": "4657",
      "title": "You Are The Prize If You Are",
      "body": "Honest, good product, good management, good economics, care about community, take business serious, motivated, determined, experienced."
    },
    {
      "id": "4658",
      "title": "Prepared Pitch",
      "body": "Gives you higher status.  No slides, no demo, just you face to face or over phone in a narrative format.  If you need to give someone information, send a fedex package, do not fly, walk, etc.   "
    },
    {
      "id": "4659",
      "title": "Neuro Economics",
      "body": "Economics, Neuro Science, Psychology"
    },
    {
      "id": "4660",
      "title": "Money is a Basic Commodity",
      "body": "You should not try to win it.  Money is the most basic thing, ATMs have it, banks have it, farmers have it.  You are the prize to be won.  Money should seek you out.  Money is nothing without companies to invest it into."
    },
    {
      "id": "4661",
      "title": "Take it Away",
      "body": "You have to make it new, elevate status, intrigue people, then take it away.  "
    },
    {
      "id": "4662",
      "title": "20 min",
      "body": "You have 20 min to get someone to make their decision.  After that you lose social status and people will not pay attention to you."
    },
    {
      "id": "4663",
      "title": "Consistency",
      "body": "Whatever you chose to do, be the best at it.  Don’t shift or mission drift.  Continue down the path you are on.  Just stick to it and all the suckers will leave.  Find beauty in whatever you are doing instead of jumping and starting cold."
    },
    {
      "id": "4664",
      "title": "Build Status",
      "body": "Wealth, Power, Celebrity.  You won’t have those so build local status.  "
    },
    {
      "id": "4665",
      "title": "Move Away Script (Put Up The Wall Right Away)",
      "body": "We have this…they are amazing…we are signing up customers like crazy…I barely had time to meet you (cancel the meeting atleast once because you are too busy)…if you asked to signup or invest I couldn’t allow you to do so because we don’t have the time..I’d have to rip up the check and give it back to you…I can’t take the order right now…I don’t know anything about you…we need to know what kind of customer you are, what your repurchase rates are, your success…we just want to work with people that are easy to deal with, meet our margins, and fun… I know you are probably a great guy…will you tell me about your business and tell me how you are as a customer…and let’s figure out if there is overlap…there is a good chance we could walk away without overlap and say hail fellow well met…"
    },
    {
      "id": "4666",
      "title": "Prizing",
      "body": "Time constraint, professional, prepared pitch."
    },
    {
      "id": "4667",
      "title": "Best Advice",
      "body": "Start Your Family"
    },
    {
      "id": "4668",
      "title": "Pitch v. Sell",
      "body": "Sell is transactional.  Pitching is when you get one shot.  "
    },
    {
      "id": "4669",
      "title": "Time Constraint",
      "body": "Pleasure to meet you today.  We don’t have a lot of time so let’s get started.  Don’t say…I want to be respectful of your time let’s get started.  I’m going to speak for 20 minutes and then give it over to you.  "
    },
    {
      "id": "4670",
      "title": "FOMO",
      "body": "People want what they can’t have.  Chase what moves away from them.  Only value what they pay for."
    },
    {
      "id": "4671",
      "title": "Learn to Tell Narratives",
      "body": "Oren Klaff dedicated himself to learning how to create the best narrative pitch in the world.  "
    },
    {
      "id": "4672",
      "title": "See a Threat",
      "body": "Navy Seals close the distance and shut down…example if pricing is a concern…close distance…call me a cab and we’ve got other customers ready to roll…"
    },
    {
      "id": "4673",
      "title": "Seal Fit",
      "body": "Mark Devine Academy"
    },
    {
      "id": "4674",
      "title": "Levers",
      "body": "Look for big levers to pull.  Babies are big levers for the human mind.  Look for levers to get around the natural defenses of the buyer or investor."
    },
    {
      "id": "4675",
      "title": "Narrative",
      "body": "Learn how to tell a sales story (not an experience or information story).  Do it about yourself, company, products, etc."
    },
    {
      "id": "4676",
      "title": "Thrown out of meetings",
      "body": "If you find they are not gonna give you what you need, throw yourself out."
    },
    {
      "id": "4677",
      "title": "My Passion",
      "body": "Helping people grow their business."
    },
    {
      "id": "4678",
      "title": "Social Value",
      "body": "Has to do from high social status.  Looks at social values, is it above or below me (cop above, high school student below).  Don’t say thank you for allowing me to fly across country to pitch for you to five minutes.  Neediness demonstrates lower social value and people will ignore you."
    },
    {
      "id": "4679",
      "title": "Professional",
      "body": "Give them the sense that you are in the hands of a professional.  Narrative, agenda, time constraint, and you understand the process of how they make decisions."
    },
    {
      "id": "4680",
      "title": "Dance Off",
      "body": "Give incredible narrative for 20 min and then ask them to pitch you.  They will be un-prepared, the will be wonky and you will put them in the low status position and they will want to regain it.  You’ve created the imbalance.  Let them come up a little by having regular conversation.  “Guys listen, what is clear here is we are the… I need to undserstand where you guys are…”  If you want this, just tell me and we will help you connect to the right people…if you want the best in this…let us know and we will get you hooked up."
    },
    {
      "id": "4681",
      "title": "Eradicate Neediness",
      "body": "Find ways to establish yourself as the prize.  Zuckerburg went to Sequioa capital in flip flops and a bathrobe.  Don’t dress.  I’m limited in time…we are very choosy and are trying to limit our customers…here’s what we have…tell me what you have…is there overlap…we have another 20 meetings to go to."
    },
    {
      "id": "4682",
      "title": "Crocodile Mode",
      "body": "Everything comes in the crocodile brain.  Eat, Kill, or Mate.  Wants fast, quick information, high contrast, summaries, binary, safe, not safe, fast, visual, narrative format.  If you don’t provide it in that format it ignores.  "
    },
    {
      "id": "4683",
      "title": "Prizing",
      "body": "Don’t view money as a prize to be won.  That is taking a low status position.  You are not performing for them."
    },
    {
      "id": "4684",
      "title": "Emotions",
      "body": "Don’t show high emotions during pitch.  You don’t need to be motivated.  "
    },
    {
      "id": "4685",
      "title": "Move Away",
      "body": "Don’t make it clear that they can invest in you if they want.  Don’t over demo or ever apologize.  Be mysterious.  Don’t focus on the product, focus on your honesty, good product, good management, good economics, care about community, take business serious, motivated, determined, experienced."
    },
    {
      "id": "4686",
      "title": "Attitude",
      "body": "Does not have to be mean.  Mirror the environment you are in. If they are stiff you can be stiff back.  "
    },
    {
      "id": "4687",
      "title": "Client Control",
      "body": "Controlling conversation. Don’t negotiate.  This is a great project, you are a great person, but we can’t do this.  Once you get a reputation of bending the rules, it never stops.  Higher stakes, the more you have to be willing to walk away."
    },
    {
      "id": "4688",
      "title": "Be the Best",
      "body": "By The Work One Knows the Workman"
    },
    {
      "id": "4689",
      "title": "Investment Firms",
      "body": "Built to drive a stringent process.  Don’t let them invest too early, say woo, we are not ready to let you invest, we need to qualify you as an investor and check into our other options.  "
    },
    {
      "id": "4690",
      "title": "You Are The Prize",
      "body": "Big Venture Capital firms cannot maintain the consistency and the risks that entrepreneurs can do.  They have $500 million dollars and still cannot do what entrepreneurs do."
    },
    {
      "id": "4691",
      "title": "Pitch Structure",
      "body": "Big idea, how things are changing, how we sit in that change, what problem we are solving, our solution, how it works, value proposition, ROI, Proforma or how we are going to spend the money, what happens in future, team."
    },
    {
      "id": "4692",
      "title": "Pitch Outreach",
      "body": "Better your funnel is, the less needy you are.  Landing page and pitch deck are super important.  "
    },
    {
      "id": "4693",
      "title": "Yelling Match",
      "body": "Are okay.  "
    },
    {
      "id": "4694",
      "title": "We Are In",
      "body": "“That’s not good enough…there is still so much hard work to do, I want to hear you love this, we can’t think of anything better, this is going to be great…if not we are destined for failure”"
    }
  ]
}

