{
  "subject": "Power of Forgetting",
  "credit": "Power of Forgetting",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "4892",
      "title": "Anagram",
      "body": "Word or phrase formed by rearranging another word or phrase."
    },
    {
      "id": "4893",
      "title": "Perceptual Learning",
      "body": "Using your gut instinct to solve problems (third eye)."
    },
    {
      "id": "4894",
      "title": "Scaffolding",
      "body": "Pulling aspects from different experiences to solve problems."
    },
    {
      "id": "4895",
      "title": "Distractions",
      "body": "It takes people an average of 25 minutes to return to a task once interrupted.  "
    },
    {
      "id": "4896",
      "title": "Focus v. Concentration",
      "body": "Focus is the ability to stay in the moment; concentration is the ability to look at the big picture in front of you.  Both can be damaged by distractions.  Self confidence is one of the greatest tools for focusing.  "
    },
    {
      "id": "4897",
      "title": "Six Skills for Working Faster and Smarter",
      "body": "Focus and concentration, increasing mental capacity, thinking outside box, organization, and forgetting."
    },
    {
      "id": "4898",
      "title": "Think Outside the Box",
      "body": "Break the rules.  "
    },
    {
      "id": "4899",
      "title": "Art of Making Yourself Memorable",
      "body": "As knowledge increases, creativity tapers off.  People do not remember the normal, they like to remembers the unexpected.  "
    },
    {
      "id": "4900",
      "title": "Don't Be Detail Oriented",
      "body": "Your brain will remember much more if you don't try to grab every single detail."
    },
    {
      "id": "4901",
      "title": "Forgetting",
      "body": "Your brain must be able to distinguish between high quality and low quality.  Ditch and forget the unimportant.  Be selective.  "
    },
    {
      "id": "4902",
      "title": "Absent Abstract",
      "body": "You cannot remember anything if it is abstract to you.  You must associate it with something you already know or remember.  Bringing a sense of silliness or absurdness helps memory.   All memory must have some form of mental imagery.  "
    },
    {
      "id": "4903",
      "title": "Pattern Retention",
      "body": "When you see patterns reoccurring, store that information as valuable and discard the rest.  "
    },
    {
      "id": "4904",
      "title": "Brain Exercise",
      "body": "When we exercise our brain we stimulate new neurons.  "
    },
    {
      "id": "4905",
      "title": "Internal v. External Distractor",
      "body": "We distract ourselves just as much as other people, internet, emails, social media, distract us.  Beware of the monkey mind."
    },
    {
      "id": "4906",
      "title": "Habits",
      "body": "Things we repeatedly do everyday.  Most commercial products are successful because they leverage people's existing habits.  Force yourself to look for patterns in people.  Noticing the way people react will teach you how to engage with them to reach your goals."
    },
    {
      "id": "4907",
      "title": "Pattern",
      "body": "Theme of recurring events.  Identifying patterns is what helps us to predict the future and consolidate information to free up more space for learning.  Patterns can only be found within context."
    },
    {
      "id": "4908",
      "title": "Real World Experiences",
      "body": "The person who can cull from a myriad of real world experiences in life is often the one who will find a more precise answer.  "
    },
    {
      "id": "4909",
      "title": "Relearn",
      "body": "The illiterate of the 21st century will be those that cannot learn, unlearn, and relearn (Alan Toffler)."
    },
    {
      "id": "4910",
      "title": "Technology",
      "body": "Technologies like Google and calculators can cause our brains to become very lazy in certain areas.  Strive to be able to process things internally, not by looking them up.  "
    },
    {
      "id": "4911",
      "title": "Making it Stick",
      "body": "Simplicity, unexpectedness, concreteness, emotions, and storytelling."
    },
    {
      "id": "4912",
      "title": "Stroop Test",
      "body": "Say the following colors ' a. Black, b. Gray, c. Gray, d. Black.  If you say black instead of Gray for 'c' you are good at focusing."
    },
    {
      "id": "4913",
      "title": "Remembering Names",
      "body": "Requires original awareness, ask them to repeat it, ask them to spell it, associate it with something physically outstanding related to them and silly.  "
    },
    {
      "id": "4914",
      "title": "Stories",
      "body": "People remember stories."
    },
    {
      "id": "4915",
      "title": "Focus",
      "body": "Our ability to focus is located in the prefrontal cortex of the brain which is the mot delicate, impatient, and energy hungry part of the brain.  "
    },
    {
      "id": "4916",
      "title": "Power of Forgetting",
      "body": "Only when we forget can we learn more.  "
    },
    {
      "id": "4917",
      "title": "Retroactive Inhibition",
      "body": "Not allowing information to soak in.  Occurs when you learn something new and then quickly shift to another activity."
    },
    {
      "id": "4918",
      "title": "Making Daily Habits",
      "body": "Make what you want to achieve and how you should achieve it a habit.  For example, if rule breaking is something that is important to creativity, make rule breaking a daily habit.  "
    },
    {
      "id": "4919",
      "title": "Memory Palace",
      "body": "Imaginary place where you can go to recall information."
    },
    {
      "id": "4920",
      "title": "Multi-Tasking",
      "body": "Humans cannot focus and be attentive on more than one thing at a time.  The only way we can do more than one task at a time is if we are focusing on one task and are not really paying attention to the other task or if our mind goes back and forth real quickly.  Focus and attention must be done sequentially and cannot be done in parallel."
    },
    {
      "id": "4921",
      "title": "Unconventional Thinking",
      "body": "Create a culture of unconventional thinking."
    },
    {
      "id": "4922",
      "title": "Chunk Thoughts",
      "body": "Chunk thoughts and associate them with a single word."
    },
    {
      "id": "4923",
      "title": "Wasted Time",
      "body": "Average worker wastes three hours per eight-hour workday because or lack of focus, interruptions, internet, socializing, emails, etc."
    },
    {
      "id": "4924",
      "title": "Emails",
      "body": "Average person looks at email 36 times an hour.  It takes more than a minute to return to a task once looking at an email.  Don't let your e-mail pop-up and only answer emails twice a day.  "
    },
    {
      "id": "4925",
      "title": "Original Awareness",
      "body": "Anything which you are originally aware of cannot be forgotten.  Original awareness takes focus and deliberate intention.  You must also manufacture associations that have a significant meaning to you.  "
    },
    {
      "id": "4926",
      "title": "Memorable Impression",
      "body": "A lie can get halfway around the world before the truth can even get its boots on (Mark Twain).  People love urban legends, conspiracy theories, and bogus scare tactics.  "
    },
    {
      "id": "4927",
      "title": "Law of Compounding Errors",
      "body": "A huge error tends to be greater than the sum of all the small errors that caused it.  "
    }
  ]
}

