{
  "subject": "Power of Habit",
  "credit": "Power of Habit",
  "todos": [
    {
      "id": "4928",
      "title": "Accomplishment",
      "body": "The foaming and tingling effect of toothpaste doesn’t clean your teeth better but makes people feel their teeth is clean.  Sometimes you have to add something to product or service to make them fell a sense of accomplishment."
    },
    {
      "id": "4929",
      "title": "Pavlovian Marketing",
      "body": "Questioning customers to predict future actions."
    },
    {
      "id": "4930",
      "title": "Faith",
      "body": "You must have faith that working on changing habits will get you to where you want to be.  It takes belief in yourself to stick with a good habit."
    },
    {
      "id": "4931",
      "title": "Grit/Willpower",
      "body": "Working strenuously towards challenges.  Key indicator of success.  Will power is like a muscle.  The more you have to restrain yourself the harder it is to do so immediately after.  That said, you can strengthen your willpower so that the next go around you are stronger."
    },
    {
      "id": "4932",
      "title": "Word Trick",
      "body": "When experimenting with your habits, write don a couple words describing how you are feeling, emotions, random thoughts, reflections to help you recall what you were thinking at the moment."
    },
    {
      "id": "4933",
      "title": "Craving",
      "body": "What makes rewards and cues work.  People start to crave the rewards and they brains will light up when they receive a cue but well before complete the routine and receive the reward.  Cue and reward aren’t enough, its only when your brain starts craving the reward that a habit will form."
    },
    {
      "id": "4934",
      "title": "Habits",
      "body": "Way of brain saving effort."
    },
    {
      "id": "4935",
      "title": "Rosa Parks",
      "body": "Was not the first person to be kicked off the bus but had the biggest impact because she was the most socially connected in the community and was very well liked.  People have no problem ignoring strangers injuries but not their friends."
    },
    {
      "id": "4936",
      "title": "Walmart Icecream",
      "body": "Walmart served ice cream in their stores not because it had anything to do with their merchandise but because people’s craving for ice cream and the immediate satisfaction they received from the sugar made them come back."
    },
    {
      "id": "4937",
      "title": "Variability",
      "body": "Variability of reward is important."
    },
    {
      "id": "4938",
      "title": "Get Physical",
      "body": "Use alternate physical actions to help replace bad habits.  Don’t just try to fight bad habits with your mind (ex pushups).  "
    },
    {
      "id": "4939",
      "title": "Fighting Habits",
      "body": "Unless you deliberately fight a habit, the routine will unfold as after the cue is presented.  Habits never disappear.  "
    },
    {
      "id": "4940",
      "title": "Top Companies",
      "body": "Understand and study the neurology and psychology of habits."
    },
    {
      "id": "4941",
      "title": "Near Misses",
      "body": "To pathological people, near misses look like wins."
    },
    {
      "id": "4942",
      "title": "Delayed Gratification",
      "body": "Those who can delay gratification end up performing the best."
    },
    {
      "id": "4943",
      "title": "Security and Safety",
      "body": "Their should ultimately be one person that has the singular goal and ultimate authority to control safety and security.  "
    },
    {
      "id": "4944",
      "title": "Standardization",
      "body": "The reason every McDonalds looks the same is because it creates a consistent cue to trigger eating there.  Even the foods are engineered to deliver immediate results the minute they hit your tongue.  "
    },
    {
      "id": "4945",
      "title": "Data points",
      "body": "Target gives each customer an ID.  Anytime the customer uses a target credit card, rewards card, coupon, survey, calls in, or purchases anything online target adds that information to their ID."
    },
    {
      "id": "4946",
      "title": "Willpower Manual",
      "body": "Some companies build instructions for what to do in the event that your willpower is low (ex a customer screaming at you or a bad day).  "
    },
    {
      "id": "4947",
      "title": "Rewards",
      "body": "Should be like a mini celebration."
    },
    {
      "id": "4948",
      "title": "Communication Habits",
      "body": "Set habits that require people to communicate more.  "
    },
    {
      "id": "4949",
      "title": "Familiarity",
      "body": "Products that are familiar are more likely to become habits for people.  If you can’t make it familiar, sandwich it between familiar things or dress it up in familiar things."
    },
    {
      "id": "4950",
      "title": "Habit Changes",
      "body": "Peoples habits are more likely to change when they go through a major life event such as moving, divorce, marriage, baby, etc."
    },
    {
      "id": "4951",
      "title": "Kindness",
      "body": "People that are treated kindly will have more willpower.  "
    },
    {
      "id": "4952",
      "title": "Strength of Weak Ties/Peer Pressure",
      "body": "People are more likely to help you if they have a connection to you.  Join lots of organizations.  "
    },
    {
      "id": "4953",
      "title": "Alliances",
      "body": "Partnering with the right people helps build good or bad habits.  "
    },
    {
      "id": "4954",
      "title": "Crisis",
      "body": "Never let a serious crisis go to waste.  These are the times where you can best learn about and improve your company."
    },
    {
      "id": "4955",
      "title": "Can’t Change a Habit",
      "body": "Must keep the old cue and deliver the old reward but setup a new routine."
    },
    {
      "id": "4956",
      "title": "Prepare for Anything",
      "body": "Michael Phelps goggles flooded in an Olympic gold race but he ended up setting a world record.  He had trained in the dark for this event."
    },
    {
      "id": "4957",
      "title": "Habitual Cue Categories",
      "body": "Location, time, emotional state, other people, an immediately preceding action.  "
    },
    {
      "id": "4958",
      "title": "LATTE",
      "body": "Listen to customer, acknowledge their complaint, take action by solving problem, thank them, explain why the problem occurred."
    },
    {
      "id": "4959",
      "title": "Simple Habits",
      "body": "Keep habits simple."
    },
    {
      "id": "4960",
      "title": "Nichomachean Ethics",
      "body": "It is by nature that some people are good, other that it is by habit, and others it is by instruction"
    },
    {
      "id": "4961",
      "title": "Making Bed Every Morning",
      "body": "Increases productivity."
    },
    {
      "id": "4962",
      "title": "Changing Habits",
      "body": "Identify cue, routine, and reward, experiment by changing each of them.  "
    },
    {
      "id": "4963",
      "title": "Changing Others Habits",
      "body": "Help provide them a reward for a good activity by thanking them for doing it, stoking their pride or ego.  You can’t force people to change but you can help them focus on better habits."
    },
    {
      "id": "4964",
      "title": "Small Wins",
      "body": "Have enormous power to influence widespread changes."
    },
    {
      "id": "4965",
      "title": "Keystone Habit",
      "body": "Habit that when changed will have a rippling effect on other habits.  Alcoa focused on safety and it ended up improving profitability.  Safety was a habit that everyone agreed upon."
    },
    {
      "id": "4966",
      "title": "Eating Dinner Together",
      "body": "Good for kids."
    },
    {
      "id": "4967",
      "title": "Habit Psychology",
      "body": "Find a simple and obvious cue that relates to your product, clearly define the rewards of using your product."
    },
    {
      "id": "4968",
      "title": "Successful Dieters",
      "body": "Eat breakfast and envision a specific reward for sticking with diet."
    },
    {
      "id": "4969",
      "title": "Champions",
      "body": "Do ordinary things but do them without thinking and at a speed that is too fast for the other team to react."
    },
    {
      "id": "4970",
      "title": "AA",
      "body": "Delivers the escapism, companionship, and distraction of a Friday night bender without the alcohol."
    },
    {
      "id": "4971",
      "title": "Solving Problem",
      "body": "Curing someone’s problem is not enough if they don’t feel rewarded after it is cured."
    },
    {
      "id": "4972",
      "title": "Habit Loop",
      "body": "Cue/trigger, routine, reward, investment."
    },
    {
      "id": "4973",
      "title": "Pepsodent",
      "body": "Created a cue by telling everyone that everytime the feel film on their teeth they should brush with pepsodent."
    },
    {
      "id": "4974",
      "title": "Chunking",
      "body": "Brain converting a sequence of actions into an automatic routine.  Chunking is how habits form."
    },
    {
      "id": "4975",
      "title": "Belief in God",
      "body": "Best thing to help change habits.  People that believe a higher power has entered their life are less likely to relapse into bad habits."
    },
    {
      "id": "4976",
      "title": "Febreeze",
      "body": "At first they sold there product as a way to clear bad smells, the problem was that people can’t smell their own bad smells so they changed they added fragrance to the product and marketed it as a way to put the finishing touch on a clean room.  "
    },
    {
      "id": "4977",
      "title": "Awareness Training",
      "body": "Asking patients to describe what triggers their habitual behavior."
    },
    {
      "id": "4978",
      "title": "Whys",
      "body": "Ask a million whys to get to the heart of why people establish certain habits."
    },
    {
      "id": "4979",
      "title": "Repetition",
      "body": "As we experience the same things over and over our brain has to think less and can conserve energy."
    },
    {
      "id": "4980",
      "title": "Voluntary Exclusion Program",
      "body": "Anyone could be put on a list to exclude themselves from the program."
    },
    {
      "id": "4981",
      "title": "Iraq Foodtruck",
      "body": "American general noticed a pattern of riots in a town square being due to the length of time people congregated.  By removing the food trucks from the square people stuck around less and there were less problems."
    },
    {
      "id": "4982",
      "title": "But only if…",
      "body": "A lot of powerfully advertising campaigns say “You will have _______ , but only if you do this every day.”  It creates habits.  "
    }
  ]
}

