{
  "subject": "Predictable Revenue Sales Checklist",
  "credit": "Predictable Revenue Sales Checklist",
  "todos": [
    {
      "id": "5061",
      "title": "Keep it Simple",
      "body": "Stupid"
    },
    {
      "id": "5062",
      "title": "Awareness",
      "body": "Prospect discovers the company."
    },
    {
      "id": "5063",
      "title": "Large Organization Sales Teams",
      "body": "Marketing intern, inside sales development to qualify inbound leads, inside sales development to do outbound prospecting, inside sales closing for SMB, inside sales closing for small field deals, field sales closing for mid-market accounts, field sales closing for enterprise accounts."
    },
    {
      "id": "5064",
      "title": "Inquiry",
      "body": "Anonymous lead becomes known by company through registering with a name and email or contacting company."
    },
    {
      "id": "5065",
      "title": "CAN-SPAM Compliance",
      "body": "You can send unsolicited emails to a newly acquired marketing list.  If the emails are not opt-in you must follow the CAN-SPAM anti-spam act which says that you are allow to send unsolicited emails to businesses if the subject header is not misleading, you have a valid physical address in your email, you include a way to opt-out from future messages.  For more information, visit FTC."
    },
    {
      "id": "5066",
      "title": "Websites",
      "body": "www.predictablerevenue.com, "
    },
    {
      "id": "5067",
      "title": "Lead Nurturing",
      "body": "When prospective buyer makes an inquiry, fire off a series of automatic follow up emails."
    },
    {
      "id": "5068",
      "title": "Sales Cycle Length",
      "body": "When opportunity was created to when it closed."
    },
    {
      "id": "5069",
      "title": "11 minutes",
      "body": "Wait 11 minutes after an action to fire off an email."
    },
    {
      "id": "5070",
      "title": "Best Practices for Generating New Leads",
      "body": "Trial and error, A/B testing, marketing through education, patience in building word of mouth, cold emailing, partner ecosystem, PR."
    },
    {
      "id": "5071",
      "title": "Prospecting Cycle Length",
      "body": "Time when prospect inquires from a campaign to when the qualified opportunity is created.  On average 2-4 weeks."
    },
    {
      "id": "5072",
      "title": "Good Salespeople Should Not Prospect",
      "body": "They are bad at prospecting."
    },
    {
      "id": "5073",
      "title": "Do fewer things better",
      "body": "There are infinite ways to get leads.  Pick three or four good ones and do them really good."
    },
    {
      "id": "5074",
      "title": "Spears",
      "body": "Targeted outbound efforts going after specific individuals or organizations. "
    },
    {
      "id": "5075",
      "title": "Seeds",
      "body": "Take time to develop but are unbeatable in conversion and close rates.  Include developing happy customers, branding, organic internet search/SEO, PR, user groups, broad social media campaigns, content publishing, education, thought leadership, etc."
    },
    {
      "id": "5076",
      "title": "Call Best Practices",
      "body": "Start with “Am I calling you at a bad time”, ask prospect about their business and show that you authentically care, probe for prospects needs, “If you were me how would you approach your organization, position solutions (both free solutions, priced solutions, and other people or competitors solutions), handle objections, decide next actions."
    },
    {
      "id": "5077",
      "title": "Small Campaigns",
      "body": "Small campaigns of 50-100 are much more effective than large blasts."
    },
    {
      "id": "5078",
      "title": "Prospecting",
      "body": "Should be done by a dedicated prospecting role."
    },
    {
      "id": "5079",
      "title": "Sales Training",
      "body": "Should also include general business topics."
    },
    {
      "id": "5080",
      "title": "Best Email Practices",
      "body": "Short and sweet emails will usually get a 7-10% response.  Text based (not-html), simpl, offer credibility, ask one question.  Take into consideration a 20-30% bounce rate.  Make sure to clean bad emails to insure email integrity.  "
    },
    {
      "id": "5081",
      "title": "Modern Sales Best Practices",
      "body": "Separate sales responsibilities, don’t push the sale, qualify the buyer, make sure they are committed to buying and are willing to act quid pro quo, measure results not activity, research targets, build trust and integrity, short and sweet communication, repeatable sales system."
    },
    {
      "id": "5082",
      "title": "Three Types of Leads",
      "body": "Seeds, nets, spears."
    },
    {
      "id": "5083",
      "title": "Lead Scoring",
      "body": "See lead scoring checklists."
    },
    {
      "id": "5084",
      "title": "Split Up Sales Procss",
      "body": "Salespeople have a hard time focus because most have ADD so separate their functions and make their metrics clear."
    },
    {
      "id": "5085",
      "title": "Pleasantly Persistent",
      "body": "Sales is still about being as aggressive as ever but it shouldn’t come off as push or all about money.  It should come of as building a relationship and adding value to client.  "
    },
    {
      "id": "5086",
      "title": "Client Stages",
      "body": "Prospect, lead, opportunity, client, champion/detractor."
    },
    {
      "id": "5087",
      "title": "Internal Champions",
      "body": "People in the buyer’s organization that don’t make the decision but will be affected by the purchase and will influence the ultimate decision maker.  Win these people first.  "
    },
    {
      "id": "5088",
      "title": "List Sources",
      "body": "One Source (Fortune 5000), InfoUSA (SMB), Jigsaw, Hoovers, InsideView, DataSalad, ZoomInfo."
    },
    {
      "id": "5089",
      "title": "Push v. Pull",
      "body": "Old sales used to focus on ABC, always be closing and was very pushy.  New sales focuses on creating a positive experience by attracting or pulling the audience to your product through good service, word of mouth, self expression, education, challenging customer, etc."
    },
    {
      "id": "5090",
      "title": "Farmer",
      "body": "Nurtures leads as they come in from long-term developed marketing channels."
    },
    {
      "id": "5091",
      "title": "Most Important Metrics in Lead Generation",
      "body": "New leads, qualified opportunities, conversion rate from leads to opportunities, total bookings or revenue (by “New Business”, “Add-On Business”, “Renewal Business”), win rates (percent of pipeline resulted in winning deals), and Net Promoter Score."
    },
    {
      "id": "5092",
      "title": "Prospect",
      "body": "Names of people or organizations you are marketing to, in which people have not responded yet."
    },
    {
      "id": "5093",
      "title": "Best Practices for Lead Nurturing",
      "body": "Make it valuable to them, make it bite-sized, match your content to buyer’s profile, match your content to buying stages, get the timing right. "
    },
    {
      "id": "5094",
      "title": "Best Salespeople",
      "body": "Listen more than talk, problem solvers, understand customers industry, business, needs, and career advancement path, believe strongly in product and company, demonstrate unquestionable integrity, get things done in their own company, are more like consultants than salespeople."
    },
    {
      "id": "5095",
      "title": "Fast Track",
      "body": "Lead that inquire and have 65+ points are contacted by Inside Sales reps immediately."
    },
    {
      "id": "5096",
      "title": "Red Flags for Customer Profile",
      "body": "Just installed a system, already have an agency or in-house person, they churn through lots of agencies or products, know it alls, geography, don’t have a budget, bad industry, this area is totally new to them.  "
    },
    {
      "id": "5097",
      "title": "Predicting Sales",
      "body": "It takes about 12 months of sales data and results to be able to predict the economic value added from hiring an additional salesperson."
    },
    {
      "id": "5098",
      "title": "Consistent Terminology",
      "body": "It is important to have consistent definitions and terminology in your organization to prevent errors in ambiguity."
    },
    {
      "id": "5099",
      "title": "Four Core Sales Functions",
      "body": "Inbound Lead Qualification, Outbound Prospecting, Account Executives or Sales, Account Management/Customer Success."
    },
    {
      "id": "5100",
      "title": "Building Champions",
      "body": "If the prospect isn’t ready to sell, turn them into champions that will help you find other business.  "
    },
    {
      "id": "5101",
      "title": "Two Types of Lead Generators",
      "body": "Hunter and Farmer."
    },
    {
      "id": "5102",
      "title": "AAA",
      "body": "Going into a call the salesperson should try to get the answers they want to learn, the attitudes they wish the prospect to feel, and the actions that should occur after the call.  This applies to sales meetings and emails as well. "
    },
    {
      "id": "5103",
      "title": "Hunter",
      "body": "Goes out and targets people to find leads.  "
    },
    {
      "id": "5104",
      "title": "Pick a Niche and Get Rich",
      "body": "Focus your message and audience."
    },
    {
      "id": "5105",
      "title": "Bottleneck in Prospecting",
      "body": "Finding the decision maker.   "
    },
    {
      "id": "5106",
      "title": "Commitment to Process",
      "body": "Everyone including the CEO must be committed to the process. "
    },
    {
      "id": "5107",
      "title": "Day in The Life",
      "body": "Download template from www.predictablerevenue.com/templates"
    },
    {
      "id": "5108",
      "title": "Adjectives",
      "body": "Don’t use overly exaggerated adjectives when selling (ex  good instead of great).  This will make it seem less cheesy.  "
    },
    {
      "id": "5109",
      "title": "Quid Pro Quo",
      "body": "Don’t be too desperate or needy to give things away.  If they ask for pricing or proposal give them a reason why they should do something before that happens.  People who rush too quickly to a sale aren’t usually as serious.  Get them to do something for you for everything you do for them.  "
    },
    {
      "id": "5110",
      "title": "Quick Qualification System (BANFT)",
      "body": "Do they have budget, authority to decide, need, fit, and timing."
    },
    {
      "id": "5111",
      "title": "21-day follow up",
      "body": "Day 1, evaluate whether they are over 65 points, Day 2, call or send first email, Day 5, invitation to receive more content, Day 9, call, Day 16, Email, Day 21, recycle.  If the prospect doesn’t engage, send “stay in touch” emails."
    },
    {
      "id": "5112",
      "title": "Salesperson Goal Examples",
      "body": "daily training, configure CRM, meet with other sales people, add accounts, learn how to de-duplicate accounts, send mass outbound emails to 20-50 contacts, practice logging and responding to emails, draft a dashboard, learn about client’s business, learn a new business technique, study handbook, monitor customer profile, meet with mentor, listen in a demo or sales call, create cheat sheet, role play sales call or email, run a dead opportunities campaign. "
    },
    {
      "id": "5113",
      "title": "Visuals",
      "body": "Create customer and salespeople visuals about the selling/buying process."
    },
    {
      "id": "5114",
      "title": "Face-to-Face Sales",
      "body": "Companies selling products worth less than $100,000 - $250,000 should not put “feet on the street” to drive growth.  In these organizations salespeople should not cause growth but should fulfill growth."
    },
    {
      "id": "5115",
      "title": "Account Status Stages",
      "body": "Cold (no activity), working (determining whether there is an opportunity), active opportunity, check back quarterly, dead opportunity, current client, bad fit, duplicate account. "
    },
    {
      "id": "5116",
      "title": "Customer Profile Criteria",
      "body": "Co size, industry, sales model, how much they spend on…, financial status, ad agency in place, values, people, in-house person, current system, revenue."
    },
    {
      "id": "5117",
      "title": "Nets",
      "body": "Classic marketing programs in which you cast a large net and see what you get.  Includes mass email marketing, conferences, advertising, internet marketing, etc."
    },
    {
      "id": "5118",
      "title": "Six Responibilities of Sales Manager",
      "body": "Choose people carefully, set expectations and vision, remove obstacles, inspire people, work for your people, improve it for next time.  "
    },
    {
      "id": "5119",
      "title": "Recommended Books",
      "body": "CEO Flow, "
    },
    {
      "id": "5120",
      "title": "Prioritize",
      "body": "Care about determining whether your product is a good fit for the client and how you can help them improve their process, do not focus on the close.  "
    },
    {
      "id": "5121",
      "title": "Cold Calling",
      "body": "Calling someone who doesn’t know you and isn’t expecting your call."
    },
    {
      "id": "5122",
      "title": "Tips for a First Call",
      "body": "Call low before a C-level conversation, be blunt, keep asking questions, schedule over the phone and not in email."
    },
    {
      "id": "5123",
      "title": "Stay in Touch Campaigns",
      "body": "Builds the relationship when a lead is not yet ripe.  Sends small pieces of content over time to build the brand without being pushy.  "
    },
    {
      "id": "5124",
      "title": "Aesthetics & Clean Design",
      "body": "Better design and an uncluttered environment will encourage others to use that system.  "
    },
    {
      "id": "5125",
      "title": "Best Time to Send Email",
      "body": "Before 9 am or after 5 pm.  Avoid Mondays and Fridays (Sundays are okay).  "
    },
    {
      "id": "5126",
      "title": "Nine Principles of Sales Machine",
      "body": "Be patient, experiment, everything must be repeatable and scalable, ues a CRM, not excel, sketch out your process, make it visually clear for everyone (customers and salespeople), focus on results rather than activity (scorecards should have both activity and results), track fewer and more important metrics, pay attention to when the baton is being passed (80% of issues happen here), take baby steps."
    },
    {
      "id": "5127",
      "title": "Marketing Stages",
      "body": "Awareness, inquiry, prospect, and lead.  "
    },
    {
      "id": "5128",
      "title": "Clients/Customers",
      "body": "An opportunity that starts giving you money."
    },
    {
      "id": "5129",
      "title": "Passing Baton",
      "body": "A qualified lead be passed off to Sales/AE when high lead score, fit customer profile, speaking to someone with power or influence, clear interest in next steps.  "
    },
    {
      "id": "5130",
      "title": "Leads",
      "body": "A prospect that has responded positively in some way to show interest in what you have to offer. "
    },
    {
      "id": "5131",
      "title": "Opportunities",
      "body": "A lead that has been qualified through email or phone and meets your set of qualification criteria (AKA oppty)."
    },
    {
      "id": "5132",
      "title": "Champion",
      "body": "A client that has referred you business, offered testimonials or actively supported you in some way (AKA promoter).  "
    },
    {
      "id": "5133",
      "title": "Detractor",
      "body": "A client that has had a negative experience with your organization or product and would speak negatively when asked about you."
    }
  ]
}

