{
  "subject": "Pre-Sale Strategy Checklist",
  "credit": "Pre-Sale Strategy Checklist",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "5134",
      "title": "Status indicators",
      "body": "Something to sweeten the deal. Give your pre-order customers a status indicator, if you can. A status indicator shouldn't give people the idea that customers who pre-ordered the product are better than customers who didn't pre-order. Instead, it should let people who pre-ordered know that you appreciate their support so you want to reward them in some small way for it.  Limited edition tshirt, webinar, etc."
    },
    {
      "id": "5135",
      "title": "Crowdfunding for Sales and Investment",
      "body": "Setup a crowdfunding campaign for users to purchase ScoutSheet but also get an investment share in the company.  There are a couple different websites that you can look at for crowd funding.  Some of the most prominent are RocketHub.com, KickStarter.com, IndieGoGo.com.  "
    },
    {
      "id": "5136",
      "title": "Webinar",
      "body": "Presell your product on a webinar before finishing it."
    },
    {
      "id": "5137",
      "title": "Early Investor Narrative",
      "body": "Narrative you tell your initial customers when they'll be the first to use your product?'?because of this, they'll get more value from your product as compared to someone who signs up later."
    },
    {
      "id": "5138",
      "title": "Live Webinar Funnel",
      "body": "More involved, live presentation, drum up interest to get enough people, takes work.  Social media promotions/opt-in webinar signup, pain point education sequence, webinar pitch (promote upcoming webinar), host live webinar that pitches pre-sell at end, private deal for those who stick around, keep people reminded on how much time is left in pre-sell, move over to release list if they don't by, send survey to those who signup to understand expectations."
    },
    {
      "id": "5139",
      "title": "When You Shouldn't Pre-Sell",
      "body": "If you don't think you can follow through with the commitment.  If you aren't sure whether you can hit your deadline.  If you have very impatient customers.  If you are 100% someone will buy."
    },
    {
      "id": "5140",
      "title": "Social proof",
      "body": "evidence that your product is valuable. To get people to pre-order your product, it has to have social proof. Social proof can be  Quotes from big names in your product's industry about how great or helpful your product will be."
    },
    {
      "id": "5141",
      "title": "Incentives to motivate customers",
      "body": "discount, bonuses, info, ebooks, cheat sheets, interviews, ebooks, one on one call with, 30 minute consulting call, private facebook group access."
    },
    {
      "id": "5142",
      "title": "Scarcity",
      "body": "Create the desire for your product. Limit the  Period of time during which people can pre-order your product, and, The number of spots that are available for pre-order."
    },
    {
      "id": "5143",
      "title": "Three Key Qualifiers",
      "body": "Buyers must have Need, Money, Urgency.  "
    },
    {
      "id": "5144",
      "title": "Discount",
      "body": "Also consider offering your initial customers a one-, two-, or three-year discount on your product, but never offer a 'life-time' discount. Don't offer a life-time discount because it's a hard (and often impossible) commitment to keep."
    },
    {
      "id": "5145",
      "title": "Script",
      "body": "'I think we can both agree that our product is going to be the perfect solution for your problem. As of right now, we're about <projected timeline> away from completion, and that final product will be about <projected price>.  But that's why I wanted to reach out to you. If you'd be willing to make a <price> deposit today, I can give you ', and we'll be able to speed the development up by <shortened timeline>.  Furthermore, we'll be communicating directly with anyone who preorders, so your feedback will help shape the final product.  The catch is'  In case anything goes wrong, your deposit is 100% refundable. No risk, high reward. What do you say?'"
    },
    {
      "id": "5146",
      "title": "Five Elements of Landing Page",
      "body": "Your unique selling proposition (headline, supporting headline, reinforcement statement, closing argument), hero shot (images/video of product, users), benefits of your offering (bullet points, before and after), social proof, single conversion goal call to action."
    },
    {
      "id": "5147",
      "title": "How to do webinar",
      "body": "Webinar software GoToWebinar (expensive), EasyWebinar, Google Hangouts (limited seats), Webinar Jams, Stealth Seminars, Click Webinar."
    },
    {
      "id": "5148",
      "title": "Find Early Adopters",
      "body": "Use Facebook, LinkedIn, Reddit and other discussion forms to find people that were asking for advice around your technology or are frustrated.  Get into conversations with those people.  "
    },
    {
      "id": "5149",
      "title": "Limited Time Sale",
      "body": "Urges people to buy now.  Typically 2 to 5 days.  "
    },
    {
      "id": "5150",
      "title": "Webinar",
      "body": "Try charging for a webinar that discusses topic of what you are building.  It is a form of validation and pre-selling.  "
    },
    {
      "id": "5151",
      "title": "Investomer",
      "body": "Treat the customer as if they are an investor.  Provide them with a prospectus with a good amount of detail.  Provide a timeline, with updates, and sneak peaks.  Provide a 100% money back guarantee if certain milestones are not met.  Show mockups.  Provide free interim content that provides value.  Provide a mini piece of bonus content at the time of pre-sale.  You should have a budget and time allocated to handle all the requirements of pre-sale."
    },
    {
      "id": "5152",
      "title": "Delays and Bugs",
      "body": "The first few months of a product after the intended release are going to be filled with bugs and delays.  Make sure that the customers have accurate expectations of what you are delivering."
    },
    {
      "id": "5153",
      "title": "Pre-Webinar Nurture Emails",
      "body": "Steps for getting to the goal that your product will promise.  Obstacles and rookie mistakes that get in the way of doing it themselves, how to get started now, announcements about why they should attend, 48/24/3hr/15 minute reminder, case studies of success."
    },
    {
      "id": "5154",
      "title": "Forums",
      "body": "Start reading forums, blogs, podcasts, related to your target audience.  Record what questions they are asking and use it as validation.  "
    },
    {
      "id": "5155",
      "title": "Webinar Tips",
      "body": "Spend extra time on title slide, provide value whether or not they buy.  Avoid sitting on slides for too long.  Promise and hook is the most important (what are you going to teach, what are you going to deliver).  Stay to the end bonus.  Include your story and aha moments along the way.  Sprinkle social proof throughout, bring up naturally (don't brag).  "
    },
    {
      "id": "5156",
      "title": "Guarantee",
      "body": "Some companies offer a 100% risk free, cancel anytime, we will refund your money, no questions asked guarantee.  Others don't give money-back guaranteed.  Only fallback is if they don't deliver on date of delivery.    "
    },
    {
      "id": "5157",
      "title": "Landing Page",
      "body": "Single page that has a single call to action (bright button).  Can be a single page or part of a website.  Goal is to get email address, sale or pre-sale.   Includes metrics for sales, value prop, differentiation statements, mockups of book, testimonials, social proof, description of solution, video.  "
    },
    {
      "id": "5158",
      "title": "Mini Soft Launch",
      "body": "Series of anticipation building emails. Social media promotions, opt-in bribe signup, story/value/nurture mini sequence (free valuable content), pain point education mini sequence, product announcement and release date, private sale pitch announcement (usually with discount), update emails, bonus, addressing objections, send non-buyers to list for actual release, send survey to those who signup to understand expectations."
    },
    {
      "id": "5159",
      "title": "Sell The Dream",
      "body": "Sell the big picture vision and future versions."
    },
    {
      "id": "5160",
      "title": "Buy Now Page",
      "body": "Sales page should have your price prominently with a big buy now button.  "
    },
    {
      "id": "5161",
      "title": "Create Offer/Info Packet",
      "body": "Put together a deliverable presentation of your product with snapshots, benefits, and your pre-sale offer."
    },
    {
      "id": "5162",
      "title": "Communication",
      "body": "Put the pre-sales people in a slack channel so that they can communicate with you and each other.  "
    },
    {
      "id": "5163",
      "title": "Pre-Sell Launch Sequence",
      "body": "Prospect is willing to exchange email for information you have.  "
    },
    {
      "id": "5164",
      "title": "Testimonial",
      "body": "Product proposes before and after, testimonials say, I now have (after) thanks to (your company).  If you don't have testimonials for your new product, pull testimonials from past products or demos.  "
    },
    {
      "id": "5165",
      "title": "Pre-Business Development",
      "body": "Pre-selling should truly be called business development because you are creating a partnership with a future buyer and working with them to accomplish both your needs.  The customer sees their involvement as making a difference and getting them the perfect solution quicker.  There is a big difference between a business development person and a salesperson.  "
    },
    {
      "id": "5166",
      "title": "Validation",
      "body": "Pre-selling is a great tool for validation."
    },
    {
      "id": "5167",
      "title": "Joint Webinar",
      "body": "Partnering with other companies or products for webinar."
    },
    {
      "id": "5168",
      "title": "Pre-Sales Sales Page",
      "body": "Page for product that does not exist with payment.  "
    },
    {
      "id": "5169",
      "title": "Niche",
      "body": "Only pre-sale to one market.  If you pre-sale to many different markets you won't be able to catch up with all the different feature requests you get.  "
    },
    {
      "id": "5170",
      "title": "Getting People to Webinar",
      "body": "Need to be super active on social media using scheduling apps like Hootsuite or Buffer.  "
    },
    {
      "id": "5171",
      "title": "Discount",
      "body": "Many companies will give a discount of the pre-sale."
    },
    {
      "id": "5172",
      "title": "The Catch",
      "body": "Make sure you set their expectations of the deal.  Catch is that it will not be ready until this date, we want your feedback, testimonials, pre-payment, need to commit by."
    },
    {
      "id": "5173",
      "title": "Who Will Give You Time",
      "body": "Make sure you sell into a market of people who are willing to give you time.  People in industries like HR, and Restaurants are difficult to get in touch with."
    },
    {
      "id": "5174",
      "title": "Payment",
      "body": "Make sure they can pay online right after they accept the offer.  "
    },
    {
      "id": "5175",
      "title": "Other Benefits",
      "body": "Make it clear that you will work with them personally, train them.  "
    },
    {
      "id": "5176",
      "title": "Limit #",
      "body": "Limit the number of pre-sales so that there is scarcity but so you don't overcommit.  Overcommitting can cause troubles because your pre-sales should be a temporary validation and cash flow tool and should not be scalable.    "
    },
    {
      "id": "5177",
      "title": "Nurture",
      "body": "Keep prospects on a nurture content sequence.    "
    },
    {
      "id": "5178",
      "title": "Be Realistic",
      "body": "It's incredibly vital but also incredibly tough to pre-sale.  90% of people will decide they can wait for the finished product.  Keep your expectations reasonable.  Realize it doesn't need to be scalable.  "
    },
    {
      "id": "5179",
      "title": "Trust",
      "body": "It requires a lot of trust for companies to pre-purchase a product that cannot be delivered.  This trust can either be achieved through  1. Pre-existing relationship, 2. Social Proof, 3. Back and forth communication centered around the core problem, 4. Money Back Guarantee, 5. Kick Ass Knowledge Base (over 75 FAQ questions)."
    },
    {
      "id": "5180",
      "title": "True cost",
      "body": "Is customer's time figuring out product and testing.  "
    },
    {
      "id": "5181",
      "title": "Mockups",
      "body": "Include a design mockup of your product.  Turn it into a video.  Us 99 Designs or Fiverr for help with mockups or videos.  "
    },
    {
      "id": "5182",
      "title": "Get emails in webinar",
      "body": "In one of your slides, say, I'm not going to overly bore you with details, send me an email to x@x.com if you want me to send you the following'"
    },
    {
      "id": "5183",
      "title": "Prioritization",
      "body": "In early stage saas you should be focused on customer success (weekly average use, net promoter score, churn), unit economics (payback, lifetime customer value, cost of acquisition, margins), and then growth (revenue, profit, customer count), in that order."
    },
    {
      "id": "5184",
      "title": "Set a goal for your pre-sell",
      "body": "Helps your strategy and motivates others to help get you over the hump."
    },
    {
      "id": "5185",
      "title": "Offer Discounts",
      "body": "Give a % off price, lock in lifetime discounts, unlimited use for a year, give a free month, unlimited users, priority customer support, no installation fee."
    },
    {
      "id": "5186",
      "title": "Get Over It",
      "body": "Get over the sickness in your stomach and connect with people.  "
    },
    {
      "id": "5187",
      "title": "Opt-In Lead Magnet",
      "body": "Free resource to get people's emails.  "
    },
    {
      "id": "5188",
      "title": "Planting Seeds",
      "body": "First step.  Off-hand mention of your product on forums, blogs, social media, Facebook groups, slack channels, etc.  Subtle and non-sales like.  Planting seeds means no links, no buy now button, no big announcement'mention it without a ton of detail.  You are trying to get people to ask you about it. Make it seem like you are working on something, not building and selling something.  Give free advice, when people come to you for more help, then mention you have a paid product."
    },
    {
      "id": "5189",
      "title": "Co-Create",
      "body": "Early adopters are more interested in being a part of creating the perfect solution rather than adapting an okay solution.  Once a product is ubiquitous it gives them no advantage and they are off to the next thing.  These people only represent 10-15% of population but make up 95% of traction.  Get them involved.  Show them you are listening to them."
    },
    {
      "id": "5190",
      "title": "Small List",
      "body": "Don't sell to your entire prospect list.  Only sell to a smaller list so you save some customers for the final sale.  "
    },
    {
      "id": "5191",
      "title": "Life After",
      "body": "Describes life before and after they purchase the product.  Good pitch method.  "
    },
    {
      "id": "5192",
      "title": "Three Months",
      "body": "Create a pre-sale offer of no less than 3 months so that you have some time to work out bugs.  "
    },
    {
      "id": "5193",
      "title": "Scarcity Levers",
      "body": "Countdown timer   Countdown Monkey, Timelay.  "
    },
    {
      "id": "5194",
      "title": "Set Purchase Expectations",
      "body": "Ask in an awareness email if they would like to be invited to an inner customers circle.  Personally email them.  Tell them you are going to setup a meeting and then are going to ask them to pre-purchase if they think it is a good fit.  "
    },
    {
      "id": "5195",
      "title": "Referrals",
      "body": "Ask for two solid referrals from each tech company.  "
    },
    {
      "id": "5196",
      "title": "Set your own pricing",
      "body": "Allow customers to pre-purchase setting their own pricing levels"
    },
    {
      "id": "5197",
      "title": "Set target for presale",
      "body": "  "
    },
    {
      "id": "5198",
      "title": "Landing Page Illustration",
      "body": "-"
    },
    {
      "id": "5199",
      "title": "Payment Terms ' 50% down-payment, deliver by date or get refunded, some will sign but won't release payment until delivery date.",
      "body": "-"
    },
    {
      "id": "5200",
      "title": "Product Co-Creation. Involve your audience in coming up with the idea for your product. Make sure they know that they helped co-create the idea for it. To do this, consistently ask your audience what very big problems they have and why those problems are so troublesome.  It's important that they know that your product is a result of them bringing up their problems, asking for you to solve these problems and ultimately collaborating with you.",
      "body": "-"
    },
    {
      "id": "5201",
      "title": "Use virtual assistants to help pre-sell.",
      "body": "-"
    }
  ]
}

