{
  "subject": "Quarterly Planning",
  "credit": "Quarterly Planning",
  "todos": [
    {
      "id": "5323",
      "title": "Part 3",
      "body": "Vision (V/TO™) Review and Build the Issues List (45 min)"
    },
    {
      "id": "5324",
      "title": "This is where the team takes a deep breath and puts a tidy bow on the day. Each team member shares three things",
      "body": "their overall feedback on the day, whether their expectations were met or not, and their rating of the day (on a scale of 1 to 10, 10 being the best). The goal/standard is an average rating of 8 or better, with everyone being open and honest about their ratings. If you’re not getting those ratings, work with your team to understand why, and to get better next quarter."
    },
    {
      "id": "5325",
      "title": "Part 5",
      "body": "Tackle All Key Issues (1.5 hours)"
    },
    {
      "id": "5326",
      "title": "Part 2",
      "body": "Review Previous Quarter (15 minutes)"
    },
    {
      "id": "5327",
      "title": "Part 6",
      "body": "Next Steps (5 minutes)"
    },
    {
      "id": "5328",
      "title": "Part 4",
      "body": "Establish Next Quarter’s Rocks (1 hour)"
    },
    {
      "id": "5329",
      "title": "Part 7",
      "body": "Conclude (5 minutes)"
    },
    {
      "id": "5330",
      "title": "Part 1",
      "body": "Check-In (15 minutes)"
    },
    {
      "id": "5331",
      "title": "*The 3-year plan on Scoutsheet’s VTO needs to be completed. Let’s make sure we get this done! ",
      "body": ""
    },
    {
      "id": "5332",
      "title": "A Leadership Team doing quarterly meetings and doing them well is a huge contributing factor to a company’s success. A rock-solid and highly productive quarterly planning session helps Leadership Teams become healthier, execute better and resolve issues permanently.",
      "body": ""
    },
    {
      "id": "5333",
      "title": "At the conclusion of your quarterly planning session, your team should feel 100 percent on the same page with each other, that the priorities for the coming quarter are clear and that all key issues have been resolved. A typical quarterly session is seven hours, plus or minus an hour.",
      "body": ""
    },
    {
      "id": "5334",
      "title": "At this point in the quarterly, your team needs to agree 100 percent on what is important for the next 90 days.",
      "body": ""
    },
    {
      "id": "5335",
      "title": "Below is a seven-part agenda for rock-solid and highly productive quarterlies. Please treat each agenda item as a checklist for you to do a checkup and determine how strong your quarterly meetings are (I’m assuming you’re doing them.) Below, you’ll see the perfect agenda for having a great quarterly along with a description of what “great” looks like for each agenda item and why it’s important. In addition, you’ll see time allocations (time allocations are averages; please be flexible with times). ",
      "body": ""
    },
    {
      "id": "5336",
      "title": "Context + Best Practice + Agenda",
      "body": ""
    },
    {
      "id": "5337",
      "title": "If your quarterlies aren’t great, I hope this simple checklist and check-up helps you make them great. In your next Clarity Break™, assess yourself by reviewing each agenda item. For a deeper dive into the quarterly, read pages 179–183 in Traction. If you need our help, let us know.",
      "body": ""
    },
    {
      "id": "5338",
      "title": "This agenda item is an opportunity for your team to review your Vision/Traction Organizer™ (V/TO)  - the Vision and the plan for your organization - to confirm that everyone is still 100 percent on the same page with every word.",
      "body": ""
    },
    {
      "id": "5339",
      "title": "This agenda item is for your team to review last quarter’s Rocks (90-day priorities) and determine your completion percentage. The minimum standard is 80 percent completion of all Rocks.",
      "body": ""
    },
    {
      "id": "5340",
      "title": "This agenda item is where your team now tackles all remaining issues from the Issues List.",
      "body": ""
    },
    {
      "id": "5341",
      "title": "This check-in is a segue to help your team dust themselves off from the previous quarter. It helps to keep everyone in the loop and understanding each other’s perspective. It helps to level-set the team. It’s also a great opportunity to pause and let your team take a deep breath and think about the current state of the company.",
      "body": ""
    },
    {
      "id": "5342",
      "title": "This gets your team to completely re-engage with your Vision, making sure everyone is still seeing it exactly the same way, as well as helping everyone to get completely refocused. With clarity of Vision, you then build the Issues List, smoking out all of the problems, concerns, barriers, obstacles, ideas and opportunities to address to achieve your Vision. My clients average about 30 issues in every quarterly session.",
      "body": ""
    },
    {
      "id": "5343",
      "title": "This is where each member of your team shares one personal and business best from the previous quarter. In addition, they give an update on what they feel is and isn’t working in your organization. They then share their expectations for the quarterly planning session.",
      "body": ""
    },
    {
      "id": "5344",
      "title": "This is where you come into the home stretch and recap all action items from the day.",
      "body": ""
    },
    {
      "id": "5345",
      "title": "This review is an opportunity for your team to talk about what worked and what didn’t regarding Rock setting and achieving for the quarter. It ultimately gives your team the opportunity to constantly improve by learning from the past, and then moving forward as smarter, better, faster planners of the future.",
      "body": ""
    },
    {
      "id": "5346",
      "title": "This will create a laser focus for your organization for the next 90 days.",
      "body": ""
    },
    {
      "id": "5347",
      "title": "This will make sure everyone is fully accountable for their commitments.",
      "body": ""
    },
    {
      "id": "5348",
      "title": "With clarity of the Vision and the Issues List clear, your team then determines what the priorities are for the coming quarter (Rocks). The team then discusses and debates and ultimately decides what the three to seven most important priorities are for the company in the coming quarter. Once the three to seven priorities for the company are clear, each individual Leadership Team member sets what their three to seven most important individual priorities are for the next quarter.",
      "body": ""
    },
    {
      "id": "5349",
      "title": "You simply choose the top three most important Issues to solve and then starting with number 1, you solve the issue in three steps. In Step 1, identify clearly what the real issue is, and then, in Step 2, openly and honestly discuss the Issue, ultimately getting to Step 3, solving the issue by deciding what the best solution is to make that Issue go away forever. Once issue number 1 is solved, then go to Issue number 2. Once you get through the first three Issues, then reprioritize the next three most important issues. You will rarely tackle all of the Issues, but it’s important that you tackle the most important key Issues (that’s why it’s important to identify the top three).",
      "body": ""
    },
    {
      "id": "5350",
      "title": "Your Leadership Team coming together every 90 days to dust yourselves off from the previous quarter, get on the same page, solve Issues and plan for the next 90 days creates a “90 day world” for your company that helps you avoid “the fray” that occurs when your leadership team doesn’t meet every 90 days. “The fray” is when you get off track, get disconnected, lose focus and start to scatter. Ninety days is about as long as humans can focus, which is why “the fray” starts right around the 90-day mark.",
      "body": ""
    }
  ]
}

