{
  "subject": "Quid Pro Quo Selling Checklist",
  "credit": "Quid Pro Quo Selling Checklist",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "5351",
      "title": "Experts or mavens",
      "body": "Industries recognize these people as their voices and if they promote it, it must be good."
    },
    {
      "id": "5352",
      "title": "Remove Buyer's Remorse",
      "body": "By reaching out to customer shortly after they purchase to make sure all is going well."
    },
    {
      "id": "5353",
      "title": "Show them the value your product adds to customers and connect it to meaningful things (ex",
      "body": "because of our product, our customers are able to spend twice as much time with their kids)"
    },
    {
      "id": "5354",
      "title": "After Presentation",
      "body": "You should be able to close within 5 days."
    },
    {
      "id": "5355",
      "title": "Boundaries",
      "body": "You must set boundaries so that you can consistently hold your ground.  Don't be afraid to say no politely.  Ex   'No, because'let's end this meeting right now so you guys can focus on finding the right product'we'd love to have you as a customer but only if you see the value we provide for all our customers.'"
    },
    {
      "id": "5356",
      "title": "Quid Pro Quo",
      "body": "What for what.  Equal exchange or substitution.  For everything the seller does for the buyer, the buyer should also do something to help the seller (i.e. to help move forward the sales process)."
    },
    {
      "id": "5357",
      "title": "Sales Security System",
      "body": "The natural firewalls people put in place when they think they are being sold.  People want to buy, they never want to be sold.  "
    },
    {
      "id": "5358",
      "title": "Prospecting",
      "body": "The most important step in sales and also the most tedious and thankless part of the sales process."
    },
    {
      "id": "5359",
      "title": "Job Span",
      "body": "The average job span for a sales person in technology is 18 months.  They are either let go or move on.  The best companies make sure a sales person is promoted instead of moving on.  "
    },
    {
      "id": "5360",
      "title": "Test In Live Environment",
      "body": "Test your sales people in the live environment that they will be selling in."
    },
    {
      "id": "5361",
      "title": "Personal Agendas",
      "body": "Sell to people's personal agendas, not to their companies goals."
    },
    {
      "id": "5362",
      "title": "Presentations Over Demos",
      "body": "Presentations should be sufficient to convince your buyers to purchase the product if you ask a lot of questions and qualify your buyer, resolve their issues, paint a logical word picture, sell the strength of your company."
    },
    {
      "id": "5363",
      "title": "In-Betweeners",
      "body": "People who don't know a lot of people but connect disparate networks."
    },
    {
      "id": "5364",
      "title": "Professional Evaluators",
      "body": "People who are paid to analyze what the company should buy and often.  Avoid dealing with these people.  "
    },
    {
      "id": "5365",
      "title": "Lead Exchange/Co-Marketing",
      "body": "Partnering with other firms to share leads and share marketing costs."
    },
    {
      "id": "5366",
      "title": "Price",
      "body": "Never sell on price. If customer starts talking about price, shift the conversation to cheaper products that don't the features and differentiation that you have."
    },
    {
      "id": "5367",
      "title": "Open Ended Questions",
      "body": "Never ask yes or no questions."
    },
    {
      "id": "5368",
      "title": "Understanding the Alternatives",
      "body": "Know your competition and give you customers a list of the competition.  "
    },
    {
      "id": "5369",
      "title": "Connectors",
      "body": "Know a lot of people and can connect you to other people and other connectors."
    },
    {
      "id": "5370",
      "title": "So What",
      "body": "Imagine buyers always saying 'so what'.  Ask them how experienced they are with the subject so you can talk in their terms and make sure they feel comfortable asking you to explain anything you say."
    },
    {
      "id": "5371",
      "title": "Attributes of a Business Consultant",
      "body": "Helps, listens, advises, guides, makes recommendations, corrects misconceptions, is an expert, has conviction, has credibility, has integrity, is community minded."
    },
    {
      "id": "5372",
      "title": "Lunch & Learns",
      "body": "Free food and information."
    },
    {
      "id": "5373",
      "title": "Avoid Scarcity",
      "body": "Don't use the terms we only have a few left so buy now, instead to meet your guys timeline for ' we need to get you signed up by.  "
    },
    {
      "id": "5374",
      "title": "Leo Burnett Sales Strategy",
      "body": "Don't tell me how good you make it, tell me how good it will make me when I use it.  "
    },
    {
      "id": "5375",
      "title": "Sales Message",
      "body": "Continuity is super important so your sales message should be owned by your group and not by any individual member."
    },
    {
      "id": "5376",
      "title": "Importance of Good Sales & Marketing",
      "body": "Because 99% of products do not sell themselves.  "
    },
    {
      "id": "5377",
      "title": "When decision maker get involved in decisions",
      "body": "At beginning to establish objectives and at the end to measure the results of the decision.  "
    },
    {
      "id": "5378",
      "title": "Personal Questions",
      "body": "Ask questions like how is this affecting you personally, you will likely get a business response but follow up saying that you understand the business terms but want to know how it affects them personally.  "
    },
    {
      "id": "5379",
      "title": "Aim Above Goal",
      "body": "Aim above your sales goals and you will likely land on your goals.  "
    },
    {
      "id": "5380",
      "title": "What a Seller Needs",
      "body": "Access, Information, Partnership, Approval.  "
    },
    {
      "id": "5381",
      "title": "Published v. Political Org Chart",
      "body": "A published org chart is the standard hierarchy.  A political org chart ranks the individuals in the company that have the ability to get things done.  Depends on length at company, family or personal ties to ownership or top management, education and expertise, in-fighting."
    },
    {
      "id": "5382",
      "title": "Keep it Simple",
      "body": "A confused mind says no.  Presentations are better than demos unless you have the most simple product ever.  "
    },
    {
      "id": "5383",
      "title": "Wrong Level",
      "body": "80% of salespeople sell at the wrong level (sell to people underneath the decision maker).  "
    },
    {
      "id": "5384",
      "title": "Call Reluctance",
      "body": "40% of salespeople face a period of call reluctance that ends up costing them their job.  Remove call reluctance by"
    },
    {
      "id": "5385",
      "title": "Cheap/Free Gifts You Can Give Customer",
      "body": "  "
    },
    {
      "id": "5386",
      "title": "Disengaging Sales Security System",
      "body": "  "
    },
    {
      "id": "5387",
      "title": "Ask questions",
      "body": "-"
    },
    {
      "id": "5388",
      "title": "Don't change the subject",
      "body": "-"
    },
    {
      "id": "5389",
      "title": "Don't interrupt",
      "body": "-"
    },
    {
      "id": "5390",
      "title": "Empathize",
      "body": "-"
    },
    {
      "id": "5391",
      "title": "Listen to their full story",
      "body": "-"
    },
    {
      "id": "5392",
      "title": "Listen to their full story with your heart",
      "body": "-"
    },
    {
      "id": "5393",
      "title": "Listen to their story",
      "body": "-"
    },
    {
      "id": "5394",
      "title": "Look at the person speaking to you",
      "body": "-"
    },
    {
      "id": "5395",
      "title": "Put yourself in their shoes",
      "body": "-"
    },
    {
      "id": "5396",
      "title": "Respond verbally and non-verbally",
      "body": "-"
    },
    {
      "id": "5397",
      "title": "Address how the product will resolve each issue and cross them off",
      "body": "-"
    },
    {
      "id": "5398",
      "title": "Advice (expert advice or audit about their strategy)",
      "body": "-"
    },
    {
      "id": "5399",
      "title": "Avoid talking about scarcity of the item",
      "body": "-"
    },
    {
      "id": "5400",
      "title": "Avoid using extreme adjectives like the best, top of the line, number one",
      "body": "-"
    },
    {
      "id": "5401",
      "title": "Avoid using words like deal, steal",
      "body": "-"
    },
    {
      "id": "5402",
      "title": "Be a good listener",
      "body": "-"
    },
    {
      "id": "5403",
      "title": "Be confident and enthusiastic",
      "body": "-"
    },
    {
      "id": "5404",
      "title": "Be seen as a trusted advisor and not a salesperson",
      "body": "-"
    },
    {
      "id": "5405",
      "title": "Be sincerely interested in others",
      "body": "-"
    },
    {
      "id": "5406",
      "title": "Celebrate their wins",
      "body": "-"
    },
    {
      "id": "5407",
      "title": "Customize everything in the presentation for them, no hypotheticals",
      "body": "-"
    },
    {
      "id": "5408",
      "title": "Demo specific features with visuals, you don't have to demo with the actual product",
      "body": "-"
    },
    {
      "id": "5409",
      "title": "Do things for them",
      "body": "-"
    },
    {
      "id": "5410",
      "title": "Do your homework on the buyer and make common connections",
      "body": "-"
    },
    {
      "id": "5411",
      "title": "Don't' make it all about business, ask at least two personal questions (locations lived, kids, job history, hobbies, business goals, sports).  Tie these personal questions into examples so they don't think you are just asking them random questions to lower their guard.",
      "body": "-"
    },
    {
      "id": "5412",
      "title": "Educate and train them constantly so they are motivated and inspired with new ideas",
      "body": "-"
    },
    {
      "id": "5413",
      "title": "Food, snacks, candy",
      "body": "-"
    },
    {
      "id": "5414",
      "title": "Get and give confirmation that you and they have a clear understanding how your product meets their needs",
      "body": "-"
    },
    {
      "id": "5415",
      "title": "Give compliments",
      "body": "-"
    },
    {
      "id": "5416",
      "title": "Give them free resources so that they can provide a quid pro quo experience to the buyer.  Most times call reluctance comes when they think they are wasting the buyers time.",
      "body": "-"
    },
    {
      "id": "5417",
      "title": "Have them spend a half day each week studying the value that the product adds to people so that they can see how they are improving lives",
      "body": "-"
    },
    {
      "id": "5418",
      "title": "Having a strong sales process and helpful scripts to follow",
      "body": "-"
    },
    {
      "id": "5419",
      "title": "If you can't do it in person, have a list of Frequent Issues that people can click on and it takes them to a demo video showing how the product resolves those issues.",
      "body": "-"
    },
    {
      "id": "5420",
      "title": "Information (checklists, articles, cheatsheets, books, websites, reports)",
      "body": "-"
    },
    {
      "id": "5421",
      "title": "List customer issues and then have a demo that addresses each issue",
      "body": "-"
    },
    {
      "id": "5422",
      "title": "List the issues on a chart or notepad or screen for everyone to clearly see",
      "body": "-"
    },
    {
      "id": "5423",
      "title": "Mail (personalized thank you cards)",
      "body": "-"
    },
    {
      "id": "5424",
      "title": "Make sure they understand the law of large numbers and that 90% of their efforts will end in nothing",
      "body": "-"
    },
    {
      "id": "5425",
      "title": "Make them feel important",
      "body": "-"
    },
    {
      "id": "5426",
      "title": "Referrals (connecting them to customers) or lists of people you know that you could connect them to",
      "body": "-"
    },
    {
      "id": "5427",
      "title": "Sell the experience of your company",
      "body": "-"
    },
    {
      "id": "5428",
      "title": "Set the agenda at the start of the presentation",
      "body": "-"
    },
    {
      "id": "5429",
      "title": "Talk about other competitors products and where they can find them",
      "body": "-"
    },
    {
      "id": "5430",
      "title": "Talk about the other persons interests and issues (write down their issues)",
      "body": "-"
    },
    {
      "id": "5431",
      "title": "Tell them you are not on commission",
      "body": "-"
    },
    {
      "id": "5432",
      "title": "Testimonials (posting ads or online reviews that speak highly of them)",
      "body": "-"
    },
    {
      "id": "5433",
      "title": "To accept responsibility for their issues",
      "body": "-"
    },
    {
      "id": "5434",
      "title": "To agree to a plan to buy",
      "body": "-"
    },
    {
      "id": "5435",
      "title": "To agree to explore your product",
      "body": "-"
    },
    {
      "id": "5436",
      "title": "To commit to changing habits",
      "body": "-"
    },
    {
      "id": "5437",
      "title": "To decide if it is possible to solve their problems",
      "body": "-"
    },
    {
      "id": "5438",
      "title": "To express a desire for the solution",
      "body": "-"
    },
    {
      "id": "5439",
      "title": "To listen",
      "body": "-"
    },
    {
      "id": "5440",
      "title": "To share their concerns",
      "body": "-"
    },
    {
      "id": "5441",
      "title": "To share their decision criteria",
      "body": "-"
    },
    {
      "id": "5442",
      "title": "To share their situation and issues",
      "body": "-"
    },
    {
      "id": "5443",
      "title": "Train them to act as consultants and not sales people",
      "body": "-"
    },
    {
      "id": "5444",
      "title": "Trial close",
      "body": "-"
    },
    {
      "id": "5445",
      "title": "Use their name often",
      "body": "-"
    },
    {
      "id": "5446",
      "title": "Criteria Prospects for Prospects",
      "body": "-"
    },
    {
      "id": "5447",
      "title": "How to listen",
      "body": "-"
    },
    {
      "id": "5448",
      "title": "Issue Demonstration",
      "body": "-"
    },
    {
      "id": "5449",
      "title": "Ladder",
      "body": "-"
    },
    {
      "id": "5450",
      "title": "Mutual Respects",
      "body": "-"
    },
    {
      "id": "5451",
      "title": "Seven Ways to get People to Like You",
      "body": "-"
    },
    {
      "id": "5452",
      "title": "Steps to Successful Presentation",
      "body": "-"
    }
  ]
}

