{
  "subject": "Real Estate Lead Generation Checklist",
  "credit": "Real Estate Lead Generation Checklist",
  "topic": "Real Estate",
  "todos": [
    {
      "id": "5453",
      "title": "Purchase Google AdWords that target your prospects. You can narrow this range quite a bit! Example",
      "body": "I want my ad to show to Las Vegas residents searching for 'best commercial real estate agent' or 'available industrial suites.'"
    },
    {
      "id": "5454",
      "title": "'Welcome New Tenant' emails to clients, agents, and industry professionals.",
      "body": "-"
    },
    {
      "id": "5455",
      "title": "Ads in local industry magazines or business gazettes.",
      "body": "-"
    },
    {
      "id": "5456",
      "title": "Advertising",
      "body": "-"
    },
    {
      "id": "5457",
      "title": "Announce new blog posts on Twitter and Facebook to bring people into your website.",
      "body": "-"
    },
    {
      "id": "5458",
      "title": "Ask clients to tell their friends and colleagues about your services. Be sure they know you're taking new clients, some assume you're not (especially if you complain about being busy).",
      "body": "-"
    },
    {
      "id": "5459",
      "title": "Associations",
      "body": "-"
    },
    {
      "id": "5460",
      "title": "Banner ads on popular industry websites.",
      "body": "-"
    },
    {
      "id": "5461",
      "title": "Big change announcements ' like price reductions or promo deals.",
      "body": "-"
    },
    {
      "id": "5462",
      "title": "Blog to show expertise and bring in more people to your website.",
      "body": "-"
    },
    {
      "id": "5463",
      "title": "Build a Facebook page and post your newest listings and congratulate new tenants.",
      "body": "-"
    },
    {
      "id": "5464",
      "title": "Buy quality pens, hats, and shirts. Promos are of no use if they're thrown away!",
      "body": "-"
    },
    {
      "id": "5465",
      "title": "Charity",
      "body": "-"
    },
    {
      "id": "5466",
      "title": "Comment on industry blogs to draw prospects back to your website.",
      "body": "-"
    },
    {
      "id": "5467",
      "title": "Cross promote with other industry professionals. 'I'm an industrial agent, but is an excellent retail agent.'",
      "body": "-"
    },
    {
      "id": "5468",
      "title": "Don't be shy! Mention your services to baristas, that person you met in the grocery line and anyone else who seems interested.",
      "body": "-"
    },
    {
      "id": "5469",
      "title": "Donations are often rewarded with linking your website to the charity's web page.",
      "body": "-"
    },
    {
      "id": "5470",
      "title": "Email Campaigns",
      "body": "-"
    },
    {
      "id": "5471",
      "title": "Email newsletters keep you consistently in front of clients and leads. Consider sending monthly or bi-monthly.",
      "body": "-"
    },
    {
      "id": "5472",
      "title": "Email signatures should have your website ' forwarded emails may bring in leads.",
      "body": "-"
    },
    {
      "id": "5473",
      "title": "Ensure your family and friends know exactly what services you offer, enlist them to help spread the word.",
      "body": "-"
    },
    {
      "id": "5474",
      "title": "Enter yourself into local or national 'industry professional' awards.",
      "body": "-"
    },
    {
      "id": "5475",
      "title": "Exchange links with popular industry websites.",
      "body": "-"
    },
    {
      "id": "5476",
      "title": "Gather a list of commercial real estate property owners or tenants from LoopNet Property Records.",
      "body": "-"
    },
    {
      "id": "5477",
      "title": "Generic services email (outline your offered services) with links to your website. Have this on file, send to website and phone inquiries you receive.",
      "body": "-"
    },
    {
      "id": "5478",
      "title": "Give discounts to referrals from charitable causes.",
      "body": "-"
    },
    {
      "id": "5479",
      "title": "If you insist on the clich' flashlights, make sure they actually give off light. If the flashlight isn't quality, it becomes the most discarded promo item. 'Brighten your Investment Portfolio with''",
      "body": "-"
    },
    {
      "id": "5480",
      "title": "Industry conventions are a great place to meet new leads and fellow professionals.",
      "body": "-"
    },
    {
      "id": "5481",
      "title": "Join an industry organization and get listed.",
      "body": "-"
    },
    {
      "id": "5482",
      "title": "Join local Better Business Bureau and participate in functions.",
      "body": "-"
    },
    {
      "id": "5483",
      "title": "Join local NAIOP chapter and participate in functions.",
      "body": "-"
    },
    {
      "id": "5484",
      "title": "Join the local university (even if you're not an alumni) to mentor or be a guest speaker.",
      "body": "-"
    },
    {
      "id": "5485",
      "title": "Keep up with Twitter and post on popular tags such as #CRE.",
      "body": "-"
    },
    {
      "id": "5486",
      "title": "Leave flyers or business cards pinned up at your local coffee shops and post offices.",
      "body": "-"
    },
    {
      "id": "5487",
      "title": "Mail a cover letter and'company brochure'to potential lessees or property owners.",
      "body": "-"
    },
    {
      "id": "5488",
      "title": "Mailers",
      "body": "-"
    },
    {
      "id": "5489",
      "title": "Make friends with a powerful contender that's not interested in your target market and pass each other referrals.",
      "body": "-"
    },
    {
      "id": "5490",
      "title": "Networking",
      "body": "-"
    },
    {
      "id": "5491",
      "title": "Offer a 'sign up for new listing info' option.",
      "body": "-"
    },
    {
      "id": "5492",
      "title": "Offer a 'sign up for the newsletter' option.",
      "body": "-"
    },
    {
      "id": "5493",
      "title": "Offer a'white paper or special report'in exchange for a visitor's email, full name, and company.",
      "body": "-"
    },
    {
      "id": "5494",
      "title": "Offer free consultations and site visits for referrals.",
      "body": "-"
    },
    {
      "id": "5495",
      "title": "Offer services for free to charitable organizations of your choice.",
      "body": "-"
    },
    {
      "id": "5496",
      "title": "Offer to be a guest speaker during an organization's meetings.",
      "body": "-"
    },
    {
      "id": "5497",
      "title": "Offer to hire a photographer at industry events. Have the photographer place your business card with printed photos.",
      "body": "-"
    },
    {
      "id": "5498",
      "title": "Participate in events and hand out cards or promo items.",
      "body": "-"
    },
    {
      "id": "5499",
      "title": "Participate in trade shows that your target prospects may attend.",
      "body": "-"
    },
    {
      "id": "5500",
      "title": "Pass out flash drives of your information to industry professionals. After they're done looking through the files, they can still use the branded flash drive.",
      "body": "-"
    },
    {
      "id": "5501",
      "title": "Pass promo items out at events, offer them to charity, and bring them to networking factions.",
      "body": "-"
    },
    {
      "id": "5502",
      "title": "Promos",
      "body": "-"
    },
    {
      "id": "5503",
      "title": "Purchase 'YourFullName.com'.'People will Google your name.'It's best that your website is the first thing they see.",
      "body": "-"
    },
    {
      "id": "5504",
      "title": "Recent listings emails to clients, agents, and industry professionals.",
      "body": "-"
    },
    {
      "id": "5505",
      "title": "Sales letters'written to your target market can be sent to your gathered list of CRE property owners or tenants.",
      "body": "-"
    },
    {
      "id": "5506",
      "title": "Send clever holiday greeting cards to your clients and prospects.",
      "body": "-"
    },
    {
      "id": "5507",
      "title": "Send'attractive postcards'announcing your services to potential clients.",
      "body": "-"
    },
    {
      "id": "5508",
      "title": "Send'attractive postcards'with listing information to potential lessees (leases) or property owners (sales).",
      "body": "-"
    },
    {
      "id": "5509",
      "title": "Social involvement in churches, schools, universities, and others can bring more word-of-mouth leads.",
      "body": "-"
    },
    {
      "id": "5510",
      "title": "Social Media",
      "body": "-"
    },
    {
      "id": "5511",
      "title": "Website",
      "body": "-"
    },
    {
      "id": "5512",
      "title": "Word of Mouth",
      "body": "-"
    }
  ]
}

