{
  "subject": "Rocket Fuel Checklist",
  "credit": "Rocket Fuel Checklist",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "5526",
      "title": "Visionary Challenges",
      "body": "You get easily bored and have a hard time keeping focus, you develop too many ideas, reality distortion field, organization whiplash (whenever you have a new idea you cause everyone in the organization to lose focus), binary behavior (all in or all out), don't always communicate to everyone, aren't good at managing the details, difficult for you to attract leadership that can run the day to day (hire young potential talent and end up running them off instead of developing them), you can be overly assertive and difficult to challenge in meetings, reluctance to let go, under develop leadership team (genius with a thousand helpers), eyes are bigger than stomach, over complicate things, drive too hard for most people."
    },
    {
      "id": "5527",
      "title": "Integrator Challenges",
      "body": "Unsung hero (don't get as much glory as other members of the leadership team), often accused as being a pessimist, often must discipline other members of leadership team, lack of appreciation."
    },
    {
      "id": "5528",
      "title": "Integrator Roles",
      "body": "Running day to day, accountable for profit and loss, obsessed with organizational clarity, great at communicating, great at managing and following through, integrates major function of business (sales, marketing, operations, finance), voice of reason, provides focus, provides accountability, tie-breaker, prioritizes what needs to be done, steady and consistent, manages business plan, decisive, goal achiever, continuous learner, retain and grow talent."
    },
    {
      "id": "5529",
      "title": "Discuss",
      "body": "Provide an open and honest environment where everyone can share their thoughts, concerns, and solutions.  Discuss and debate.  Go around the room and make sure everyone has a chance to say what they mean once,  don't allow people to repeat what they already said (repeating is politicking)."
    },
    {
      "id": "5530",
      "title": "Integrator",
      "body": "One who integrates, one who harmoniously unites the major functions of a business, one who keeps the trains running on time, one who creates focus, accountability, and alignment.  Glue that holds the people, processes, systems, priorities, and strategy of the company together.  How person. About 5.5% of the world can be integrators."
    },
    {
      "id": "5531",
      "title": "Visionary",
      "body": "One who has clear ideas about what should happen or be done in the future, one who has powerful imagination, one who sees visions, one who has unusual foresight.  Why person.  About 22% of the world can be visionaries."
    },
    {
      "id": "5532",
      "title": "Identify",
      "body": "Find the real issue (the stated problem is rarely the real issue), state the real issue in one sentence.  "
    },
    {
      "id": "5533",
      "title": "Job Listings for Integrators",
      "body": "www.rocketfuelnow.com"
    },
    {
      "id": "5534",
      "title": "When Should a Visionary add an Integrator",
      "body": "When you can afford it, when you are ready to let go of some control, when you are ready for fewer late night hours, when you are ready to adapt 100% of your visionary role."
    },
    {
      "id": "5535",
      "title": "How to Avoid End Runs (circumnavigation)",
      "body": "When an employee comes to you when they should be going to who they report to you say, 'are you going to tell them or am I going to tell them.'"
    },
    {
      "id": "5536",
      "title": "Core Questions (to get visionary and integrator on same page)",
      "body": "What are your core values, what is your core focus, what is your 10 year target, who is your ideal customer, what is your three year picture, what is your one year plan."
    },
    {
      "id": "5537",
      "title": "Do You Need a Visionary",
      "body": "Visionaries are needed more when you are in high-tech industry or industries that change fast, when the company has large growth aspirations, and when market change is inevitable."
    },
    {
      "id": "5538",
      "title": "How to Develop The Relationship",
      "body": "They are co-founders, they are partners, promote an existing internal team member, hire someone from the outside. Must stay on the same page (same page meeting every month for 2-4 hours - IDS), don't allow end runs (employee going around who they are accountable to), integrator is the tie breaker (only rarely should visionary ever trump integrator), you are an employee when working in the business (you are accountable and your vote is not the only one that matters), maintain mutual respect (never make negative comments about your counterpart to anyone in the company, never ever)."
    },
    {
      "id": "5539",
      "title": "The Visionary/Integrator Relationship",
      "body": "The jobs are always opposite and equal.  They are a pair of leaders.  They are always driving each other a little crazy.  This is normal.  The push and pull actually keeps things in balance and provides greater stability.  "
    },
    {
      "id": "5540",
      "title": "Solve",
      "body": "Solution should be simple.  Making a decision is more important than making the right decision (done is better than perfect and we will never know the right decision until we see how it plays out).  Solution needs to be stated by someone until you hear the sweet sound of agreement.  "
    },
    {
      "id": "5541",
      "title": "Owner as Employees",
      "body": "Present a united front and don't expect special entitlements, integrators make final decisions, don't engage in politics, have complete accountability for your seat, know that you can be fired as an employee.  "
    },
    {
      "id": "5542",
      "title": "Five Visionary Frustrations",
      "body": "Lack of control, lack of profit, lack of bringing others on the same page, hitting the ceiling (growth has stopped), nothing is working to fix it."
    },
    {
      "id": "5543",
      "title": "Sitting in Multiple Seats",
      "body": "In the early stages of a company, visionaries and integrators frequently sit in multiple seats.  This is okay as long as two conditions are met, the role should be consistent with their unique abilities and they must report to the integrator and be very clear what hat they are wearing at all times.  "
    },
    {
      "id": "5544",
      "title": "Accountability Chart",
      "body": "In order to maintain accountability, only one person can be in charge of any major function within your organization.   You should have no more than seven main leadership functions (such as marketing, sales, operations, customer service, it, HR, finance, etc.).  Once a person has been set in that role, the visionary and integrator have to let go of that role by setting clear expectations, goals, and measurable and let the leader be responsible and accountable for execution.  "
    },
    {
      "id": "5545",
      "title": "IDS",
      "body": "Identify, Discuss, Solve"
    },
    {
      "id": "5546",
      "title": "Visionary Roles",
      "body": "Idea generator, creative, devises solutions to big problems, teach visually (drawings, diagrams, flipcharts, napkins), see big picture, great with research and development, hunter mentality (looking for ideas, deals, opportunities, and solutions to big problems), inspire others, provide passion and energy, close big deals, vision creator and champion, manage big relationships, connect the dots, on occasion do the work, help set company culture."
    },
    {
      "id": "5547",
      "title": "Owner Roles",
      "body": "Hold formal quarterly owner meetings.  Have monthly same page meetings, communicate straight forward (don't be vague), present a unified front, solve issues before bringing them into the business."
    },
    {
      "id": "5548",
      "title": "Visionary Fix",
      "body": "Find and delegate to an integrator.  Role awareness (be aware of your challenges as a visionary), ability awareness (don't just role up your sleeves and do the work (develop and train others), letting go (let other build the company)."
    },
    {
      "id": "5549",
      "title": "Profile Assessments",
      "body": "DiSC, Kolbe, Myers-Briggs (MBTI), TTI."
    },
    {
      "id": "5550",
      "title": "Separate Roles",
      "body": "Companies need both a visionary and an integrator.  Rarely can one person be or serve as both roles.  "
    },
    {
      "id": "5551",
      "title": "Avoid the word but",
      "body": "But is commonly associated with disagreement.  Instead replace it with 'yes, and''.  Using and indicates that you agree with there partial truth but have something to add to it.    "
    },
    {
      "id": "5552",
      "title": "Advice for First 90 Days",
      "body": "Accelerate their learning, secure early wins, achieve alignment, establish trust, provide tools they need.  "
    }
  ]
}

