{
  "subject": "Sam Walton Checklist",
  "credit": "Sam Walton Checklist",
  "todos": [
    {
      "id": "5582",
      "title": "Ultimate Three",
      "body": "Time, Price, and Quality.  You must adapt your strategy around two and let the third suffer."
    },
    {
      "id": "5583",
      "title": "Fear",
      "body": "You should be less afraid of being wrong than anyone and shake off your mistakes quickly."
    },
    {
      "id": "5584",
      "title": "Self Service",
      "body": "Unlike traditional merchant stores where the checkout counters were sprinkled throughout the store, Walmart developed a self-service model without checkout upfront.  There were no excess people in the stores.  "
    },
    {
      "id": "5585",
      "title": "Small-town America",
      "body": "There is much more business in small-town America than people think."
    },
    {
      "id": "5586",
      "title": "Sales",
      "body": "The skill of being able to strike up an interesting and mutually beneficial conversation with anyone.  You can learn from everybody.  You should be able to know people so well that you can yell at them a block away."
    },
    {
      "id": "5587",
      "title": "Popcorn & Ice Cream",
      "body": "Sometimes unconventional tactics such as putting an pop-corn or ice cream stand in your retail store will be the best approach to driving new traffic.  "
    },
    {
      "id": "5588",
      "title": "Absentee Ownership",
      "body": "Putting business where the manager cannot or will not be.  Information and technology are a toll but not a substitute to control absentee ownership.  Growth should be manageable and within reach."
    },
    {
      "id": "5589",
      "title": "Airplanes",
      "body": "Purchasing low and slow flying propeller planes allowed Sam Walton to travel quicker and scout stores better than any of his competition.  Wal-Mart was ten years ahead of competition in scouting locations.  “We stay in the air to keep our ear to the ground.”"
    },
    {
      "id": "5590",
      "title": "Horizontal Integration",
      "body": "No one is too important to be the butt of a joke."
    },
    {
      "id": "5591",
      "title": "Change",
      "body": "No decision should ever be sacred."
    },
    {
      "id": "5592",
      "title": "Competition",
      "body": "For Wal-Mart, success was studying their competition and trying to be cheaper.  It was also a way of getting over the learning curve.  "
    },
    {
      "id": "5593",
      "title": "Two Promises",
      "body": "Each company should have two main promises.  Wal-Mart’s were “We Sell for Less” and “Satisfaction Guaranteed.”  "
    },
    {
      "id": "5594",
      "title": "Scale",
      "body": "Don’t scale until you absolutely have to.  "
    },
    {
      "id": "5595",
      "title": "Our Way",
      "body": "Don’t sacrifice your culture to work with others that have different cultures."
    },
    {
      "id": "5596",
      "title": "Opposite",
      "body": "Do what others aren’t."
    },
    {
      "id": "5597",
      "title": "Store-Within-A-Store",
      "body": "Departments have their own business model and sense of ownership and proprietorship."
    },
    {
      "id": "5598",
      "title": "Attraction",
      "body": "Customer’s attraction to a product is sometimes beyond the product.  Sometimes it lies in things that aren’t even related to the product like the way the store smells, the storekeeper’s personality, an ice cream machine, etc."
    },
    {
      "id": "5599",
      "title": "Fundraising",
      "body": "Cash flow is important but time is better spent in your company improving your business rather than trying to sell your idea to others."
    },
    {
      "id": "5600",
      "title": "Volume",
      "body": "By cutting your prices you can boost your sales and increase your profits."
    },
    {
      "id": "5601",
      "title": "Status Quo",
      "body": "Businesses always need to be fiddling and meddling with the status quo."
    },
    {
      "id": "5602",
      "title": "Associates",
      "body": "Better term for employees."
    },
    {
      "id": "5603",
      "title": "Highlighting Non-Bias",
      "body": "Being able to highlight and sell any item regardless whether it is your best item or not."
    },
    {
      "id": "5604",
      "title": "Transparency",
      "body": "Associates can’t do their jobs right if information isn’t properly shared.  It also makes people feel involved and responsible."
    },
    {
      "id": "5605",
      "title": "Offbeat Supply",
      "body": "Always look for the offbeat suppliers or sources for your product or service."
    },
    {
      "id": "5606",
      "title": "Communication",
      "body": "A must for large organizations.  Includes face-to-face, phone calls, e-mails, file sharing systems, etc.  Wal-Mart invested en early satellite technology to help share information between stores."
    },
    {
      "id": "5607",
      "title": "Walton Rules for Success",
      "body": "1. Commit to your business, 2. Share profits, 3. Motivate partners, 4. Communicate, 5. Appreciate others, 6. Celebrate success, 7. Listen to everyone, 8. Exceed expectations, 9. Control expenses, 10. Swim upstream."
    }
  ]
}

