{
  "subject": "SCALING CHECKLIST",
  "credit": "SCALING CHECKLIST",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "5608",
      "title": "FOCUS ON FEWER BUT BETTER",
      "body": "Work with fewer but higher quality resources."
    },
    {
      "id": "5609",
      "title": "SMARTER NOT HARDER",
      "body": "Work to be smarter, not harder.  If you have the option of doing something two ways, always go with the way that is going to make the same task easier the next time.  Don't go with the easy route unless you know you won't repeat the task or it takes 5% of the time and energy.  Growth is determined by being able to do the same task you did yesterday in less time."
    },
    {
      "id": "5610",
      "title": "OUTSOURCE THE NON-CRITICAL",
      "body": "Outsource non-critical items of your business to companies that can handle capacity."
    },
    {
      "id": "5611",
      "title": "MISSION CRITICAL",
      "body": "Only invest in expenses that are critical to your mission and add value to your customer."
    },
    {
      "id": "5612",
      "title": "NETWORK WITH COMPETITORS",
      "body": "Make friends with competitors so that you can use them when advantageous."
    },
    {
      "id": "5613",
      "title": "CULTURAL TRAINING",
      "body": "Invest in the time to train all your staff about the culture of the company so that they can re-enforce the core ideology in your absence."
    },
    {
      "id": "5614",
      "title": "STAFF ON DEMAND",
      "body": "Have the right but not the requirement to access staff on demand."
    },
    {
      "id": "5615",
      "title": "RESOURCES ON DEMAND",
      "body": "Have the right but not the requirement to access resources on demand."
    },
    {
      "id": "5616",
      "title": "LEVERAGE COMMUNITY AND CROWD",
      "body": "Get free labor and advice when you can.  "
    },
    {
      "id": "5617",
      "title": "REMOVE OBSTACLES TO GROWTH",
      "body": "Envision what will prevent you from growing and remove those barriers."
    },
    {
      "id": "5618",
      "title": "TRANSPARENCY",
      "body": "Encourage transparency so that everyone knows what is going on and anyone can step in your shoes and make informed decisions.  "
    },
    {
      "id": "5619",
      "title": "CONSISTENT SCALING",
      "body": "Don't scale too fast when you are starting and don't scale too slow when you hitting your mark."
    },
    {
      "id": "5620",
      "title": "BUILD A LASTING TEAM",
      "body": "Choose your people wisely and for the long run."
    },
    {
      "id": "5621",
      "title": "BUILD FOR TOMORROW'S WORKPLACE",
      "body": "Build systems that can handle twice your current capacity."
    },
    {
      "id": "5622",
      "title": "SOLID FOUNDATION",
      "body": "Build a solid foundation."
    },
    {
      "id": "5623",
      "title": "LIBRARY",
      "body": "Build a library of easy to access resources."
    }
  ]
}

