{
  "subject": "Selling Your Product/Service",
  "credit": "Selling Your Product/Service",
  "todos": [
    {
      "id": "5654",
      "title": "Don’t Demo Spaghetti",
      "body": "Your objective is not to highlight every feature your product.  It’s to align the features with the specific problem(s) your buyer is struggling with.  If what you’re showing isn’t connected to a real business problem, don’t show it.  They are not a wall for your demo spaghetti. I.E. don’t through all kinds of shit against them, hoping something sticks."
    },
    {
      "id": "5655",
      "title": "It’s Not About You or Your Product",
      "body": "Your customers could care less about you, your product, your company, etc.  All they care about is, can you help them run their business. Don’t lead with what you do, lead to what you do."
    },
    {
      "id": "5656",
      "title": "Don’t Lower Status",
      "body": "Your customers cannot do what you do so you should never feel that you are of lower status.   People only give their attention to people who appear to have higher social status."
    },
    {
      "id": "5657",
      "title": "Close Down Threats",
      "body": "When you see a threat, close the distance and shut it down…Example  if customer expresses pricing as a concern… excuse yourself politely…”I understand you have a business to run so maybe this isn’t the right fit now, please keep in touch”."
    },
    {
      "id": "5658",
      "title": "Three Magic Questions",
      "body": "What are you looking for?  What is the most important thing you are looking for?  Why?  Ask them to prioritize issues.  What does solved look like?  Draw pictures to clarify.  "
    },
    {
      "id": "5659",
      "title": "Trial Close / Anchoring",
      "body": "Trial closing is to gauge whether you client is ready to say yes.  Ask the client if they can see themselves in or using the product. “Can you see this improving your…?”"
    },
    {
      "id": "5660",
      "title": "Core Desire",
      "body": "To influence other’s you must connect with their core desire.  Not their minimal desires."
    },
    {
      "id": "5661",
      "title": "Step Down Close",
      "body": "This close is used after an order is all but lost and you want to go for part of the sale instead of losing all of it."
    },
    {
      "id": "5662",
      "title": "No “Ifs”",
      "body": "There is NO room for “If’s” in your Demo’s. What do we mean by doing a demo without saying “if?” I mean, you never say;  “If you have this problem, then... “Or “If you struggle with this issue then you’ll like this feature.” If you are saying “if” in a demo, you’re doing them wrong.  You should know their problems before demoing."
    },
    {
      "id": "5663",
      "title": "Be Bold",
      "body": "The higher the stakes, the more you must be willing to walk away."
    },
    {
      "id": "5664",
      "title": "Delays and Bugs",
      "body": "The first few months of a product after the intended release are going to be filled with bugs and delays.  Make sure that the customers have accurate expectations of what you are delivering."
    },
    {
      "id": "5665",
      "title": "Felt",
      "body": "Sales rep  In fact, this customer I just worked with, Steve, felt the exact same way as you do.  Again, this not only demonstrates empathy, but also makes the prospective customer feel more comfortable in the knowledge that he or she is not the only one who has felt this way before."
    },
    {
      "id": "5666",
      "title": "Found",
      "body": "Sales rep  I demonstrated X to Steve and he soon found that the we could not only solve all the issues he was facing, but even made his life easier in these other areas.  The ‘found’ part of this methodology is critical. For starters, referring to a specific customer provides social proof – if other people are finding success with it, this skeptic will be more convinced."
    },
    {
      "id": "5667",
      "title": "Feel",
      "body": "Sales rep  “I understand how you feel.” Saying this demonstrates empathy and shows that you heard what the prospective customer is saying and that you can relate."
    },
    {
      "id": "5668",
      "title": "Pre-Business Development",
      "body": "Pre-selling should truly be called business development because you are creating a partnership with a future buyer and working with them to accomplish both your needs.  Involve your audience in coming up with the idea for your product."
    },
    {
      "id": "5669",
      "title": "Niche",
      "body": "Only pre-sale to one market.  If you pre-sale to many different markets you won’t be able to catch up with all the different feature requests you get.  "
    },
    {
      "id": "5670",
      "title": "Impending Event Close",
      "body": "Note  Don’t use lies to create an impending event close."
    },
    {
      "id": "5671",
      "title": "Prospect",
      "body": "Names of people or organizations to which you are marketing who have not yet responded to you.  Goal is to get their attention and get them to respond."
    },
    {
      "id": "5672",
      "title": "Limit # Presales",
      "body": "Limit the number of pre-sales so that there is scarcity but so you don’t overcommit.  Overcommitting can cause troubles because your pre-sales should be a temporary validation and cash flow tool and should not be scalable.    "
    },
    {
      "id": "5673",
      "title": "Hat-in-Hand Close",
      "body": "Last resort close.  Only works to close 20% of time, usually when customer hasn’t been vulnerable enough with you.  "
    },
    {
      "id": "5674",
      "title": "Be Realistic",
      "body": "It’s incredibly vital but also incredibly tough to pre-sale.  90% of people will decide they can wait for the finished product.  Keep your expectations reasonable.  Realize it doesn’t need to be scalable.  "
    },
    {
      "id": "5675",
      "title": "Trust",
      "body": "It requires a lot of trust for companies to pre-purchase a product that cannot be delivered.  This trust can either be achieved through 1. Pre-existing relationship, 2. Social Proof, 3. Back and forth communication centered around the core problem, 4. Money Back Guarantee."
    },
    {
      "id": "5676",
      "title": "Hacked Solution",
      "body": "Is the problem painful enough that they have hacked together a solution?"
    },
    {
      "id": "5677",
      "title": "When You Shouldn’t Pre-Sell",
      "body": "If you don’t think you can follow through with the commitment.  If you aren’t sure whether you can hit your deadline.  If you have very impatient customers.  If you are 100% someone will buy."
    },
    {
      "id": "5678",
      "title": "How Questions",
      "body": "How questions are questions that get to how a buyer does something. How questions allow the sales person to find the real opportunities for the sale. If you want to understand where the opportunities are for your product or service, start asking questions that break down their approaches or processes.  How do they do what they do today. Where are the inefficiencies? Where do they struggle? What frustrates them? What processes create road blocks? Would you mind sharing how you . . .?"
    },
    {
      "id": "5679",
      "title": "Acquisition Costs",
      "body": "How difficult is it to acquire them as customers?"
    },
    {
      "id": "5680",
      "title": "Make them Earn the Purchase",
      "body": "Don’t make it clear that they can buy from you.  Example  “We are really busy with customers so you have time to decide but…will you tell me about your business and let’s figure out if there is overlap”"
    },
    {
      "id": "5681",
      "title": "Two for One",
      "body": "Do two free things for someone before you ever ask them to do one thing for you.  "
    },
    {
      "id": "5682",
      "title": "Acknowledgement of Problem",
      "body": "Do they understand they have a problem?"
    },
    {
      "id": "5683",
      "title": "Problem Match",
      "body": "Do they have a problem that you can currently solve?  How long would it take to adapt your product/service to their needs?"
    },
    {
      "id": "5684",
      "title": "Budget Available",
      "body": "Do the have the funds to quickly purchase your solution?"
    },
    {
      "id": "5685",
      "title": "When Not to Give a Demo",
      "body": "Before you qualify.  If a presentation will do.  If you can’t afford to because your product cost is too low."
    },
    {
      "id": "5686",
      "title": "Take Interest",
      "body": "Be the first in a conversation to start asking questions.  Be a problem solver and a promoter.  Research them ahead of time.  "
    },
    {
      "id": "5687",
      "title": "Nice not Needy",
      "body": "Be nice not needy.  Tell people you really enjoy talking to them but don’t say things that infer that their time is more valuable than your time.  Refrain from saying thank you, I really appreciate, or I apologize (unless you’ve done something terribly wrong).    "
    },
    {
      "id": "5688",
      "title": "Assumptive Close",
      "body": "Assume your customer has said yes."
    },
    {
      "id": "5689",
      "title": "Advice, Not Money",
      "body": "Ask for money and you will get advice, ask for advice and you will get money."
    },
    {
      "id": "5690",
      "title": "Searching for Solution",
      "body": "Are they actively searching for a solution?"
    },
    {
      "id": "5691",
      "title": "Customer",
      "body": "An opportunity that starts giving you money but has not yet achieved success.  Goal is to get them to success in the product/service.  "
    },
    {
      "id": "5692",
      "title": "Follow Up",
      "body": "After you give your narrative for 20 min, ask them to pitch you.  They will be unprepared, stumble, and lose ground, creating an imbalance in their social status."
    },
    {
      "id": "5693",
      "title": "Leads",
      "body": "A prospect that has responded positively in some way to show interest in what you have to offer.  Goal is to respond to them quickly."
    },
    {
      "id": "5694",
      "title": "Marketing Qualified Lead (MQL)",
      "body": "A lead that you are not sure is a good fit (meets customer profile) and you don’t know what they are looking for.  Goal is to qualify them by asking lots of questions and get them to a demo.  "
    },
    {
      "id": "5695",
      "title": "Opportunities",
      "body": "A lead that is a good fit, has a sense of urgency, but still has a couple questions or concerns.  Goal is to handle concerns, guarantee, and close.  "
    },
    {
      "id": "5696",
      "title": "Sales Qualified Lead (SQL)",
      "body": "A lead that is a good fit (meet customer profile) and you know their hot buttons (criteria for success) but they don’t have a sense of urgency.  Goal is to demo, educate and instill a sense of URGENCY.  "
    },
    {
      "id": "5697",
      "title": "Champion/Promoter",
      "body": "A customer that has reached success and has referred your business, offered testimonials or actively supported you in some way.  Goal is to encourage them to spread the word about your product.  "
    },
    {
      "id": "5698",
      "title": "Detractor",
      "body": "A customer that has had a negative experience.  Goal is to rescue them and help get them to success.  "
    },
    {
      "id": "5699",
      "title": "Alternate Choice Close",
      "body": "“Would you like to go with Option A or B?”"
    },
    {
      "id": "5700",
      "title": "Respond With  ",
      "body": "“What is clear here is we are… I need to understand where you guys are…  If you want this other solution, just tell me and we will help you connect to them…if you want the best, let us know and we will get you our solution.”"
    },
    {
      "id": "5701",
      "title": "Assumptive Close",
      "body": "“We’re in agreement so let’s go ahead…all you have to do is enter your…”"
    },
    {
      "id": "5702",
      "title": "Impending Event Close",
      "body": "“We are closing our beta round, can we get you signed up before we are full?”"
    },
    {
      "id": "5703",
      "title": "Impending Event Close",
      "body": "“To avoid missing your deadline, can we signup?”"
    },
    {
      "id": "5704",
      "title": "Old Faithful Close",
      "body": "“Is there anything else we should do before starting.”"
    },
    {
      "id": "5705",
      "title": "Upfront Contracts",
      "body": "“If we can do A, will you do B.”"
    },
    {
      "id": "5706",
      "title": "Pre-Sale Script",
      "body": "“I think we can both agree that our product is going to be the perfect solution for your problem. As of right now, we’re about <projected timeline> away from completion, and that final product will be about <projected price>.  But that’s why I wanted to reach out to you. If you’d be willing to make a <price> deposit today, I can give you …, and we’ll be able to speed the development up by <shortened timeline>.  Furthermore, we’ll be communicating directly with anyone who preorders, so your feedback will help shape the final product.  The catch is…  In case anything goes wrong, your deposit is 100% refundable. No risk, high reward. What do you say?”"
    },
    {
      "id": "5707",
      "title": "Summary Close",
      "body": "“I have you your scope, cost, and basic information, are you okay with me authorizing this.”"
    },
    {
      "id": "5708",
      "title": "Hat-in-Hand Close",
      "body": "“I accept your decision.  It’s been my experience that when a customer doesn’t sign up my offer wasn’t good, or I did something wrong.  You said the offer wasn’t bad, can you help me improve for next time by knowing what I did wrong?”"
    },
    {
      "id": "5709",
      "title": "Step Down Close",
      "body": "“I accept your decision and totally understand.  Would you be okay with us (doing some smaller scope of work)?”"
    },
    {
      "id": "5710",
      "title": "Old Faithful Close",
      "body": "“Have you got yourself sold, or go you still have questions.”"
    },
    {
      "id": "5711",
      "title": "Just Ask For It Close",
      "body": "“Do I have your approval to proceed?”  “Are we okay signing you up now.”"
    },
    {
      "id": "5712",
      "title": "Narrative",
      "body": "“The world is changing, it used to be…, now a days ….  It is going to affect every business.  People who don’t adapt to this kind of change will lose their jobs and companies, look at…  We have a solution…  By implementing this you can ...  Companies that adapt to change are going to be able to outperform us all…let’s not let them do that."
    },
    {
      "id": "5713",
      "title": "Assumptive Close",
      "body": "“I can sense this is a priority…I will get you signed up.”"
    },
    {
      "id": "5714",
      "title": "How did you hear about us?",
      "body": " "
    },
    {
      "id": "5715",
      "title": "How do you guys feel about us? How are we doing?",
      "body": " "
    },
    {
      "id": "5716",
      "title": "If you don’t choose us what would you do?",
      "body": " "
    },
    {
      "id": "5717",
      "title": "Trial Close / Anchoring",
      "body": " "
    },
    {
      "id": "5718",
      "title": "What are other products or solutions that you are currently using?",
      "body": " "
    },
    {
      "id": "5719",
      "title": "What do you need to have and what is nice to have?  Must have, need, nice to have?",
      "body": " "
    },
    {
      "id": "5720",
      "title": "What is timeline to making decision?",
      "body": " "
    },
    {
      "id": "5721",
      "title": "What’s the decision-making process like?",
      "body": " "
    },
    {
      "id": "5722",
      "title": "What’s your budget?",
      "body": " "
    },
    {
      "id": "5723",
      "title": "When was the last time you bought a solution like this?",
      "body": " "
    },
    {
      "id": "5724",
      "title": "Who are all the stakeholders going to be involved?",
      "body": " "
    },
    {
      "id": "5725",
      "title": "Who else are you comparing us with?",
      "body": " "
    },
    {
      "id": "5726",
      "title": "How to Master the Art of Selling by Tom Hopkins",
      "body": ""
    },
    {
      "id": "5727",
      "title": "How to Win Friends and Influence People  by Dale Carnegie",
      "body": ""
    },
    {
      "id": "5728",
      "title": "Influence by Robert B. Cialdini",
      "body": ""
    },
    {
      "id": "5729",
      "title": "Little Red Book of Selling by Jeffrey Gitomer",
      "body": ""
    },
    {
      "id": "5730",
      "title": "Oren Klaff - www.pitchanything.com",
      "body": ""
    },
    {
      "id": "5731",
      "title": "Secrets of Closing the Sale by Zig Zigler",
      "body": ""
    },
    {
      "id": "5732",
      "title": "Secrets of Question Based Selling by Thomas Freese",
      "body": ""
    },
    {
      "id": "5733",
      "title": "SHiFT Selling by Craig Elias and Tibor Shanto",
      "body": ""
    },
    {
      "id": "5734",
      "title": "SPIN Selling by Neil Rackham",
      "body": ""
    },
    {
      "id": "5735",
      "title": "The Art of War  by Sun Tzu",
      "body": ""
    },
    {
      "id": "5736",
      "title": "The Challenger Sale by Matthew Dixon and Brent Adamson",
      "body": ""
    },
    {
      "id": "5737",
      "title": "The Definitive Book of Body Language by Barbara Pease",
      "body": ""
    },
    {
      "id": "5738",
      "title": "The Psychology of Selling by Brian Tracy",
      "body": ""
    },
    {
      "id": "5739",
      "title": "Traction by Gabriel Weinberg",
      "body": ""
    }
  ]
}

