{
  "subject": "SIMPLICITY CHECKLIST",
  "credit": "SIMPLICITY CHECKLIST",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "5750",
      "title": "10x",
      "body": "The only meaningful change is something that is 10x the improvement of the past.  "
    },
    {
      "id": "5751",
      "title": "Keep Ship Moving",
      "body": "Only when people are kept in constant motion do they stay focused with the right kind of intensity.  Work isn't supposed to be easy it is supposed to be gratifying.  Always be working on the next version so that you stay 10x ahead of your competitor."
    },
    {
      "id": "5752",
      "title": "Skeuomorphism",
      "body": "Interface elments that relate back to real world objects (ex file folder)"
    },
    {
      "id": "5753",
      "title": "How to Have an Effective Meeting",
      "body": "1. Throw out the least necessary person there, 2. Walk out if it lasts more than 30 minutes, 3. Do something productive to make up for the time you lost meeting."
    },
    {
      "id": "5754",
      "title": "Analytics & People",
      "body": "You must digest every bit of information you can gather but remember that at the end of the day, technology is about making people's lives better.  "
    },
    {
      "id": "5755",
      "title": "Hard Reset",
      "body": "You can be harsh on people but never let it carry from one encounter to the next."
    },
    {
      "id": "5756",
      "title": "Small Groups",
      "body": "Work in small groups of preferably 5 or less.  The more people, you invite, the more you are inviting complexity to take a seat at the table.  "
    },
    {
      "id": "5757",
      "title": "Process & Efficiency Kill Ideas",
      "body": "When companies limit themselves to strict processes they limit the creative output of the team.  Creativity sometimes takes inefficiency.  "
    },
    {
      "id": "5758",
      "title": "Work Group Size Theory",
      "body": "The quality of work resulting from a project is inversely proportional to the number of people involved in the project."
    },
    {
      "id": "5759",
      "title": "Leader Participation Theory",
      "body": "The quality of work from a project increases in direct proportion to the degree of involvement by the ultimate decision maker."
    },
    {
      "id": "5760",
      "title": "Brevity",
      "body": "The more words you use, the less you know what you are talking about.  Lay out the facts and start the discussion."
    },
    {
      "id": "5761",
      "title": "Packaging/Presentation",
      "body": "The first contact with your product or company is the foundation of setting up the customer's experience."
    },
    {
      "id": "5762",
      "title": "Simplicity Attracts",
      "body": "Taking time to find simply the best will attract others.  "
    },
    {
      "id": "5763",
      "title": "Simple Champion",
      "body": "Simplicity requires a champion to stand up for its principles.  Don't be talked into going along with something when you know it can be better.  There is no almost when it comes to simplicity."
    },
    {
      "id": "5764",
      "title": "Simple Experience",
      "body": "Simplicity in the experience is just as important as simplicity in the product.  "
    },
    {
      "id": "5765",
      "title": "Simple Isn't Always Easier",
      "body": "Simpler often requires more time, money, and energy to deduce an object to its purest form."
    },
    {
      "id": "5766",
      "title": "Marketing is Values",
      "body": "Sell values, experiences, and emotions, not products.  "
    },
    {
      "id": "5767",
      "title": "Simple Naming",
      "body": "Product naming requires you to capture in one or two words the complete essence of the product.  "
    },
    {
      "id": "5768",
      "title": "Power of One",
      "body": "One is the simplest number.  The further you get from one, the more complicated things get (ex iPhone button)."
    },
    {
      "id": "5769",
      "title": "Proliferation",
      "body": "Many companies can't stop themselves from responding to every opportunity.  "
    },
    {
      "id": "5770",
      "title": "One in One Out",
      "body": "Limit the size of your company and work groups.  Once it reaches capacity, someone must go before someone can come in."
    },
    {
      "id": "5771",
      "title": "Make it Stick",
      "body": "Keeping it simple is the best way to make a point stick (ex  throwing one ball at someone versus throwing five balls at someone and they don't catch anything)."
    },
    {
      "id": "5772",
      "title": "Knowledge Spillover",
      "body": "Innovation comes from people running into different people and sharing ideas.  Make sure that each one is completely necessary.  "
    },
    {
      "id": "5773",
      "title": "Sophisticated Pricing",
      "body": "If your buyer is sophisticated, you always want to be the second cheapest option, not the cheapest."
    },
    {
      "id": "5774",
      "title": "Focus",
      "body": "Focus on one thing and don't get distracted by anything else.  Focus means saying no to the hundred almost good ideas.  You must actively resist the urge to make many products just because you can.  "
    },
    {
      "id": "5775",
      "title": "Brand Is Bank Account",
      "body": "Everytime you do something good you deposit, everytime you do something bad you withdrawal.  "
    },
    {
      "id": "5776",
      "title": "Mercy Invitation",
      "body": "Everyone in the room should be there for a reason.  There is no such thing as a mercy invitation.  Politely ask people to leave if they aren't supposed to be there.  "
    },
    {
      "id": "5777",
      "title": "Speak Human",
      "body": "Don't talk technology unless you are in a room of nerds only.  Describe your products for what they do, not how the work or their specifications (ex '6.5 oz 5GB music player' v. '1,000 songs in your pocket)."
    },
    {
      "id": "5778",
      "title": "Uncomfortable Pause",
      "body": "Disappointment can be displayed twice as effectively as a long pause and stare than in words."
    },
    {
      "id": "5779",
      "title": "Experience",
      "body": "Control the entire experience.  Only outsource items that you know you can trust the company to have higher standards than you would."
    },
    {
      "id": "5780",
      "title": "Blunt v. Meandering",
      "body": "Being blunt is simplicity in practice, meandering is complexity.  Don't beat around the bush.  (ex 'the work you showed me last week was awful, I knew it was awful, you knew it was awful')"
    },
    {
      "id": "5781",
      "title": "Partners and Alliances",
      "body": "Be really good at attracting people to work with and to partner with.  "
    },
    {
      "id": "5782",
      "title": "Be Casual",
      "body": "Avoid 'Big-Company' mentality.  Make things informal.  Use conversations, not slick presentations.  "
    },
    {
      "id": "5783",
      "title": "Publicity",
      "body": "Any publicity is good publicity."
    },
    {
      "id": "5784",
      "title": "Aim Realistically High",
      "body": "Aim high but make sure that you can deliver what you promise."
    }
  ]
}

