{
  "subject": "Special Ops Checklist",
  "credit": "Special Ops Checklist",
  "topic": "Grit",
  "todos": [
    {
      "id": "5827",
      "title": "Purpose",
      "body": "Understanding the objective and being willing to complete it regardless of the emerging obstacles.  "
    },
    {
      "id": "5828",
      "title": "Relative Superiority",
      "body": "Smaller attacking force gains a decisive advantage over a larder or well-defended enemy.  Must be gained early in the engagement.  If relative superiority is lost, it is difficult to regain."
    },
    {
      "id": "5829",
      "title": "Six Principles of Special Operations",
      "body": "Simplicity, Security, Repetition, Surprise, Speed, Purpose."
    },
    {
      "id": "5830",
      "title": "Security",
      "body": "Preventing other side from gaining an advantage through foreknowledge of the impending attack.  Be careful who you share information with because it can get to the other side.  Security should be as tight as possible without impending planning or preparation.  "
    },
    {
      "id": "5831",
      "title": "Four Phases of Operation",
      "body": "Planning (simplicity), preparation (security and repetition), execution (surprise, speed, purpose), debriefing."
    },
    {
      "id": "5832",
      "title": "Simplicity",
      "body": "Limiting number of objectives, good intelligence (allows you to reduce the size of resources to only what is necessary), and innovation (allows you to avoid or eliminate obstacles or constraints).  "
    },
    {
      "id": "5833",
      "title": "Speed",
      "body": "In most cases, relative superiority is gained within five minutes of vulnerability point (when you begin to directly compete or attack).  Speed requires being small and lightly armed.  "
    },
    {
      "id": "5834",
      "title": "Repetition",
      "body": "Hones in individual and unit/team skills.  It includes full dress rehearsals.  "
    },
    {
      "id": "5835",
      "title": "Surprise",
      "body": "Gained through deception, distraction, confusion, delaying response, timing, and taking advantage of vulnerabilities.  Surprise does not alone give you the advantage."
    },
    {
      "id": "5836",
      "title": "Elements to sustain relative superiority",
      "body": "Courage, intellect, boldness, and perseverance."
    },
    {
      "id": "5837",
      "title": "Innovation",
      "body": "Includes new technology or unconventional tactics."
    }
  ]
}

