{
  "subject": "Traction Checklist",
  "credit": "Traction Checklist",
  "topic": "Organizational Growth",
  "todos": [
    {
      "id": "6139",
      "title": "3 year goals",
      "body": "what it feels and looks like to work at the company in three years and what type of numbers you are hitting"
    },
    {
      "id": "6140",
      "title": "People Analyzer",
      "body": "Put your core values and decide how to hire, fire, and promote base on your core values.  "
    },
    {
      "id": "6141",
      "title": "Weekly (or monthly) scorecard measurable",
      "body": "numbers you should track each week (think if you were a CEO on vacation and someone came to you and handed you only a sheet of numbers about your business, what would need to be on there for you to determine if you stay an extra week or need to head home)."
    },
    {
      "id": "6142",
      "title": "Process",
      "body": "Must be consistent.  Have a process for HR, marketing, sales, operations, accounting, customer retention, etc.  Document 20% of process that adds most value.  Simplifying processes help determine where outsourcing and technology can be applied."
    },
    {
      "id": "6143",
      "title": "Three aspects of business",
      "body": "Innovation, Marketing, Operations.  "
    },
    {
      "id": "6144",
      "title": "90 day rocks",
      "body": "Include 3-5 medium projects you want to accomplish in each quarter that get you to your 1 year goal (we are in Q2 - April to June).  It's okay to punt a rock.  You get more done with less goals.  Don't switch or replace a rock mid session.  Part of rocks is setting up trust in an organization so that all team members know you are sticking to what you say you will.  "
    },
    {
      "id": "6145",
      "title": "Set and Forget",
      "body": "In time you will be so good at setting goals that you will be able to set them and forget them (in other words, it's not a great practice to be constantly changing your goals mid-term)."
    },
    {
      "id": "6146",
      "title": "Goal Terms",
      "body": "Goals should be in 10y, 3y, 1y, 90day, and 1week, 1day"
    },
    {
      "id": "6147",
      "title": "Goal Types",
      "body": "Goals can be measured by yes or no (project oriented goals such as Implementing CRM) or by numbers (quantitative goals such as on-board 25 customers)"
    },
    {
      "id": "6148",
      "title": "1 year goals",
      "body": "Focused on big picture projects, project development milestones, fundraising, cash flow, revenue, profit, customers, etc. that get you to your 3 year goal"
    },
    {
      "id": "6149",
      "title": "Vision Traction Organizer",
      "body": "Find at www.eosworldwide.com/vto.  Core Values, Core Focus, 3 year picture, 10 year target, marketing strategy, 1 year plan, rocks, issue list."
    },
    {
      "id": "6150",
      "title": "Scorecard",
      "body": "Column for who is responsible, the measurable number (revenue, cash, sales calls, meetings, proposals, closed business, payroll, customer problems, customer rating, AR, AP, etc.), the goal, the actual weekly numbers."
    },
    {
      "id": "6151",
      "title": "Things you need",
      "body": "Clear vision, core values, process, target market, butts in right seats, accountability chart, transparency, rocks, consistent meeting time, document process, customer feedback, employee feedback, leadership feedback, scorecard, everyone has their number, budget."
    },
    {
      "id": "6152",
      "title": "10 year goals",
      "body": "Big hairy audacious dreams"
    },
    {
      "id": "6153",
      "title": "Prioritization",
      "body": "All goals should be prioritized, meaning the most important are listed first and you always work on the most important first (there is a common misconception that the most important goals should be reactive items like putting out fires but instead they should be proactive so that you will never have fires)"
    },
    {
      "id": "6154",
      "title": "Vision",
      "body": "8 questions shared by all.  "
    },
    {
      "id": "6155",
      "title": "Daily high pay off activities or high value targets (HPA/HVT)",
      "body": "3-5 tasks you want to get done each day to help achieve your weekly scorecards and quarterly rocks"
    },
    {
      "id": "6156",
      "title": "Six Components",
      "body": "You should only focus on six things in your business.  Vision, data, process, traction, people, issues."
    },
    {
      "id": "6157",
      "title": "Rocks",
      "body": "You should have company rocks and individual rocks."
    },
    {
      "id": "6158",
      "title": "Core Value Size",
      "body": "You should have 3-5 core values."
    },
    {
      "id": "6159",
      "title": "Only One",
      "body": "You can only have one operating system."
    },
    {
      "id": "6160",
      "title": "Target market",
      "body": "Who are they (demographic), where are they (geographic), and what are they (psychographic).  Ex   Our target market is under 40 year old people in innovation or technology in strong startup markets that are focused on outbound selling or recruiting to a narrow market and selling and recruiting isn't their core competency."
    },
    {
      "id": "6161",
      "title": "Distractions",
      "body": "When  business owners get bored there is temptation to follow shiny stuff and distract from their mission. Don't get distracted.  When practices, people, and products don't fit into your core focus, get rid of them.  "
    },
    {
      "id": "6162",
      "title": "3 ' Year Picture",
      "body": "What does it feel like, look like, to work at company."
    },
    {
      "id": "6163",
      "title": "Scorecard",
      "body": "Weekly report containing 15 high level numbers for organization."
    },
    {
      "id": "6164",
      "title": "10 Commandments of Issues",
      "body": "Thou shalt not rule by consensus, thou shalt not be a weenie, thou shalt be decisive, thou shall not rely on secondhand info, thou shall fight for the greater good, though shalt not try to solve all issues, just the most important first, though shall live with it, end it or change, though shall chose short term pain over long term, though shalt entre the danger, though shalt take a shot and not wait around for someone else to solve the issue."
    },
    {
      "id": "6165",
      "title": "Fewer Rocks & Goals",
      "body": "Those who try to accomplish less accomplish more (focus)."
    },
    {
      "id": "6166",
      "title": "Two HR Problems",
      "body": "The only two HR problems are having the right person (great fit for culture and values) in the wrong seat (cannot do their job or be accountable at the level needed) and wrong person (horrible fit for the culture and rubs others wrong) in the right seat (great at their job and gets shit done).  Both must go!!"
    },
    {
      "id": "6167",
      "title": "Team",
      "body": "The most important thing about a team is to get everybody rowing in the same direction.  "
    },
    {
      "id": "6168",
      "title": "Clarity Break",
      "body": "Take a break from your mind churning so it can reset.  Take a technology break.  Escape the office."
    },
    {
      "id": "6169",
      "title": "Business plan",
      "body": "Should be no more than 2 pages.  "
    },
    {
      "id": "6170",
      "title": "Prediction",
      "body": "Short term (under 90 days) long term (over 90 days)."
    },
    {
      "id": "6171",
      "title": "Leap of faith",
      "body": "Required before you can successfully grow.  If you're not growing or improving you are dying."
    },
    {
      "id": "6172",
      "title": "Meetings",
      "body": "Quarterly (offsite), annual (offsite), weekly (onsite).  Each should have an agenda (even if handwritten), segue, go over scorecards, rocks, team health, customer headlines, to-do, issues, conclude.  Meetings should be at a consistent time.  Provide food if people talk to much.  "
    },
    {
      "id": "6173",
      "title": "People analyzer",
      "body": "Put list of people in the left column and core values across the top.  Rate each person on that list. Set 'the bar' which is the minimal acceptable value."
    },
    {
      "id": "6174",
      "title": "Mushrooms",
      "body": "Problems are like mushrooms.  When it's dark and rainy they grow exponentially."
    },
    {
      "id": "6175",
      "title": "Three types of issues",
      "body": "Problem needs to be solved, information that needs to be communicated an agreed upon, idea that needs feedback or green light."
    },
    {
      "id": "6176",
      "title": "Transparency",
      "body": "Prevents issues from holding you back."
    },
    {
      "id": "6177",
      "title": "GWC",
      "body": "People must get it (understand), want it, and have capacity (skills, resources, background) to do it.  Must have all three.  "
    },
    {
      "id": "6178",
      "title": "Guarantee",
      "body": "Not all businesses are suited for guarantees but it's a great way to pinpoint an industry wide problem and destroy it.  Ex   If you can collect the same amount of data in even one-tenth the time it takes our program, we will give you your money back.  "
    },
    {
      "id": "6179",
      "title": "People",
      "body": "Need to be in the right seats in the company doing the things that they are most skilled and have the greatest chance of success at.  It doesn't help the organization to put someone in the wrong seat and get frustrated at them that they are not performing.  "
    },
    {
      "id": "6180",
      "title": "Issues",
      "body": "List of the problems you are going to run into, concerns, obstacles, and opportunities.  You must admit your own mistakes in order to get people to confess theirs."
    },
    {
      "id": "6181",
      "title": "Issues",
      "body": "List and prioritize your issues.  Meetings should be focused on discussing and knocking down forever these issues."
    },
    {
      "id": "6182",
      "title": "Rocks",
      "body": "Limit to 3 to 5.  Rocks are biggest priorities.  Everything else (sand) will fall into place.  Do not rush setting rocks.  Commit to the rocks.  "
    },
    {
      "id": "6183",
      "title": "KISS",
      "body": "Keep it simple stupid."
    },
    {
      "id": "6184",
      "title": "Decision",
      "body": "It is more importation that you decide than what you decide.  More is lost by indecision than by wrong decisions.  Though shall not rule by consensus."
    },
    {
      "id": "6185",
      "title": "Visionary",
      "body": "In charge of R&D, creative problem solving, relationships, culture, selling."
    },
    {
      "id": "6186",
      "title": "Integrator",
      "body": "In charge of leading, managing, and holding people accountable."
    },
    {
      "id": "6187",
      "title": "Marketing Strategy",
      "body": "If you try to please everyone you are going to lose.  Focus and sell and close more of the right kind of business.  Not a bunch of one of things."
    },
    {
      "id": "6188",
      "title": "36 Hours of Pain",
      "body": "If someone is not in the right seat, you will have 36 hours of pain as you move or fire them and then everything will be dramatically better."
    },
    {
      "id": "6189",
      "title": "Reasons issues don't get solved",
      "body": "Fear of conflict, lack of focus, lack of discipline, lack of commitment, personal ego.  Plan to get uncomfortable."
    },
    {
      "id": "6190",
      "title": "Politicking",
      "body": "Everyone should get to say what they believe once.  If you say it more than once you are politicking."
    },
    {
      "id": "6191",
      "title": "Everyone has a number",
      "body": "Everybody should be tracking one number.  Numbers cut through murky communication, create accountability, create clarity, create completion, produce results, create teamwork, solve problems faster.  Time can be a number as well."
    },
    {
      "id": "6192",
      "title": "Scorecard",
      "body": "Error on the side of putting more items to track than less."
    },
    {
      "id": "6193",
      "title": "Accountable Roles",
      "body": "Each person should have 5 accountable roles."
    },
    {
      "id": "6194",
      "title": "Process",
      "body": "Document and agree on company processes.  Processes should be simple and focus on the top 20% of steps (not the 80%).  "
    },
    {
      "id": "6195",
      "title": "Three Strike Rule",
      "body": "Discuss the issue and expectation with person, give them 30 days, if you don't see improvement, repeat first step, if you don't see improvement again, terminate that person.  "
    },
    {
      "id": "6196",
      "title": "Delegate",
      "body": "Delegate and elevate."
    },
    {
      "id": "6197",
      "title": "Core Focus",
      "body": "Decide what business you want to be in and be in that business.  Includes you passion and niche.  Should be in three to seven words, simple language, big and bold, aha effect, comes from the heart, involves everyone, not about money, bigger than any goal.  Ex   We help people find other people to do business."
    },
    {
      "id": "6198",
      "title": "Goals",
      "body": "10 year plan, 3 year plan, 1 year plan, 90 day rocks.  Less is more.  Don't try to accomplish too much or you won't get anything done."
    },
    {
      "id": "6199",
      "title": "Difference",
      "body": "'Let me show you how we have accomplished great results for companies like yours.  We have a proven process that we follow called The (insert your name) difference."
    },
    {
      "id": "6200",
      "title": "Mature Startup",
      "body": "'If you are looking for that, we probably aren't the best to help you but let me show you who is.'"
    },
    {
      "id": "6201",
      "title": "Bigger isn't better.  A $10 million company with 20% profit is the same as a $100 million company with 2% profit.",
      "body": "-"
    }
  ]
}

