{
  "subject": "Traction Marketing Checklist",
  "credit": "Traction Marketing Checklist",
  "todos": [
    {
      "id": "6202",
      "title": "Law of Shitty Click Throughs",
      "body": "Over time all marketing channels get saturated.  Past tactics may become crowded and ineffective.  "
    },
    {
      "id": "6203",
      "title": "Email Marketing Software",
      "body": "customer.io, MailChimp, Constant Contact  "
    },
    {
      "id": "6204",
      "title": "Hypercompetitive Market",
      "body": "You build something people want but a lot of other companies are building it too so it is tough to get customers to pay good margins."
    },
    {
      "id": "6205",
      "title": "Existing Platforms",
      "body": "Web sites or apps with huge numbers of users that you can plug into.  "
    },
    {
      "id": "6206",
      "title": "Validation through Search Engine Marketing",
      "body": "Validating your product through messaging and keywords you use in AdWords.  "
    },
    {
      "id": "6207",
      "title": "Underutilized Channels",
      "body": "Usually the most underutilized traction channels are the most promising ones."
    },
    {
      "id": "6208",
      "title": "Feeder Sites",
      "body": "Use feeder sites to test your message before your product is complete.  "
    },
    {
      "id": "6209",
      "title": "Standard Partnership",
      "body": "Two companies work together to make one or both of their products better.  Ex. Apple/Nike."
    },
    {
      "id": "6210",
      "title": "Joint Ventures",
      "body": "Two companies work together to create an entirely new product or venture."
    },
    {
      "id": "6211",
      "title": "Offline Ads",
      "body": "TV, radio, billboards, infomecials, newspaper, magazine, flyers."
    },
    {
      "id": "6212",
      "title": "Publicity",
      "body": "Traditional media outlets.  Start small.  Large outlets get news and pickup stories from smaller outlets.  Reach out to reporters to tell them about your articles.  Use sites like HARO (Help a Reporter Out).  Submit story to link sharing sites (reddit, Hacker News).  Share story on social networks.  Email story to influencers.  Ping blogs about your story.  "
    },
    {
      "id": "6213",
      "title": "No Real Market",
      "body": "They want it but won’t pay enough for it to cover the bills."
    },
    {
      "id": "6214",
      "title": "Narrow Market",
      "body": "They want it but there are not enough customers to reach profitability."
    },
    {
      "id": "6215",
      "title": "Targeting Blogs",
      "body": "Target blogs and join their conversation through promotion of your product.  Worked for Codeacademy, Mint, and reddit.  "
    },
    {
      "id": "6216",
      "title": "Startup Success",
      "body": "Startups don’t just take off, their founders make them take off.  They have to recruit users manually.  They can’t wait for users to come to them, they have to go out and get them.  "
    },
    {
      "id": "6217",
      "title": "Dropbox Example",
      "body": "Started marketing with search engine marketing but were spending $230 to acquire a $99 customer.  They switched to viral marketing, using a built-in referral program.  "
    },
    {
      "id": "6218",
      "title": "50 Percent Rule",
      "body": "Spend 50% of the time on product and 50% of the time on traction.  The biggest mistakes startups make is failing to pursue traction in parallel with product development.  "
    },
    {
      "id": "6219",
      "title": "Offline Events",
      "body": "Small meetups to large conferences.  Particularly effective for startups with long sales cycles.  "
    },
    {
      "id": "6220",
      "title": "Infographics",
      "body": "Shared 20 times more than articles."
    },
    {
      "id": "6221",
      "title": "Milestones",
      "body": "Set milestones to achieve your traction goals.  They need not be the same metrics as the goal but help lead towards the goal.  "
    },
    {
      "id": "6222",
      "title": "Finding Blogs",
      "body": "Search “top blogs for x”, search on YouTube and find influencers that create videos, delicious website, twitter, social mention site, ask around."
    },
    {
      "id": "6223",
      "title": "Coupon Sites",
      "body": "RetailMeNot, CouponCabin, Brad’s Deals, SlickDeals offer discounts to visitors.  "
    },
    {
      "id": "6224",
      "title": "Hard to Reach Market",
      "body": "Reaching people is cost prohibitive, you have an inexpensive product that requires a direct sales force to sell."
    },
    {
      "id": "6225",
      "title": "Cost Per Point",
      "body": "Radio ads are priced at a cost to reach 1 percent of the radio station’s listeners."
    },
    {
      "id": "6226",
      "title": "Microsites",
      "body": "Put them on their own domain.  "
    },
    {
      "id": "6227",
      "title": "Unconventional PR",
      "body": "Publicity stunts and customer appreciation (holding contests, sending handwritten notes).  Must be bold, edgy, buck the system, bend the rules (without breaking them).  "
    },
    {
      "id": "6228",
      "title": "Direct Mail Advice",
      "body": "Provide self addressed envelope, hand write envelopes, have a clear action you want them to take."
    },
    {
      "id": "6229",
      "title": "Marketing Process",
      "body": "Promote a purpose, sell a process, make money from the accompanying technology and support.  "
    },
    {
      "id": "6230",
      "title": "Guest Posting",
      "body": "Posting on other site’s blogs."
    },
    {
      "id": "6231",
      "title": "Content Marketing",
      "body": "Posting lots of content, usually via blogs.  After every post, ping influencers for feedback.  Engage with customers by writing useful answers on targeted forums like Quora.  If you blog, dedicate atleast 6 months to it.  "
    },
    {
      "id": "6232",
      "title": "Fat Head Keyword",
      "body": "Popular searches that directly describe your company.    "
    },
    {
      "id": "6233",
      "title": "Click Through Rate",
      "body": "Percentage of ad impressions that result in clicks to your site.  "
    },
    {
      "id": "6234",
      "title": "Affiliate Programs",
      "body": "Pay people or companies for making a sale or getting a lead.  See ClickBAnk, Pepperjam affiliate network, Commission Junction, Pepperjam, LinkShare, ShareASale, Affiliate.com, Adknowledge, MobAff, Neverblue, Clickbooth, RetailMeNot.  "
    },
    {
      "id": "6235",
      "title": "Search Engine Marketing",
      "body": "Paid search, pay per click.  "
    },
    {
      "id": "6236",
      "title": "Conversion Pages",
      "body": "Pages that prospective customers land on from invitations.  These pages work best when they have the same messaging as the invitations that preceded them."
    },
    {
      "id": "6237",
      "title": "AB Testing Software",
      "body": "Optimizely, Visual Website Optimizer, Unbounce."
    },
    {
      "id": "6238",
      "title": "Optimization v. Testing",
      "body": "Optimization is running expensive ads and tuning their performance.  Testing is running a small amount of cheap tests that give some indication of how successful a given channel strategy will be.  "
    },
    {
      "id": "6239",
      "title": "Trade Shows",
      "body": "Opportunity to showcase your products in person.  Opportunity to get in touch with editors of magazines, bloggers, customers, vendors, competition, partners."
    },
    {
      "id": "6240",
      "title": "Analyzing Competitor SEO",
      "body": "Open Site Explorer, Google Trends, Alexa Search Rank, Followerwonk."
    },
    {
      "id": "6241",
      "title": "First 10",
      "body": "Only about 10% of clicks occur beyond the first ten results."
    },
    {
      "id": "6242",
      "title": "Distribution Deals",
      "body": "One party provides a product or services in exchange for access to potential customers.  "
    },
    {
      "id": "6243",
      "title": "Licensing",
      "body": "One company has a strong brand that an upstart wats to use in a new product or service.  "
    },
    {
      "id": "6244",
      "title": "Conversion Percentage",
      "body": "Number of customers who when they visit your site make a purchase.  "
    },
    {
      "id": "6245",
      "title": "Two Biggest Traction Mistakes",
      "body": "Not having a concrete traction goal and believing that what has worked in the past will also work in the future.  "
    },
    {
      "id": "6246",
      "title": "Aggregators",
      "body": "Nextag, PriceGrabber aggregate products from retailers and add things like ratings, reviews, comparisons."
    },
    {
      "id": "6247",
      "title": "Distribution Failure",
      "body": "Most companies try many distribution/marketing channels and none of them work.  The best companies strategically pick one and if that doesn’t work are lucky to pivot to one or two other ones.  "
    },
    {
      "id": "6248",
      "title": "Traction Goal",
      "body": "Metrics to become profitable or get funding.  Ex. One thousand paying customers, one hundred new daily customers, 10% of your market."
    },
    {
      "id": "6249",
      "title": "Email Marketing",
      "body": "Marketing via email messaging.  Avoid large bulk unsolicited emails.  Require an email to access premium content, such as videos or white papers.  Email marketing can be very useful to retain customers and bring them back to your site.  Avoid noreply emails."
    },
    {
      "id": "6250",
      "title": "Search Engine Optimization (SEO)",
      "body": "Making sure your website shows up for key search results.  Don’t’ buy in-links."
    },
    {
      "id": "6251",
      "title": "Share and Embed",
      "body": "Make things really easy to share and embed the way that the user will want to share and embed (ie. Sending a link, email messaging, etc.)."
    },
    {
      "id": "6252",
      "title": "Major Social Media",
      "body": "LinkedIn, Twitter, Facebook, StumbleUpon, Foursquare, Tumbler, reddit, YouTube, BuzzFeed, Scribd, SlideShare, Pinterest, Instagram, SnapChat."
    },
    {
      "id": "6253",
      "title": "Long-Tail Keyword",
      "body": "Less popular and more specific searches."
    },
    {
      "id": "6254",
      "title": "Billboard Companies",
      "body": "Lamar, Lear Channel, Outfront Media."
    },
    {
      "id": "6255",
      "title": "Tracking Results",
      "body": "Keep track of all test results on a quant-based marketing spreadsheet. Include channel strategies, how many customers are available (traffic), click through rates (CTR), conversion rate (sign up for your product), cost to acquire customer, and lifetime value of customer."
    },
    {
      "id": "6256",
      "title": "Viral Coefficient",
      "body": "K = New invites * (new customers/new invites)"
    },
    {
      "id": "6257",
      "title": "Testing",
      "body": "It’s impossible to predict which channels will work until you test them."
    },
    {
      "id": "6258",
      "title": "Offline Tracking",
      "body": "Is difficult.  Consider sending people to different landing pages or phone numbers to help the tracking process.  "
    },
    {
      "id": "6259",
      "title": "Community Building",
      "body": "Investing in the connections among your customers and fostering relationships.  "
    },
    {
      "id": "6260",
      "title": "Lead Qualification",
      "body": "Improve conversion by qualifying the lead.  Put lead qualification in CRM."
    },
    {
      "id": "6261",
      "title": "Bullseye Brainstorming",
      "body": "Identify every single possible traction channel.    Ask how much will it cost to acquire customers through this channel, how many customers are available, are the customers you get through this channel the kind you want.  "
    },
    {
      "id": "6262",
      "title": "Vertical Sites",
      "body": "Hundreds of sites that have amassed significant audiences for a specific vertical such as parenting, sports, electronics."
    },
    {
      "id": "6263",
      "title": "Cost Per Acquisition",
      "body": "How much it costs you to acquire a customer, not just a click.  Cost to by a click divided by the number of people that make a make a purchase after visiting your site.      Geaneology.com spent thousands of dollar driving people to landing pages with completely different messages.  "
    },
    {
      "id": "6264",
      "title": "Supply Partnerships",
      "body": "Help secure key inputs.  "
    },
    {
      "id": "6265",
      "title": "Sales",
      "body": "Hand holding prospects.  "
    },
    {
      "id": "6266",
      "title": "Marketo Example",
      "body": "Had SEO and blog in place before they even began product development.  "
    },
    {
      "id": "6267",
      "title": "Key Goal for Startup",
      "body": "Growth.  Not funding, technology advancements, exits, etc."
    },
    {
      "id": "6268",
      "title": "Speaking Engagements",
      "body": "Give free talks to local groups.  Record and post speaking engagement online.  Ask people to promote your event while you have their attention.  Give audience a call to action at the end of each event.  "
    },
    {
      "id": "6269",
      "title": "Viral Marketing",
      "body": "Getting existing customers to refer others to your product.  Invite other people to join your network.  Embed virality into communications with “get a free… button on your email or site.”  Embed buttons and widgets.  Copy someone else’s viral loop until you can get yours to start working."
    },
    {
      "id": "6270",
      "title": "Core Channel",
      "body": "Focus solely on the channel that will move the needle for your startup.  Other channels should simply serve to feed into your main distribution channel."
    },
    {
      "id": "6271",
      "title": "SEM Strategy",
      "body": "Find high potential keywords, group them into ads, test ad copy with landing pages.  Google Adwords, Bing Ads.  Google’s Keyword Planner, Keyword Spy, SEMrush, SpyFu.  Don’t expect your campaign to be profitable right away.  If your campaign breaks even after a short period of time you have a promising strategy.  Use Google Analytics URL Builder to create unique URLS.  Average click through rate for AdWords is 2% with 1.5% or less receiving a low quality score from Google.  Google search network, Google content network, Google Conversion Optimizer.  "
    },
    {
      "id": "6272",
      "title": "Business Development",
      "body": "Exchanging value through partnerships.  Create an exhaustive list of all your possible partnerships, send to your investors and key influencers to get introductions.  Target the person at the partner company who is in charge of the metrics that you can help improve.  Create a one-page term sheet.  "
    },
    {
      "id": "6273",
      "title": "Email Referral",
      "body": "Dropbox gives free space to any user who emails a friend encouraging dropbox and that person signs up.  "
    },
    {
      "id": "6274",
      "title": "Calling on the Right Level",
      "body": "Don’t start calling at the top unless you are working with small businesses.  Make sure you speak to people who have been around a long time and are empowered to help make decisions.  Lookout for “yes” people that won’t challenge their bosses but just go with the flow.  "
    },
    {
      "id": "6275",
      "title": "Test Slowly",
      "body": "Don’t prematurely scale your marketing channel until you have tested your channel and know that it is the right fit.  "
    },
    {
      "id": "6276",
      "title": "Magazines",
      "body": "Consider magazines that you yourself would never read."
    },
    {
      "id": "6277",
      "title": "Analytics Tools",
      "body": "Clicky, Mixpanel, Chartbeat."
    },
    {
      "id": "6278",
      "title": "SPIN Selling",
      "body": "Clarify the prospect is a potential customer by breaking the ice (situational question).  Get them talking about the problem.  Uncover all the implications of this problem.  Focus on how your solution solves the problem.  "
    },
    {
      "id": "6279",
      "title": "Engineering as Marketing",
      "body": "Calculators, widgets, educational microsites.  Ex.  Hubspots website grader, turned a service into a widget to drive traffic.  They provide something of true value for free, with no strings attached.  Make the offer extremely relevant to your business.  Demonstrate the value as quickly as possible. Make the most valuable thing free and the most necessary thing at cost."
    },
    {
      "id": "6280",
      "title": "Four Common Pitfalls of Traction",
      "body": "Building Something People Want Does Not Guarantee Success.  The four main pitfalls are no real market, too narrow market, hard to reach market, hypercompetitive market."
    },
    {
      "id": "6281",
      "title": "Customer Appreciation",
      "body": "Be awesome to your customers.  Give them free stuff.  Connect them to other people.  Go over and above."
    },
    {
      "id": "6282",
      "title": "Social and Display Ads",
      "body": "Banner ads on websites.  Often used for brand awareness.  Largest display networks are Google’s Display Network (Google content network), Advertising.com, Tribal Fusion, Conversant, Adblade, BuySellAds.  Check out MixRank or Adbeeat to see ads your competitors are running and where they place them.  Social media clients convert and stick at a much higher rate than non social media leads.  "
    },
    {
      "id": "6283",
      "title": "Traction Bias",
      "body": "Avoiding channels that you don’t like but could be the best for your customers.  "
    },
    {
      "id": "6284",
      "title": "Ad Kit",
      "body": "Audience prospectus that illustrates the audience demographic for a marketing channel.  "
    },
    {
      "id": "6285",
      "title": "Priority Access Referral",
      "body": "Asking people on its prelaunch waiting list to recommend product to their friends in return for priority product access."
    },
    {
      "id": "6286",
      "title": "Role of Marketing & Sales",
      "body": "Arm & Aim.  Marketing should arm the sales people with all the collateral they need to effectively win sales campaigns.  This includes presentation, ROI calculators, competitive analysis, etc.  To help sales reps figure out which target customers they should focus on.  "
    },
    {
      "id": "6287",
      "title": "Cost Per Click",
      "body": "Amount it costs to buy a click on an advertisement.  "
    },
    {
      "id": "6288",
      "title": "Email Lists",
      "body": "Affiliates have large email lists that they will recommend products to.  "
    },
    {
      "id": "6289",
      "title": "Retargeting Sites",
      "body": "AdRoll, Perfect Audience.  "
    },
    {
      "id": "6290",
      "title": "Remnant Advertising",
      "body": "Ad space that is currently being unused.  Manhattan Media or Novus Media specializes in these ad placements.  "
    },
    {
      "id": "6291",
      "title": "Traction",
      "body": "A sign that your company is taking off."
    },
    {
      "id": "6292",
      "title": "ABC Deals",
      "body": "A deals can close in the next three months, B deals within 12 months and C deals longer than 12 months.  "
    },
    {
      "id": "6293",
      "title": "Loyalty Programs;  Upromise and ebates have reward programs for cash back and prizes on affiliate networks.  ",
      "body": ""
    }
  ]
}

