{
  "subject": "Two Second Advantage Checklist",
  "credit": "Two Second Advantage Checklist",
  "topic": "Efficiency",
  "todos": [
    {
      "id": "6294",
      "title": "Prevention",
      "body": "Police are using new technologies and predictive analytics to determine when and where a crime might happen before it occurs.  They then put on their sirens to scare the criminals from committing the crime.  "
    },
    {
      "id": "6295",
      "title": "DARPA",
      "body": "Pentagon's research arm."
    },
    {
      "id": "6296",
      "title": "Studying History w/o A Plan",
      "body": "Napoleon had no experience fighting but extensively studied military history and marched his troops off to fight without much of a plan.  He'd watch events unfold and wait for a flash of insight.  "
    },
    {
      "id": "6297",
      "title": "Polls",
      "body": "Are a snapshot of what people thought three days ago.  "
    },
    {
      "id": "6298",
      "title": "Keck's Wisdom",
      "body": "Wisdom is being in harmony with the way things are."
    },
    {
      "id": "6299",
      "title": "Single Pathway",
      "body": "The human brain only has a single microprocessor meaning that we can only do one thing at a time.  When we multitask we are either switching back really fast from one action to another or we are focusing on one action and the other action is running on autopilot without thought.  "
    },
    {
      "id": "6300",
      "title": "Chunking",
      "body": "The human brain is a predictive machine.  The more experiences we have, the stronger and more complex our patterns become.  Neurons that fire together wire together."
    },
    {
      "id": "6301",
      "title": "Multiple Sources of Intelligence",
      "body": "The best systems do not focus on one input but gather data from multiple sources and sensors."
    },
    {
      "id": "6302",
      "title": "Balance of Safe & Adventurous",
      "body": "Someone who plays it too safe will not get enough experiences to build a better chunked model for complex decision making.  Someone who is too adventurous won't repeat the same experiences enough to generate accurate predictions.  It takes a balance of both things.  "
    },
    {
      "id": "6303",
      "title": "Fuzzy Logic",
      "body": "Rules plus exceptions."
    },
    {
      "id": "6304",
      "title": "Learning",
      "body": "Repetition and prediction."
    },
    {
      "id": "6305",
      "title": "Gretsky Advantage",
      "body": "Physically inferior to competitors but practiced everyday as a child and was able to build patterns of play in his mind so that he knew where puck would go two seconds before anyone else.  "
    },
    {
      "id": "6306",
      "title": "Anti",
      "body": "People also make predictions based on lack of an event occurring.  Computers need to be able to read and understand non-events.  "
    },
    {
      "id": "6307",
      "title": "Memristors",
      "body": "Operate both as processing memory and storage (like our brain).  "
    },
    {
      "id": "6308",
      "title": "Next Age of Computing",
      "body": "Mix between brain science and neuroscience."
    },
    {
      "id": "6309",
      "title": "Constraints",
      "body": "Make us more aware of how our talent and the world works.  "
    },
    {
      "id": "6310",
      "title": "Real-time Computing",
      "body": "Looking at data as it comes in and gaining understanding right away."
    },
    {
      "id": "6311",
      "title": "Intelligence",
      "body": "Is defined by prediction, not behavior."
    },
    {
      "id": "6312",
      "title": "Forgetting",
      "body": "Humans and computers need to forget unimportant data in order to work quick and efficiently.  "
    },
    {
      "id": "6313",
      "title": "Finish Strong",
      "body": "Hit each target before you move on to the next.  "
    },
    {
      "id": "6314",
      "title": "Alerts",
      "body": "Help companies identify problems before they can even arise.  "
    },
    {
      "id": "6315",
      "title": "Andreessen Horowitz Test",
      "body": "Does a company have the ability to make quick and quality decisions.  "
    },
    {
      "id": "6316",
      "title": "Deliberate Practice v. Deliberate Performance",
      "body": "Deliberate practice is breaking down a skill and practicing it in a vacuum.  Deliberate performance is practicing your skill on the job, getting real world experience."
    },
    {
      "id": "6317",
      "title": "Emotional Memory/Coloring",
      "body": "Colors our thoughts and let us know what thoughts are more important.  Some say that emotional memory is passed on through the genes from one generation to the next."
    },
    {
      "id": "6318",
      "title": "Customer Event Reaction",
      "body": "Businesses should be able to predict what it is that will cause a bad experience with a customer and intervene with that customer before they even allow themselves to have that bad thought.  "
    },
    {
      "id": "6319",
      "title": "Prognostics",
      "body": "Being able to tell what will happen and when it will happen.  Casinos know that when a person in their twenties hits $300 losses, they will quit so the casino intervenes and gives them something free.  "
    },
    {
      "id": "6320",
      "title": "Bus",
      "body": "A connection that gathers data from multiple languages or systems and translates it to another language or system.  "
    }
  ]
}
