{
  "subject": "Unlimited Power Checklist",
  "credit": "Unlimited Power Checklist",
  "topic": "Personal Growth",
  "todos": [
    {
      "id": "6395",
      "title": "Small Picture",
      "body": "Remember, we don't know how life is, we only know how we represent it to ourselves."
    },
    {
      "id": "6396",
      "title": "Success Mechanisms",
      "body": "Passion, Spiritual Belief/Faith, Strategy, Clarity of Values, Energy!, Ability to Bond with Others, Mastery of Communication."
    },
    {
      "id": "6397",
      "title": "Auditory People",
      "body": "More selective about words they use, resonant voices, slower rhythmic speech, 'that sounds right', 'I can hear what you are saying'."
    },
    {
      "id": "6398",
      "title": "Abe Lincoln",
      "body": "Failed in business at 21, defeated in legislature at 22, failed at business at 24, sweetheart died at 26, nervous breakdown at 27, lost congressional race at age of 34, again at 36, lost senate race at 45, failed to become vice president at 47, lost senate race at 49, became president at age of 52."
    },
    {
      "id": "6399",
      "title": "Our behaviors",
      "body": "Are often completely dependent on the state we are in. This state is affected by our internal representations of the world (past experiences and how we talk to ourselves) and our physiology (posture, chemistry, breathing, tension, blood sugar level).  To control our behaviors we must control our state."
    },
    {
      "id": "6400",
      "title": "Power of Your Nervous System",
      "body": "Your feelings, fears, doubt, pain will control you if you don't relabel them into something positive that propels you."
    },
    {
      "id": "6401",
      "title": "Power",
      "body": "You shape your perceptions or someone else shapes them for you.  Today power is derived from information and the ability to communicate that information."
    },
    {
      "id": "6402",
      "title": "Selling Internal Framed People",
      "body": "You have to tell them that there is no way you can convince them, that they themselves are going to have to experience it or they themselves are the only ones that are going to know who would lose if you didn't invest/participate/use it.  "
    },
    {
      "id": "6403",
      "title": "Depression",
      "body": "You don't catch depression you create it by saying certain things to yourself in a tone of voice, adopting a certain posture, breathing pattern, throwing your biochemistry into shock through poor diet or excessive alcohol use.  "
    },
    {
      "id": "6404",
      "title": "Protein",
      "body": "You do not need to have a high protein diet to maintain optimal health.  Excess protein can actually cause fatigue.  "
    },
    {
      "id": "6405",
      "title": "Soak in the good",
      "body": "When good things happen, take time to soak them in, think about and record your feelings before and after.  See them as bright and shiny.  What did you do, see, feel, hear, smell."
    },
    {
      "id": "6406",
      "title": "Liquids",
      "body": "Try to avoid drinking liquids with or immediately following a meal."
    },
    {
      "id": "6407",
      "title": "Aerobic exercise",
      "body": "Trampolining is one of the best forms of exercise."
    },
    {
      "id": "6408",
      "title": "Eye Chart",
      "body": "To the left is remembered and to the right is constructed.  Up is visual, side is auditory, down right is kinesthetic and down left is auditory digital (words with meaning, talking to oneself)."
    },
    {
      "id": "6409",
      "title": "Modeling Physiology & Eye Movement",
      "body": "To get people back into the states that make them the most successful (involved state).  Have people recreate the time that they felt motivated or charged.  Ask them to recreate an involved state, what did they see, hear, feel or touch.  What was the first thing, what was the next thing.   The purpose is to get them back into the strategy of being involved."
    },
    {
      "id": "6410",
      "title": "Changing Internal Representations",
      "body": "To change how we respond and store experiences in our world, we must understand how we experience.  There are five senses  taste (gustation), smell (olfaction), sight (vision), hearing (auditory), feeling (kinesthetic)."
    },
    {
      "id": "6411",
      "title": "Mental Syntax",
      "body": "The way people organize their thoughts."
    },
    {
      "id": "6412",
      "title": "Self Representation",
      "body": "The tone of voice you talk to yourself in makes a major difference in self-motivation.  "
    },
    {
      "id": "6413",
      "title": "Breath",
      "body": "The foundation of health is a healthy bloodstream, breathing oxegenates the bloodstream and controls lymph fluid which sends white blood cells to protect the body.  Athletes get cancer seven times less frequently because of their exercise and breathing.  Exhale twice as long as you inhale because it dumps toxins from the body."
    },
    {
      "id": "6414",
      "title": "Learning to Handle 'No'",
      "body": "The best entrepreneurs and salespeople are the ones that can learn to hear no and keep moving forward without loss of enthusiasm."
    },
    {
      "id": "6415",
      "title": "Eat a little",
      "body": "That way you will be around to eat a lot.  Eat smaller meals.  Don't get seconds.  Undernutrition is the only thing we know that retards the aging process and extends the life of mammals."
    },
    {
      "id": "6416",
      "title": "Swish Patterns",
      "body": "Takes internal representations that cause unresourcefullness and give them new states that trigger resourcefulness.  First identify the behavior you want to change and imagine going through it, picture yourself if you didn't do that behavior and what you would be doing instead, swish the images by making a bright picture of what you want to change and a dark picture of your desired behavior, then swap the two images, the desired image breaks through and destroys the undesired behavior, add new submodalities like smell or taste.  "
    },
    {
      "id": "6417",
      "title": "Swish Food",
      "body": "Take food you should not eat in your mind, take it from being bright and big and swirh it down to the bottom left side of your mind and make it small, dark, and disgusting.  Then move the good food to the right side and make it bright and big and lovely."
    },
    {
      "id": "6418",
      "title": "Don't reinvent",
      "body": "Take a proven system that works somewhere and represent it in a different location, industry, application, etc."
    },
    {
      "id": "6419",
      "title": "Modeling Mental Syntax",
      "body": "Study the great people or your great moments and ask them or yourself what internal syntax you went through when experiencing that success.  Was it something you looked for in the environment (Ve), was it something you saw in your head (Vi), was it words you said to yourself (Ad), or maybe the tone you used (At).  Determine that sequence and then replay that sequence to help you succeed next time.  "
    },
    {
      "id": "6420",
      "title": "Proper food combining",
      "body": "Starches (rice, bread, potatoes)  require alkaline digestion and proteins (meat, dairy, nuts) require an acid digestions.  Alkalines and acids neutralize each other so if you eat them at the same time they will take longer to digest.  Neither are water rich.  "
    },
    {
      "id": "6421",
      "title": "Internal v External Frame Metaprogram",
      "body": "Some people look to others for their approval or rating, other people look within to that approval or rating.  Good leaders need to have internal framing.  External people rarely come up to you and tell you what you should do and how you should do it.  "
    },
    {
      "id": "6422",
      "title": "Matchers v Mismatchers",
      "body": "Some people look at things and see what is in common, other people look at things and see what is different.  Only about 35% of people are mismatchers.  They are extremely valuable because they see what the rest of us don't see.  "
    },
    {
      "id": "6423",
      "title": "Self or Others Metaprogram",
      "body": "Some people look at human interactions as what is in it for themselves and others look at what is in it for themselves and others.  "
    },
    {
      "id": "6424",
      "title": "Visual People",
      "body": "See the world in pictures, speak quickly to try to put words into pictures, speak in metaphors, talk about how things look."
    },
    {
      "id": "6425",
      "title": "Cultural Success",
      "body": "Results from rapport in all three areas and provide a sense of congruity in visual, auditory, and kinesthetic."
    },
    {
      "id": "6426",
      "title": "Akido",
      "body": "Redirecting unwanted energy into something more focused.  You can persuade better through agreement that through disagreement."
    },
    {
      "id": "6427",
      "title": "Contsructed v. Remembered",
      "body": "People's eyes will look to different sides when the image, sound, or feeling they are representing is remembered or constructed from imagination."
    },
    {
      "id": "6428",
      "title": "Elicit people's preferred mental syntax",
      "body": "People will tell you in their words and movements.  "
    },
    {
      "id": "6429",
      "title": "Local Models",
      "body": "Paul Jarrett, Dustin Clonch, Jeff Hale, Kevin Pope, Mike Dunlap."
    },
    {
      "id": "6430",
      "title": "John Stuart Mill",
      "body": "One person with a belief is equal to 99 with just an interest."
    },
    {
      "id": "6431",
      "title": "Distance Metaprogram",
      "body": "Moving towards or moving away.  Some people approach life with what they want and others what they want to avoid.  Discover the persons preference and then communicate with them in that same way.  If they move away, then communicate them how things will reduce risk and avoid loss, it they move towards, communicate to them on what they have to gain from action."
    },
    {
      "id": "6432",
      "title": "Possibility v Necessity",
      "body": "Motivation based on opportunity v necessity.  Quality control inspectors and people good at executing businesses should be people of necessity and not possibility.  "
    },
    {
      "id": "6433",
      "title": "Match & Lead",
      "body": "Mirror the persons physiology and then slowly bring them into your physiology.  Occasionally you need to be just as intense with the other person and then bring them back to a calm level.  "
    },
    {
      "id": "6434",
      "title": "State dependency",
      "body": "Many of our states are modeled from reactions from our parents or other role models.  Muscle tension, diet, breathing, posture, and biochemistry also affect the state we are in.  "
    },
    {
      "id": "6435",
      "title": "Deppressed People",
      "body": "Look down to access their kinesthetic feeling of feeling depressed, they drop their shoulders and take weak shallow breaths.  When people get depressed, their immune system follows.  "
    },
    {
      "id": "6436",
      "title": "Modeling Physiology",
      "body": "Look at the person, what is their posture, movements, words, tone.  "
    },
    {
      "id": "6437",
      "title": "Physiology",
      "body": "Link between the mind and body, the way you breathe, hold your body, posture, facial expression, movements."
    },
    {
      "id": "6438",
      "title": "Laughing Your Way To Health",
      "body": "Laughter is one of the best ways to boosten your immune system.  Read funny books, watch comedies, hangout with people that make you laugh.  "
    },
    {
      "id": "6439",
      "title": "Model the Greats",
      "body": "John F. Kennedy, Martin Luther King, Franklin Roosevelt, Benjamin Franklin, Albert Einstein.  "
    },
    {
      "id": "6440",
      "title": "Somerset Maugham",
      "body": "It's a funny thing about life, if you refuse to accept anything but the best, you very often will get it.  "
    },
    {
      "id": "6441",
      "title": "Strategy",
      "body": "Is the difference between Joe eats the lobster, and the lobster eats Joe.  It's important to make sure you do things in the correct order.  It often involves the correct allocation of resources in the right order."
    },
    {
      "id": "6442",
      "title": "Understand Physiology",
      "body": "If I were in your body, how would I get depressed?  What would I picture, what would I say to myself, what tone would I use, how would I feel, what would the colors look like, what would my body do, what is my posture like, what would I do next?"
    },
    {
      "id": "6443",
      "title": "Pattern Interrupt",
      "body": "Humor is one of the best ways to interrupt bad behavior.  Respond intelligently even to unintelligent treatment.  "
    },
    {
      "id": "6444",
      "title": "Internal Syntax",
      "body": "How you experience events, visual external (Ve) ' what you see through your eyes, visual internal (Vi) ' what you see when you imagine things in your head, auditory external (Ae) ' what you hear, auditory internal (Ai)' what you hear in your head, auditory digital (Ad) ' hear the words, auditory tonal (At) ' hear the tone of the voice, kinesthetic internal (Ki)' what you feel inside, kinesthetic external (Ke) - what you feel touching your body."
    },
    {
      "id": "6445",
      "title": "Changing Metaprograms",
      "body": "Happens by significant emotional events or being conscious of your styles and actively working to replace your habits."
    },
    {
      "id": "6446",
      "title": "Protecting Frame",
      "body": "Go to a time when you were totally empowered and alive.  Now put that in a bubble and protect that frame."
    },
    {
      "id": "6447",
      "title": "Congruency",
      "body": "Giving a positive message but your physiology is doing the opposite.  "
    },
    {
      "id": "6448",
      "title": "Firewalk",
      "body": "Getting people to do things that they never thought possible (like walking on fire) will change their internal representation beyond what you can imagine."
    },
    {
      "id": "6449",
      "title": "Mirroring",
      "body": "Form of building rapport.  When people are like each other they tend to like each other.  Mirror people's physiology, posture, breathing pattern, eye contact, body language, facial expressions, hand gestures.  If people are visual say things like I see your point, auditory, I hear what you are saying, that rings a bell, kinesthetic, I feel what your are saying."
    },
    {
      "id": "6450",
      "title": "Modeling",
      "body": "Finding the people that do a great job achieving your goals and mirroring them.  Build on the success of others.  Shadow geniuses."
    },
    {
      "id": "6451",
      "title": "Successful Beleifs",
      "body": "Everything happens for a positive reason, there is no such thing as failure (only experience and feedback), whatever happens take responsibility (you can only be a leader if you assume responisibility), it's not necessary to understand everything to use everything (don't need to know every detail ' you can spend all your time studying the roots or you can pick the fruits), people are your greatest resource, work is play, there is no success without commitment."
    },
    {
      "id": "6452",
      "title": "Kinesthetic",
      "body": "Even slower speakers, react to feelings, voices are deep, grasping for something concrete, need to 'get in touch', 'I'm reaching for an answer.'  Deep breathing is a sign of kinesthetic."
    },
    {
      "id": "6453",
      "title": "Source of Beliefs",
      "body": "Environment, if you grow up without and surround yourself with it you are more likely to achieve it (find environments and a role model).  Events, things that happen to you will change your beliefs.  Knowledge, learning can help transform your beliefs.  Past results, will shift your beliefs (successes or failures, even through luck or misfortune will form beliefs of what is possible).  Reshape it in your mind, deep diving, experience it in your mind the way you want it to be before it even happens."
    },
    {
      "id": "6454",
      "title": "Diet Rule",
      "body": "Eat only one condensed (non water rich) food item at each meal.  In other words, don't mix starches and proteins.  Digestion takes more nerve energy than anything which is why you can wakeup with lots of sleep and still be tired."
    },
    {
      "id": "6455",
      "title": "Water Rich Foods",
      "body": "Each fruits, vegetables, and sprouts.  Drink water but not in excess.  Herbivores live much longer than carnivores.  "
    },
    {
      "id": "6456",
      "title": "Bunker Hunt Success Formula",
      "body": "Decide what you want and decide what price you are willing to pay for it."
    },
    {
      "id": "6457",
      "title": "Paralyzing states",
      "body": "Confusion, depression, fear, anxiety, sadness, frustration."
    },
    {
      "id": "6458",
      "title": "Enabling states",
      "body": "Confidence, love, inner strength, joy, ecstasy, belief."
    },
    {
      "id": "6459",
      "title": "Power of Precision",
      "body": "Communicate your ideas with great precision.  Don't overwhelm people with everything but help them focus on just what they need to know."
    },
    {
      "id": "6460",
      "title": "Reframing",
      "body": "Changing a negative statement into a positive one.  Context reframing takes an experience that is bad, upsetting or undesirable and changes the frame or the story around it to make it positive.  Example is someone who buys and re-sells tickets framed as an entrepreneur or a scalper.  Put yourself into the right frames.  "
    },
    {
      "id": "6461",
      "title": "Take action",
      "body": "Build the specialized knowledge and take action."
    },
    {
      "id": "6462",
      "title": "Competition",
      "body": "Build from agreement not from conflict."
    },
    {
      "id": "6463",
      "title": "Reshape Memories",
      "body": "Bring back the memory, change the tone of voices you hear, give them more rhythm, change the color, etc.  Also works with taking big tasks and shrinking them down to size where you know you can effectively handle them.  "
    },
    {
      "id": "6464",
      "title": "Fruit",
      "body": "Best food.  Always eat on an empty stomach.  Try to avoid eating with any other food."
    },
    {
      "id": "6465",
      "title": "Balance in association",
      "body": "Be careful associated everything in life with emotional triggers,  be careful not associating anything in life."
    },
    {
      "id": "6466",
      "title": "Independent v. Cooperative Work Styles",
      "body": "Asses which one employees are and focus their workplace strategy based on that style."
    },
    {
      "id": "6467",
      "title": "Successful People",
      "body": "Are able to gain access to their most resourceful state on a consistent basis. The states you reinforce will continue to become a part of you.  If you focus on good things, good things will happen to you.  They also spread their most resourceful states to other people through their energy and excitement."
    },
    {
      "id": "6468",
      "title": "Neuro Linguistic Programming; How language, verbal and non verbal affects your nervous system.",
      "body": "-"
    },
    {
      "id": "6469",
      "title": "Trigger",
      "body": "-"
    }
  ]
}

