{
  "subject": "Implementing Value Pricing Checklist",
  "credit": "Implementing Value Pricing Checklist",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "3324",
      "title": "Words",
      "body": "Use customer, price, invoice, and team, not client, fee, bill, and staff."
    },
    {
      "id": "3325",
      "title": "Price Sensitivity",
      "body": "Substitute effect, value effect, switching cost, comparison effect, quality effect, expenditure effect, end-benefit effect, shared cost, effect, fairness,  inventory."
    },
    {
      "id": "3326",
      "title": "Anti-Intellectual Capital",
      "body": "Rigid adherence to old methods.  "
    },
    {
      "id": "3327",
      "title": "Buyer Identification Pricing",
      "body": "Pricing by seniors, children, students, nonprofits, coupons."
    },
    {
      "id": "3328",
      "title": "Purchase Location Pricing",
      "body": "Pricing by location, having different offices, etc."
    },
    {
      "id": "3329",
      "title": "Price Customer",
      "body": "Price the customer, not the product or service."
    },
    {
      "id": "3330",
      "title": "Structural Capital/Infrastructure",
      "body": "Organizational structure, policies, intellectual property rights, documented systems, management contracts, employee development and education, proprietary systems, customer lists, contracts."
    },
    {
      "id": "3331",
      "title": "Product Design Pricing",
      "body": "Offering different versions of a product of service."
    },
    {
      "id": "3332",
      "title": "Pride",
      "body": "Is a more effective motivator of talent than money."
    },
    {
      "id": "3333",
      "title": "Innovation revenue",
      "body": "Income from products that didn't exist X years ago."
    },
    {
      "id": "3334",
      "title": "Three Types of Intellectual Capital",
      "body": "Human, structural, and social.  Structural capital is the only one that is owned by the firm.  This is why infrastructure is so important.  Human and social knowledge must be gained from people."
    },
    {
      "id": "3335",
      "title": "Eight Steps for Value Pricing",
      "body": "Have a conversation with the customer, price the customer, develop pricing options, present options to customer, customer selection, project management, change orders, project evaluations."
    },
    {
      "id": "3336",
      "title": "Evaluation",
      "body": "Evaluation of the experience is more important than the experience.  What was supposed to happen, what happened (ground truth), what were the positive and negative factors, what have we learned, how can we do better, who needs to know these lessons, who will implement these lessons."
    },
    {
      "id": "3337",
      "title": "Chief Value Officer Advice",
      "body": "Don't be a wimpy pricer, a lot of times you have to say no, people are scared of change, customer owns the shop, no one is in control, decisions are our most important resource, focus on others and you will become important, one wrong doesn't overcome another, lay a foundation.  (Brendon Harrex)"
    },
    {
      "id": "3338",
      "title": "Profits",
      "body": "Derive from risk."
    },
    {
      "id": "3339",
      "title": "Institution",
      "body": "Compressed Expertise"
    },
    {
      "id": "3340",
      "title": "Mutual Gain v. Equal Gain",
      "body": "both parties must profit but it does not have to be in equal proportion.  "
    },
    {
      "id": "3341",
      "title": "Inflection Point",
      "body": "A time in the life of a business in which its fundamentals are about to change."
    },
    {
      "id": "3342",
      "title": "Valued Employee",
      "body": "A person's worth to an organization can be measured by the amount of supervision they require."
    },
    {
      "id": "3343",
      "title": "Testing New Ideas",
      "body": "You should know how much of your firms human capital is dedicated to testing new ideas vs. executing old ones."
    },
    {
      "id": "3344",
      "title": "Change Order",
      "body": "You should define the customer requirements in your scope and if the customer does not meet them there is a change order."
    },
    {
      "id": "3345",
      "title": "You are Your Customer",
      "body": "You are as good or bad as your customer list.  "
    },
    {
      "id": "3346",
      "title": "Knowledge Worker",
      "body": "Worker who directs their attention to the most valuable things to do."
    },
    {
      "id": "3347",
      "title": "Convenience Buyers",
      "body": "Willing to pay higher price for exactly what they want exactly when they want it."
    },
    {
      "id": "3348",
      "title": "Pre-Action",
      "body": "What our the intended results, what challenges can we anticipate, what have we or others learned from similar situations, what will make us successful this time."
    },
    {
      "id": "3349",
      "title": "Avoid Competition",
      "body": "War destroys, commerce builds.  "
    },
    {
      "id": "3350",
      "title": "Peer Review",
      "body": "Using anonymous cards to grade customers, employees, etc."
    },
    {
      "id": "3351",
      "title": "Two Part / Tie In Pricing",
      "body": "Two separate charges for one product or experience (ex razor and blade, door charge and drink charge)."
    },
    {
      "id": "3352",
      "title": "Purpose of Business",
      "body": "To create a customer and to create wealth for that customer."
    },
    {
      "id": "3353",
      "title": "No Commodity",
      "body": "There is no such thing as a commodity, everything can be differentiated."
    },
    {
      "id": "3354",
      "title": "Threshold",
      "body": "There is an upper and lower price threshold in every customer.  Map the ranges and figure out how to discriminate so you can fall in everyone's range."
    },
    {
      "id": "3355",
      "title": "Gossen's Law",
      "body": "The market price is determined by what the last unit of a product is worth to people."
    },
    {
      "id": "3356",
      "title": "Shut Up",
      "body": "The best salesmen know exactly the right time to shut up when making a pitch.  Don't talk yourself out of a sale."
    },
    {
      "id": "3357",
      "title": "Expectations",
      "body": "The best firms are constantly questioning their customers expectations.  You need to know the expectations with every involvement.  When a customer pays you to solve one problem, you need to solve two for them."
    },
    {
      "id": "3358",
      "title": "Tacit v. Explicit Knowledge",
      "body": "Tacit knowledge is like describing how to ride a bike.  It is rich with detail and experience.  Explicit knowledge is can be easily described or stored on a medium.  Tacit knowledge can become explicit via database, paper, report, manual, video, picture, etc."
    },
    {
      "id": "3359",
      "title": "Price Sensitivity Factors",
      "body": "Substitutes, value, switching costs, comparison, price-quality, pass through expense, fairness."
    },
    {
      "id": "3360",
      "title": "Value Buyers",
      "body": "Study alternatives and features well before choosing best value.  Don't always by the cheapest.  Can be persuaded with loyalty programs."
    },
    {
      "id": "3361",
      "title": "Customer Segments",
      "body": "Splitting customers into first class (5 to 8% in planes), business class (15 to 24%), full fare (30 to 50%), coach (15 to 35%) and discount (10 to 20%).  Don't misallocate resources to lower value customers."
    },
    {
      "id": "3362",
      "title": "Penetration Pricing",
      "body": "Setting price below the value to establish a larger customer base.  "
    },
    {
      "id": "3363",
      "title": "Neutral Pricing",
      "body": "Setting price at value."
    },
    {
      "id": "3364",
      "title": "Skim Pricing",
      "body": "Setting price above value to establish a higher perceived value."
    },
    {
      "id": "3365",
      "title": "Scope Document Elements",
      "body": "Scope statement, objectives, constraints, structure, roles, team, assumptions, deliverables, change control, future projects list, approval."
    },
    {
      "id": "3366",
      "title": "Wealth",
      "body": "Resides in the intellectual capital of a company."
    },
    {
      "id": "3367",
      "title": "Diamond Effect",
      "body": "Rare, desired, and impossible to duplicate.  Doesn't have to have utility to be valuable and profitable."
    },
    {
      "id": "3368",
      "title": "Purchase Quantity Pricing",
      "body": "Quantity discounts."
    },
    {
      "id": "3369",
      "title": "Atarimae Hinshitsu",
      "body": "Quality is taken for granted.  Number one complaint is not quality but rather lousy service.  "
    },
    {
      "id": "3370",
      "title": "Time of Purchase Pricing",
      "body": "Pricing by time of purchase, time of product, or turnaround time for delivery."
    },
    {
      "id": "3371",
      "title": "Relationship Buyers",
      "body": "Place high value on brand, quality, and relationships."
    },
    {
      "id": "3372",
      "title": "Economic Buyer",
      "body": "Person who makes the decisions."
    },
    {
      "id": "3373",
      "title": "Cost of Others",
      "body": "People will have different pricing thresholds depending on whether they are paying or using someone else's money and whether the purchase is for them or someone else."
    },
    {
      "id": "3374",
      "title": "Purchasing",
      "body": "People buy emotionally and justify intellectually.  "
    },
    {
      "id": "3375",
      "title": "Price Options",
      "body": "Offer an array of options to maximize customer value."
    },
    {
      "id": "3376",
      "title": "Knowledge Management Software/Knowledge Bank",
      "body": "Not a system but a culture of knowledge inputs (adding knowledge) and outputs (accessing knowledge)."
    },
    {
      "id": "3377",
      "title": "Napster v. ITunes",
      "body": "Napster revolutionized the music business, iTunes profited from the revolution of the music business."
    },
    {
      "id": "3378",
      "title": "Starting Point",
      "body": "Mr. Customer, we will only undertake or charge for the engagement if we can provide value that is three times our price.  Is that acceptable?"
    },
    {
      "id": "3379",
      "title": "Price Buyers",
      "body": "Looking for the lowest price, should be offered the stripped down version of your service."
    },
    {
      "id": "3380",
      "title": "Price",
      "body": "Language in which a company strategically communicates value to a customer."
    },
    {
      "id": "3381",
      "title": "Value",
      "body": "Is in the eye of the beholder."
    },
    {
      "id": "3382",
      "title": "TIP Clause",
      "body": "In the event that we are able to satisfy you needs in a timely and professional maker, you have agreed to review the situation and decide whether, in the sole discretion of XYZ, some additional payment to ABC is appropriate in view of your overall satisfaction with services rendered by ABC."
    },
    {
      "id": "3383",
      "title": "Confidence",
      "body": "If you do not think you are worth your pricing, your customers never will."
    },
    {
      "id": "3384",
      "title": "Tragedy of Commons",
      "body": "If everyone owns something than no one does and no one will care for it."
    },
    {
      "id": "3385",
      "title": "Business Model",
      "body": "How your firm creates value for customers and how you monetize that value."
    },
    {
      "id": "3386",
      "title": "Equality",
      "body": "He who seeks equality should go find a cemetery."
    },
    {
      "id": "3387",
      "title": "Hard v Soft Data",
      "body": "Hard data is numbers and facts, soft data is gossip, hearsay, and intuition.  Sometimes what counts can't be counted and what can be counted doesn't count."
    },
    {
      "id": "3388",
      "title": "Customer Grading",
      "body": "Grading customers with A, B, C'"
    },
    {
      "id": "3389",
      "title": "Numbers",
      "body": "Give the illusion of presenting more truth and precision than they are capable of doing.  Numbers, studies, and reports should be used to start a discussion and guide strategy.  They should not be followed blindly.  "
    },
    {
      "id": "3390",
      "title": "Stop Old Things",
      "body": "For a firm to be innovative it must stop doing old things."
    },
    {
      "id": "3391",
      "title": "Customer Pricing",
      "body": "Firm says this is what it will cost us, what would you like to pay.  If the customer is unfair then they decline to do further work."
    },
    {
      "id": "3392",
      "title": "Little Touch Management",
      "body": "Finding special but not expensive ways to take care of clients.  "
    },
    {
      "id": "3393",
      "title": "Customer Benefit",
      "body": "Don't tell me how good you make it, tell me how good it makes me when I use it. (Leo Burnett).  Customers by good feelings and solutions to their problems."
    },
    {
      "id": "3394",
      "title": "Firing Customers",
      "body": "Don't let bad customers get in the way of good customers.  Also known as forced churn."
    },
    {
      "id": "3395",
      "title": "Pricing Guarantees",
      "body": "Don't forget to include the cost of any guarantees or warrantees you attach to your product/service."
    },
    {
      "id": "3396",
      "title": "Creep",
      "body": "Do not let team members change scope without correct approvals."
    },
    {
      "id": "3397",
      "title": "High Satisfaction Day",
      "body": "Day that convinces you why you do what you do."
    },
    {
      "id": "3398",
      "title": "Listening",
      "body": "Customer should talk twice as much as the salesperson.  Talkers dominate the conversation but listeners control it."
    },
    {
      "id": "3399",
      "title": "Good Pricing",
      "body": "Clients screened, understanding customer values, price leverage, knowledge of cost to serve, mutual gain, slow process of pricing, ignore competitors, differentiation, negotiation."
    },
    {
      "id": "3400",
      "title": "Cardinal v Ordinal Ranking",
      "body": "Cardinal ranking has a value that can be added, subtracted, etc.  An ordinal vale is a position on a list (ex fifth)."
    },
    {
      "id": "3401",
      "title": "Product Bundling",
      "body": "Bundling two products to raise sale but discounting individual products."
    },
    {
      "id": "3402",
      "title": "Ideas v Execution",
      "body": "Apple charges $400 for a phone, $50 goes towards making the phone and $350 towards research, design, and profit."
    },
    {
      "id": "3403",
      "title": "Efficaciousness",
      "body": "Ability to produce a desired effect."
    },
    {
      "id": "3404",
      "title": "Professional",
      "body": "A technician who cares.  "
    },
    {
      "id": "3405",
      "title": "Advertising",
      "body": "A tax for having an unremarkable product.  "
    },
    {
      "id": "3406",
      "title": "Crowbar",
      "body": "A man buying a crowbar to open a treasure chest will pay well above market value for the crowbar."
    },
    {
      "id": "3407",
      "title": "Transformation Business",
      "body": "A company that helps customers achieve more and greater."
    }
  ]
}

