{
  "subject": "A Few Lessons By Warren Buffet",
  "credit": "A Few Lessons By Warren Buffet",
  "topic": "Innovators",
  "todos": [
    {
      "id": "179",
      "title": "Matthew 6",
      "body": "21  For where your treasure is, there will your heart be also."
    },
    {
      "id": "180",
      "title": "Trade",
      "body": "What you are giving is just as important as what you are getting.  "
    },
    {
      "id": "181",
      "title": "Fear",
      "body": "We make some of our best purchases when people fear.  Fear is the foe of the faddist but the friend of the fundamentalist.  "
    },
    {
      "id": "182",
      "title": "Reputation",
      "body": "We can afford to lose all our money but we cannot afford to lose our reputation."
    },
    {
      "id": "183",
      "title": "Difficult Business Problems",
      "body": "Try to avoid them, not solve them."
    },
    {
      "id": "184",
      "title": "Decentralization",
      "body": "Trust and give your managers the authority to make decisions."
    },
    {
      "id": "185",
      "title": "Networking Effect",
      "body": "The product or service becomes more valuable to customer when there are more user (social media, advertising)."
    },
    {
      "id": "186",
      "title": "Focus v. Diversification",
      "body": "Tend to go in and out of style."
    },
    {
      "id": "187",
      "title": "Debrief",
      "body": "Study your mistakes, not your successes."
    },
    {
      "id": "188",
      "title": "Trust",
      "body": "Stick to proven management with integrity, talent, and passion."
    },
    {
      "id": "189",
      "title": "Audit",
      "body": "Spend time looking into the numbers.  Always keep two sets of books."
    },
    {
      "id": "190",
      "title": "Patience",
      "body": "Some things take time, you can have a baby in nine months by getting one woman pregnant but you can't have a baby in nine months by getting none women pregnant."
    },
    {
      "id": "191",
      "title": "Leaky Boat",
      "body": "Should you find yourself in a leaky boat sometimes it is better to spend the energy to find a new boat rather than fixing all the holes.  No problem is too big to run away from."
    },
    {
      "id": "192",
      "title": "Change",
      "body": "Severe change and exceptional returns don't go well except for the few very lucky.  "
    },
    {
      "id": "193",
      "title": "Gruesome Businesses",
      "body": "Requires a lot of capital for a small or no sales growth.  Usually products that are not lowest in price or don't have strong brand recognition."
    },
    {
      "id": "194",
      "title": "Brand",
      "body": "Reputation for quality."
    },
    {
      "id": "195",
      "title": "All or Nothing (Devon)",
      "body": "Remember that in business, two out of three is bad, often times you need to meet all three elements of success in order to be successful.  This does not mean try to be everything to everyone."
    },
    {
      "id": "196",
      "title": "Polonius",
      "body": "Neither a short term borrower nor long term lender be."
    },
    {
      "id": "197",
      "title": "Eat Our Own Cooking",
      "body": "Most of our directors have skin in the game."
    },
    {
      "id": "198",
      "title": "BNSF Success",
      "body": "Monopoly on tracks and railroads are three times more fuel efficient than trucks."
    },
    {
      "id": "199",
      "title": "Don't Make The Numbers",
      "body": "Managers that promise to make the numbers will eventually start to make up the numbers."
    },
    {
      "id": "200",
      "title": "Float",
      "body": "Making money of the interest when clients prepay (insurance)."
    },
    {
      "id": "201",
      "title": "Computer Chimera",
      "body": "Machines can compliment man but never trust or rely on them for precision or they will institute a false sense of security."
    },
    {
      "id": "202",
      "title": "Ignore Resumes",
      "body": "Look for passion, brains, and integrity."
    },
    {
      "id": "203",
      "title": "Capital to Sales (Cost of Capital)",
      "body": "Look at the ratio of a companies capital investment to annual sales growth.  If it takes $4 of capital to produce $1 of additional sales your cost of capital is 25%."
    },
    {
      "id": "204",
      "title": "Size",
      "body": "Limit your team's size or you will become slow thinking, resistant to change and smug.  'We shape our buildings and then our buildings shape us.' (Churchill)"
    },
    {
      "id": "205",
      "title": "Simple",
      "body": "Keep it plain and simple."
    },
    {
      "id": "206",
      "title": "Cash",
      "body": "Keep cash around.  If you want to shoot a rare big fast moving elephant you better have a loaded gun."
    },
    {
      "id": "207",
      "title": "Reporting",
      "body": "Just tell me the bad news.  The good news will take care of itself."
    },
    {
      "id": "208",
      "title": "Cash Source",
      "body": "It doesn't matter where cash comes from it all spends the same."
    },
    {
      "id": "209",
      "title": "Intelligent Investor",
      "body": "Investment is most intelligent when it is business like.  "
    },
    {
      "id": "210",
      "title": "Intrinsic Value v. Book Value",
      "body": "Intrinsic value is what something is worth and book value is the price it was sold for.  Book value is a meaningless indicator of intrinsic value."
    },
    {
      "id": "211",
      "title": "David Oglivy",
      "body": "If each of us hires people smaller than we are we shall become a company of dwarves, if each of us hires people bigger than us we shall be a company of giants."
    },
    {
      "id": "212",
      "title": "Universal Business Formula",
      "body": "How much does your capital produce."
    },
    {
      "id": "213",
      "title": "Two Sided Balance Sheets",
      "body": "Honest businesses make money by maintaining the highest possible return on assets and the lowest cost on liabilities."
    },
    {
      "id": "214",
      "title": "Great Business",
      "body": "High returns, sustainable competitive advantage, and barriers to entry."
    },
    {
      "id": "215",
      "title": "Return on Capital",
      "body": "Has three parts  1. Sales units and price, 2. Operating Costs to make product and provide service and experience, 3. Invested capital to conduct business."
    },
    {
      "id": "216",
      "title": "Activity v. Accomplishment",
      "body": "Don't confuse activity with accomplishment.  What do the key metrics say."
    },
    {
      "id": "217",
      "title": "Conflict of Interest",
      "body": "Don't ask the barber when you need a haircut.  "
    },
    {
      "id": "218",
      "title": "Culture",
      "body": "Culture more than rule books determines how a business behaves.  "
    },
    {
      "id": "219",
      "title": "Cigar Butt",
      "body": "Buying a shitty business at a really low cost.  There may be one or two more puffs to get out of it but eventually it will fail."
    },
    {
      "id": "220",
      "title": "Headwinds",
      "body": "Businesses are performing worse than they should because of external conditions."
    },
    {
      "id": "221",
      "title": "Tailwinds",
      "body": "Business performs better than it should because of external conditions (such as lousy completion)."
    },
    {
      "id": "222",
      "title": "Parallel Options",
      "body": "Build multiple options in parallel so that you can compare them and chose the best one without losing time."
    },
    {
      "id": "223",
      "title": "Moats",
      "body": "Barriers to entry.  Ask yourself how you would like to compete with the industry.  Sometimes being a bit aggressive encourages others not to compete.  Moats can be established by being lowest cost (price) or having brand that people ask for (quality - 'I'll have a Coke.').  "
    },
    {
      "id": "224",
      "title": "Timing",
      "body": "A man went to a vet and said, sometimes my horse limps and sometimes he walks just fine, what should I do.  The vet said, wait until he walks fine and sell him.  "
    },
    {
      "id": "225",
      "title": "Nebraska Furniture Mart/Borsheim's Success",
      "body": "1. Unmatched depth and bredth of merchandise found in one location (like Walmart), 2. Lowest operating cost/highest margins, 3. Shrewd buying made possible by high volume purchasing, 4. Incredible service."
    },
    {
      "id": "226",
      "title": "Tough Businesses",
      "body": "1. Businesses where you have to be smart and on top of trends every day (retail, hospitality), 2. Fast changing businesses where it is tough to judge future competitive advantage (technology).  "
    },
    {
      "id": "227",
      "title": "What Berkshire Looks For",
      "body": "1. Business you can understand, 2. Favorable economics, 3. Trustworthy management, 4. Sensible price tag."
    },
    {
      "id": "228",
      "title": "Flooded Markets",
      "body": "What wise men do in the beginning fools do in the end."
    },
    {
      "id": "229",
      "title": "Commodity/Brand Strength Test",
      "body": "To know if a business is a commodity listen to whether people ask for a product type or a brand name ('I'll have a Coke')."
    },
    {
      "id": "230",
      "title": "Strategic Plan Woes",
      "body": "Often times having a strategic plan can cause you to make poor decisions and overpay.  By not having a strategic plan you don't have t proceed in one direction but can make decisions based on the interests of capital."
    },
    {
      "id": "231",
      "title": "Don't Add Without Subtracting",
      "body": "Nothing forever, everything needs updating, replaced, or improved to be worthwile.  When people add value, make sure they are also subtracting depreciation.  "
    },
    {
      "id": "232",
      "title": "Winner Takes All",
      "body": "In certain industries that often include networking effect the winner usually takes all (newspapers, Facebook)."
    },
    {
      "id": "233",
      "title": "Commodity",
      "body": "In a business selling a commodity product it is impossible to be ten times smarter, or better then the competitor.  The only thing you can be is more efficient and cheaper."
    },
    {
      "id": "234",
      "title": "Code of Ethics",
      "body": "Develop a code of ethics.  "
    },
    {
      "id": "235",
      "title": "Conflict",
      "body": "Be careful working with people who have irons in many fires."
    }
  ]
}

