{
  "subject": "Way of the Seal",
  "credit": "Way of the Seal",
  "todos": [
    {
      "id": "6742",
      "title": "Win in Your Mind",
      "body": "Victorious warriors win first in their minds and then go to war."
    },
    {
      "id": "6743",
      "title": "Offense",
      "body": "Think offense all the time."
    },
    {
      "id": "6744",
      "title": "Sympathetic v. Parasympathetic",
      "body": "Stress v. no balance.  Recognize when you are in one stage or the other."
    },
    {
      "id": "6745",
      "title": "Simplify the Battlefield",
      "body": "Simple is harder than complex.  Less but better.  (“Not Simple Enough.” – Jobs)"
    },
    {
      "id": "6746",
      "title": "Silence",
      "body": "Silence helps you control your mind and clear it for optimal thinking."
    },
    {
      "id": "6747",
      "title": "Mantras",
      "body": "Say to yourself “day by day I am getting better and better.”"
    },
    {
      "id": "6748",
      "title": "Leadership",
      "body": "Privilege, not an entitlement.  Know when you need to step aside and don’t be afraid to say so."
    },
    {
      "id": "6749",
      "title": "Purpose",
      "body": "Know your purpose and bulletproof your mission.  Attack it from every angle.  "
    },
    {
      "id": "6750",
      "title": "20X",
      "body": "Humans are capable of doing twenty times what they think they can.  "
    },
    {
      "id": "6751",
      "title": "HVT (“High Value Targets”)",
      "body": "High value targets are the 20% that lead to 80% results.  It takes discipline to hit HVTs instead of going after low hanging fruit.  "
    },
    {
      "id": "6752",
      "title": "Mental Toughness",
      "body": "Get mentally and emotionally tough so that quitting is a choice, not a result."
    },
    {
      "id": "6753",
      "title": "Direct Your Mind",
      "body": "Don’t let monkey mind take over.  DIRECT.  Detect useless thoughts.  Interdict and simply let them flow by.  Redirect yourself to a constructive thought.  Energize the constructive thought.  "
    },
    {
      "id": "6754",
      "title": "Explore Your Options",
      "body": "Don’t get stuck with one option to achieve your plan, formulate multiple options in parallel."
    },
    {
      "id": "6755",
      "title": "Extra",
      "body": "Don’t be an extra in someone else’s story, create your own story."
    },
    {
      "id": "6756",
      "title": "Seal Motto",
      "body": "Do today what others won’t so that you can do tomorrow what others can’t."
    },
    {
      "id": "6757",
      "title": "Strategy v. Goal",
      "body": "Decide on your passion and purpose, you can allow strategies to fail fast but never abandon the larger goal.   "
    },
    {
      "id": "6758",
      "title": "Re-invent",
      "body": "Break things and remake them.  Retrain your brain when you find new processer, methods, etc."
    },
    {
      "id": "6759",
      "title": "Deep Breathing",
      "body": "Before you take any action you must control your mind by calming it down through slow breathing."
    },
    {
      "id": "6760",
      "title": "Shoot, move, and communicate",
      "body": "Act, re-position, and share information.  Observe your position, orient to new reality, decide on an action, act, and send feedback."
    },
    {
      "id": "6761",
      "title": "HVT Focus",
      "body": "A seal sniper knows they must hit one target at a time and cannot shift focus until that one target is down."
    },
    {
      "id": "6762",
      "title": "Weak Link",
      "body": "A chain is only as strong as its weakest link, fix or remove the weakest link."
    },
    {
      "id": "6763",
      "title": "Pareto",
      "body": "20% leads to 80% results."
    },
    {
      "id": "6764",
      "title": "FITS",
      "body": "1. Does target fit your team’s skills?  2. Is it really important for goal?  3. Is the timing right to go after it?  4. Is the target simple and clear?"
    },
    {
      "id": "6765",
      "title": "Trust Your Gut",
      "body": "Your stomach is your little brain.  It has millions of neurons that gather information about the body and can sense when something is wrong.  "
    },
    {
      "id": "6766",
      "title": "Goals",
      "body": "When it’s obvious that a goal can’t be reached, adjust your approach and increase your ambitions.  "
    },
    {
      "id": "6767",
      "title": "Determine Your Unique Offer",
      "body": "What can you do for the mission better than anyone else."
    },
    {
      "id": "6768",
      "title": "Rituals",
      "body": "Wake up half an hour early to exercise, do yoga, meditate.  "
    },
    {
      "id": "6769",
      "title": "Control Your Response",
      "body": "Use breathing to control your stress and to respond rationally.  "
    },
    {
      "id": "6770",
      "title": "Break Things",
      "body": "The moment you say you know everything or know the best way to do something, you are setting yourself up for failure.  Always be striving to learn and recreate the way things are done for the better.  "
    },
    {
      "id": "6771",
      "title": "Future",
      "body": "The best way to predict your future is to create it (Abraham Lincoln).  "
    },
    {
      "id": "6772",
      "title": "Visual Storytelling",
      "body": "Tell the story using clear visualizations."
    },
    {
      "id": "6773",
      "title": "Mental Toughness",
      "body": "Success is largely a matter of hanging on after others have let go."
    },
    {
      "id": "6774",
      "title": "Emotional Resilience",
      "body": "See failure as a stepping stone, not a crutch.  Look for the silver lining in everything.  Don’t let failure go to waste."
    },
    {
      "id": "6775",
      "title": "Fear",
      "body": "Rid yourself the fear of pain, suffering, failure, and death.  "
    },
    {
      "id": "6776",
      "title": "Dirt Dive",
      "body": "Rehearse until you win an action in your mind.  1. See it, 2. Imagine a successful outcome, 3. Practice how you get there.  "
    },
    {
      "id": "6777",
      "title": "Positive Self Talk",
      "body": "Quiet your mind and send yourself the positive vibes you need to be successful."
    },
    {
      "id": "6778",
      "title": "Rubber Band",
      "body": "Put a rubber band around your wrist and snap it every time you have a useless negative thought.  "
    },
    {
      "id": "6779",
      "title": "Be Decisive",
      "body": "Make few decisions and stick with them.  Second guessing your decisions will destroy momentum.  When making decisions, stand up straight, look people in the eye and don’t say anything after you’ve made your decision."
    },
    {
      "id": "6780",
      "title": "Problems",
      "body": "If your looking for a big opportunity seek out a big problem."
    },
    {
      "id": "6781",
      "title": "Cheating",
      "body": "If you ain’t cheating you ain’t trying.  Don’t be liars and cheats but do push the envelope.  "
    },
    {
      "id": "6782",
      "title": "Embrace the Suck",
      "body": "I am only an average man God, but I work harder than an average man.  Endure pain better than others.  Laughter helps cure pain."
    },
    {
      "id": "6783",
      "title": "Be Grateful",
      "body": "Every day list all the things you are grateful for.  "
    },
    {
      "id": "6784",
      "title": "Eliminate Distractions",
      "body": "Eliminating distractions helps us see the simplicity."
    },
    {
      "id": "6785",
      "title": "Relaxed Awareness",
      "body": "Defocus your eyes and allow information to flow into the mind.  "
    },
    {
      "id": "6786",
      "title": "Debrief",
      "body": "Debrief as soon as you can after completing or failing at a big mission."
    },
    {
      "id": "6787",
      "title": "Mind, Body, Heart, Gut, Spirit",
      "body": "Be mentally tough and smart, be physically capable, be emotionally resilient, develop intuition and awareness, and be spiritual.  See Mind, Body, Heart, Gut, Spirit Checklist."
    }
  ]
}

