{
  "subject": "Web Usability Checklist",
  "credit": "Web Usability Checklist",
  "topic": "UI/UX",
  "todos": [
    {
      "id": "6788",
      "title": "Trunk Test",
      "body": "Blindfold yourself and have someone go to any page on the site.  Ask the following questions, what site is this (site ID present), what page am I on (Page Name present), what section am I on (Section Name), what are my navigation options at this level (Local Navigation), where am I in the scheme of things (you are here indicators, highlighted navbar, breadcrumbs), how can I search."
    },
    {
      "id": "6789",
      "title": "Click Number",
      "body": "You should be able to get to anything in three clicks or less."
    },
    {
      "id": "6790",
      "title": "50 Milliseconds",
      "body": "You have 50 milliseconds to make a good impression."
    },
    {
      "id": "6791",
      "title": "Conventions",
      "body": "Widely used or standardized design patterns (like an red octagon for stop). Conventions include where things will be located on a page, how things work, how things look, etc.  If you are not using a web convention it either has to be so clear and self-explanatory, or add so much value that it's worth a small learning curve."
    },
    {
      "id": "6792",
      "title": "Big Picture of Usability",
      "body": "What is this, what can I do here, what do they have here, why should I be here and not somewhere else."
    },
    {
      "id": "6793",
      "title": "First Reasonable Option",
      "body": "We usually don't chose the best option, we chore the first reasonable option that we find on the site.  We do this because we are in a hurry, there is no penalty for guessing wrong, guessing is more fun.  We don't take time to figure out how things work, we tinker and muddle through them."
    },
    {
      "id": "6794",
      "title": "Three Usability Problems",
      "body": "Users are unclear on the concept and what it does, the words users are looking for are not there, there is too much going on and they get lost in the mess."
    },
    {
      "id": "6795",
      "title": "Good Formatting",
      "body": "Use lots of headings, keep paragraphs short, use bulleted text, highlight key terms."
    },
    {
      "id": "6796",
      "title": "Local Navigation",
      "body": "Things that you are working on at the current level.  "
    },
    {
      "id": "6797",
      "title": "Trouble with Websites",
      "body": "There is no sense of scale (you don't know how many pages there are), there is no sense of direction or location (other than the home page).  Back button is most used button and the home page is super important.  "
    },
    {
      "id": "6798",
      "title": "Welcome Blurb",
      "body": "Terse description of your site usually in the top left.  "
    },
    {
      "id": "6799",
      "title": "Breadcrumbs",
      "body": "Provide the trail of crumbs to how the user gets back to where they are.  Ex  Home Page -> TVs -> TV Stands -> Wall-Mounted Stands -> 40-49'"
    },
    {
      "id": "6800",
      "title": "Sections",
      "body": "Primary navigation, top level of the site hierarchy.  "
    },
    {
      "id": "6801",
      "title": "Goodwill",
      "body": "People have a reservioir of goodwill that can be fueled or drained depending on their experience with a site.  Some people have a greater reservoir than others and their reservoir size also depends on how well other things are happening in their lives.  You can refill it by doing good things and you can completely empty it with a single large mistake."
    },
    {
      "id": "6802",
      "title": "Scan",
      "body": "People don't read web pages they scan them.  They are on a mission.  They don't need to read everything.  "
    },
    {
      "id": "6803",
      "title": "Usability Testing",
      "body": "Once you've worked on a site for more than a week you no longer have a fresh perspective and need to test the site to remind you that not everyone thinks the way you do.  "
    },
    {
      "id": "6804",
      "title": "Instructions Must Die",
      "body": "No one is going to read instructions, everything should be self explanatory."
    },
    {
      "id": "6805",
      "title": "Tagline",
      "body": "Next to the site ID that indicates what your company does and conveys differentiation."
    },
    {
      "id": "6806",
      "title": "Home Page",
      "body": "Must tell you what site is and why I should be here and not some other site, must tell me what the site has to offer and how I can get to the different features (navigation), should have a search box if there are many pages, teases me with what is in the site, displays content promos, content is timely, has the most frequently requested pieces, needs to allow sign-in or registration."
    },
    {
      "id": "6807",
      "title": "Religious Debates",
      "body": "Most conversations about usability turn into people expressing strongly held beleifs about things that can't be proven.  Not all web users are alike, in fact they are all unique and users should not be stereotyped.  Leaving decisions to testing is the best way to overcome these debates.  "
    },
    {
      "id": "6808",
      "title": "Clickable",
      "body": "Make it obvious what is clickable."
    },
    {
      "id": "6809",
      "title": "Site ID",
      "body": "Logo (usually in top left).  Should always take you back to home page."
    },
    {
      "id": "6810",
      "title": "Increasing Goodwill Reservoir",
      "body": "Knowing the buyer's decision making process and making the keep steps in chronological order, obvious, and easy to find.  Be up front with all the critical information they need to know.  Saving them steps whenever you can (ex  autofill).  Clearly organizing the information.  Predict what questions users will have and have them already answered.  Creature comforts like printer-friendly pages.  Easy to recover from errors (like saving form data).  Apologizing when things go wrong.  "
    },
    {
      "id": "6811",
      "title": "Utilities",
      "body": "Important elements that aren't part of the content hierarchy.  "
    },
    {
      "id": "6812",
      "title": "Clarity Trumps Consistency",
      "body": "If you can make something significantly clearer by making it slightly inconsistent, choose in favor of clarity but make sure you have thoroughly exhausted every option for consistency.  "
    },
    {
      "id": "6813",
      "title": "Identifying Current Site Location of User",
      "body": "Highlight in navbar provide breadcrumbs.  "
    },
    {
      "id": "6814",
      "title": "Lowering The Goodwill Reservoir",
      "body": "Hiding information (like pricing), punishing me for not doing things your way, asking me for information you don't really need, saying things that you don't follow up with action, putting fluff and stock photos in the way of information I need to get to, looking amateurish.  "
    },
    {
      "id": "6815",
      "title": "Learn More",
      "body": "Greater explanation or demo of what the site does.  "
    },
    {
      "id": "6816",
      "title": "Start",
      "body": "Good websites should immediately direct you to where you should start.  "
    },
    {
      "id": "6817",
      "title": "Omit Needless Words",
      "body": "Get rid of half the words on the page, then get rid of half of what is left."
    },
    {
      "id": "6818",
      "title": "Persistent Navigation",
      "body": "Four elements you need to have on hand at all times.  Should be everywhere except they can be slimmed down on form pages."
    },
    {
      "id": "6819",
      "title": "Number One Usability Rule",
      "body": "Don't Make Them Think.  Things should be obvious and not require thought or interpretation."
    },
    {
      "id": "6820",
      "title": "Keep Down The Noise",
      "body": "Don't be afraid to use whitespace.  The more whitespace in a page, the more professional people will assume the product is.  Don't crowd out pages unless you are a news site and need to get a lot of information to the user.  "
    },
    {
      "id": "6821",
      "title": "Clearly Defined Areas",
      "body": "Dividing the page into clearly defined areas is important because it allows the user to decide quickly what they want to focus on and what they can safely ignore."
    },
    {
      "id": "6822",
      "title": "Force Constraint",
      "body": "Design so that it impossible for them to make an error."
    },
    {
      "id": "6823",
      "title": "CRAP",
      "body": "Contrast, repetition, alignment, proximity.  Elements of all good design."
    },
    {
      "id": "6824",
      "title": "Link Dominant Users",
      "body": "Browse by links."
    },
    {
      "id": "6825",
      "title": "Search Dominant Users",
      "body": "Always look for a search box when they enter a site."
    },
    {
      "id": "6826",
      "title": "Web Accessibility",
      "body": "Add 'alt' text to every image.  Use headings correctly.  Make forms work with screen readers.  Put a 'skip to main content' link at the beginning of each page.  Make content accessible by keyboard.  Create contrast between foreground and background.  Test for color blindness.  "
    },
    {
      "id": "6827",
      "title": "Usability",
      "body": "A person of average or below average ability and experience can figure out how to use the thing to accomplish something without it being more trouble than it is worth."
    },
    {
      "id": "6828",
      "title": "Page Name",
      "body": "A clear title for what page you are looking at.  Every section needs a large, obvious page name that matches the navbar."
    },
    {
      "id": "6829",
      "title": "Footer Navigation",
      "body": "  "
    }
  ]
}

