{
  "subject": "When to Quit Checklist",
  "credit": "When to Quit Checklist",
  "todos": [
    {
      "id": "6845",
      "title": "When to Quit",
      "body": "Quit dead-ends, cul-de-sacs, cliffs."
    },
    {
      "id": "6846",
      "title": "Reasons for Failure",
      "body": "You run out of time, you run out of money, you get scared, your not serious about it, you lose interest or enthusiasm, you focus on the short term instead of the long term, you pick the wrong thing to be the best in the world at."
    },
    {
      "id": "6847",
      "title": "Zipf’s Law",
      "body": "Winners win big because the marketplace loves winners."
    },
    {
      "id": "6848",
      "title": "Education Dip",
      "body": "When you must go back to learn something new to succeed."
    },
    {
      "id": "6849",
      "title": "Google",
      "body": "We knew that Google was going to get better every day as we worked on it, and we knew that sooner or later, everyone was going to try it.  So our feeling was that the later you tried it, the better it was because for us because we’d make a better impression with better technology.  So we were never in a hurry to get you to use it today."
    },
    {
      "id": "6850",
      "title": "Sales Dip",
      "body": "Upgrading to a professional sales force and scaling up."
    },
    {
      "id": "6851",
      "title": "Sales",
      "body": "The typical salesperson gives up on the fifth contact with customer but 80% of sales occur on the seventh attempt."
    },
    {
      "id": "6852",
      "title": "Switch",
      "body": "The time to switch jobs is before it feels comfortable."
    },
    {
      "id": "6853",
      "title": "Manufacturing Dip",
      "body": "The time and effort and cost of ramping up operations for scale."
    },
    {
      "id": "6854",
      "title": "Marathon",
      "body": "The majority of runners quit at mile 17 through 22.  You might not be as far off from success as you think.  Nobody quits at mile 25.  "
    },
    {
      "id": "6855",
      "title": "The Dip",
      "body": "The long slog between starting and mastery, a combination of bureaucracy and busy work, the stretch between beginner’s luck and real mastery."
    },
    {
      "id": "6856",
      "title": "Economy",
      "body": "Superstars rely on the uncommitted users who just dabble."
    },
    {
      "id": "6857",
      "title": "Not Just About Survival",
      "body": "Successful people don’t just ride out the dip, they lean into it, pushing harder, changing the rules, becoming better and smarter as they go.  "
    },
    {
      "id": "6858",
      "title": "Pain",
      "body": "Short-term pain has more impact on people than long-term benefits, which is why you must focus on the long-term benefits.  "
    },
    {
      "id": "6859",
      "title": "Best is Subjective",
      "body": "Remember that both “best” and “in the world” are subjective and defined by your users, not you."
    },
    {
      "id": "6860",
      "title": "Panicking",
      "body": "Quitting when your panicking is dangerous and should be avoided.  Decide in advance when you are going to quit and don’t’ quit until you have a calm, cool, and collected mind that has been able to rationally review the situation.  "
    },
    {
      "id": "6861",
      "title": "Dip Formula",
      "body": "Quit the wrong stuff, stick with the right stuff."
    },
    {
      "id": "6862",
      "title": "Distribution Dip",
      "body": "Proving yourself to get into organizations that can distribute your product for you."
    },
    {
      "id": "6863",
      "title": "Entrepreneur Wannabe",
      "body": "Person on their sixth or twelfth new project.  Every time they hit an obstacle, they switch to a new easier, better opportunity.  When you start over you get no credit for all the hard work in the past."
    },
    {
      "id": "6864",
      "title": "Who Are You Trying to Influence",
      "body": "One person will make up their mind if you are going to succeed.  If you are trying to influence that one person you have to be persistent.  If you are trying to influence an entire market, the rules are different, you don’t have to impress everyone and as you start to impress even some people, it will be easier to impress others.  Find out who you can impress the most and start with them."
    },
    {
      "id": "6865",
      "title": "Failures",
      "body": "Microsoft failed twice with Windows, Four times with Word, three times with Excel.  "
    },
    {
      "id": "6866",
      "title": "Selling",
      "body": "Is about transfer of emotions, not presentation of facts.  "
    },
    {
      "id": "6867",
      "title": "When Quitting is Okay",
      "body": "In order to get far, you have to quit countless other pursuits."
    },
    {
      "id": "6868",
      "title": "Jack Welch Motto",
      "body": "If we can’t be #1 or #2 in an industry, we must get out.  "
    },
    {
      "id": "6869",
      "title": "Ego Dip",
      "body": "Giving up control of the organization and leveraging a team for maximum success.  "
    },
    {
      "id": "6870",
      "title": "Risk Dip",
      "body": "Getting investment to get through the dip (not just to take a risky crapshoot)."
    },
    {
      "id": "6871",
      "title": "To Be a Superstar",
      "body": "Find a field with a steep dip and get to the other side and quit everything else."
    },
    {
      "id": "6872",
      "title": "Stick With It",
      "body": "Extraordinary benefits accrue to the tiny minority of people who are ablte to pucsh just a tiny bit longer than most."
    },
    {
      "id": "6873",
      "title": "Overnight Success",
      "body": "Even the quickest successes were not overnight, we just didn’t notice them until they were well baked.  "
    },
    {
      "id": "6874",
      "title": "Relationship Dip",
      "body": "Building a relationship now so that you get rewarded for it in the future."
    },
    {
      "id": "6875",
      "title": "Well Rounded",
      "body": "Being well rounded is not the secret to success.  Being exceptional in one area is the secret to success."
    },
    {
      "id": "6876",
      "title": "Three Questions to ask before quitting",
      "body": "Am I panicking, who am I trying to influence, what sort of measurable progress am I making?"
    },
    {
      "id": "6877",
      "title": "Re-Design Yourself",
      "body": "All experience has shown that mankind is more disposed to suffer while evils are sufferable than to right themselves by abolishing forms to which they are accustomed."
    },
    {
      "id": "6878",
      "title": "Importance of the Dip",
      "body": "A dip is a beautiful thing because unlike a cliff there is a steep increase at the end where if you survive, you will be rocketed to success.  "
    }
  ]
}

