{
  "subject": "Who’s Got Your Back Checklist",
  "credit": "Who’s Got Your Back Checklist",
  "todos": [
    {
      "id": "6879",
      "title": "Performance Goals and Learning Goals",
      "body": "You should have goals to perform and goals to build skills so you can perform better."
    },
    {
      "id": "6880",
      "title": "Currency",
      "body": "What we have to offer other people.  Finding your currency doesn’t come from looking within but looking outwards at what other people need and then determining what you have to provide them.  You cannot find out other people’s needs unless they are willing to be vulnerable and candid with you.   "
    },
    {
      "id": "6881",
      "title": "Eastern v. Western Cultures",
      "body": "Westerners tend to prefer individualization, logic, and analytical thinking.  Easterners tend to prefer dialectical thought, holism, and collective farming."
    },
    {
      "id": "6882",
      "title": "Mortality Salience",
      "body": "We project our fear of death into normal events such as business goals, meetings, speeches, etc."
    },
    {
      "id": "6883",
      "title": "Argue for Truth",
      "body": "The closest you can get to Truth with a capital T, not for victory or comfort."
    },
    {
      "id": "6884",
      "title": "Sparring",
      "body": "Taking your support partners outside their comfort zone.  "
    },
    {
      "id": "6885",
      "title": "Sustainable Help Programs",
      "body": "Require group support and accountability."
    },
    {
      "id": "6886",
      "title": "Day-Righting",
      "body": "Putting heads together at beginning of each day to figure out what needs to be done."
    },
    {
      "id": "6887",
      "title": "Purpose of Lifeline Relationships",
      "body": "Identify what success means, create plan, create an “anti-plan” (what we shouldn’t be doing), support, and accountability."
    },
    {
      "id": "6888",
      "title": "Career Coach & Therapist",
      "body": "Hire both to help you through your personal/professional life."
    },
    {
      "id": "6889",
      "title": "Four Mindsets of Lifeline Relationships",
      "body": "Generosity (trusting), Vulnerability (letting guard down), Candor (honesty), Accountability (following through)."
    },
    {
      "id": "6890",
      "title": "Relationship Strategies",
      "body": "Form tribes of skilled workers, Social media is not a true relationship, Work with people you would be friends with, Build strong relationships with your team, and Trust your team."
    },
    {
      "id": "6891",
      "title": "Intuition",
      "body": "Follow your gut."
    },
    {
      "id": "6892",
      "title": "Avoid Personal Attacks",
      "body": "Focus on behavior not person."
    },
    {
      "id": "6893",
      "title": "Safe Place",
      "body": "Constructive feedback should be given in a safe private place."
    },
    {
      "id": "6894",
      "title": "Compromise v. Collaboration",
      "body": "Compromise requires that each member give something up.  Collaboration means that you can develop a solution where neither have to sacrifice something and all can come out ahead."
    },
    {
      "id": "6895",
      "title": "Lifeline Relationships",
      "body": "At least three to twelve relationships between equals, peers, individuals who can be sparring partners and confidants.  Age does not matter."
    },
    {
      "id": "6896",
      "title": "Get Feedback",
      "body": "Ask other people for candor.  Beg for it if necessary."
    },
    {
      "id": "6897",
      "title": "Define Greatness",
      "body": "Act like you’ve got it figured out and let people follow."
    },
    {
      "id": "6898",
      "title": "Tutu Relationship Rule",
      "body": "“A person is a person through other persons.” - Archbishop Desmund Tutu"
    },
    {
      "id": "6899",
      "title": "Post Hoc Fallacy",
      "body": "You go to your doctor and say I have an ear problem, your doctor looks at your nose.  You tell your doctor its an ear problem, and your doctor says, yes, your nose is connected to your ear.  Humans are bad at determining cause and effect."
    },
    {
      "id": "6900",
      "title": "Diverse Relationships",
      "body": "Work with people from many different fields."
    },
    {
      "id": "6901",
      "title": "Don’t Sugarcoat",
      "body": "Warren Buffet bases investment decisions on whether he thinks managers are sugarcoating problems."
    },
    {
      "id": "6902",
      "title": "Leave Prejudices Behind",
      "body": "Walk into every meeting regardless of the past and think here is someone I could care about."
    },
    {
      "id": "6903",
      "title": "Vulnerabiltiy",
      "body": "The more you talk about your fears, the more people will want to help you with them.  Vulnerability builds trust.  Share personal information or invite people to your home or a meaningful location.  Revisit your past.  "
    },
    {
      "id": "6904",
      "title": "Candor",
      "body": "Tell people the truth.  If you don’t it will seep out or erupt at the worst time possible.  Don’t meander.  Be blunt.  Give feedback face-to-face in private.  Praise in public.  Soften your candor.  Don’t give it to people when they are stressed or you are angry.  Ask how things are in their lives.  Show them you care.  Tell them you don’t blame them personally for it.  "
    },
    {
      "id": "6905",
      "title": "Hot Topic Meetings",
      "body": "Sitting in a room and talking about current events, gossip, hearsay, and sharing who knows who.  Method of using soft data to extend everyone’s reach.  "
    },
    {
      "id": "6906",
      "title": "Never sell alone",
      "body": "Sell in groups."
    },
    {
      "id": "6907",
      "title": "Active Listening",
      "body": "Repeating back what the person just said to you.  "
    },
    {
      "id": "6908",
      "title": "Questions",
      "body": "Relationship building requires asking a thousand questions to get to know the other person and establish their currency.  "
    },
    {
      "id": "6909",
      "title": "Relationship Action Plan",
      "body": "People you need to have a strong relationship with.  Record their problems so that you can continue to help and understand them."
    },
    {
      "id": "6910",
      "title": "Joint Research Laboratory",
      "body": "Partner with other companies for research."
    },
    {
      "id": "6911",
      "title": "Company to Company Networking",
      "body": "Invite another company to a company-to-company engagement."
    },
    {
      "id": "6912",
      "title": "Anti-Relationships",
      "body": "Identify the people who you should stay away from."
    },
    {
      "id": "6913",
      "title": "Affective Forecasting",
      "body": "Humans are terrible at forecasting how future events will make us feel."
    },
    {
      "id": "6914",
      "title": "Socratic Method",
      "body": "Help people by providing a good process and not an answer.  There’s seldom ever one correct answer."
    },
    {
      "id": "6915",
      "title": "Practice Every Day",
      "body": "Have your key set of skills that you want to practice every day."
    },
    {
      "id": "6916",
      "title": "Clients kids",
      "body": "Focus on your clients kids and see if you can setup internships for them.  "
    },
    {
      "id": "6917",
      "title": "50/50 Rule",
      "body": "Fifty percent of job should be to help the company you are serving and fifty percent should be helping those people that actually hire you."
    },
    {
      "id": "6918",
      "title": "Stories",
      "body": "Explain your passions through stories.  Good stories can dissolve emotional boundaries.  Best way to change someone’s opinion is to tell them or make up a good story about why it should be done your way so that they think you are acting off experience and not opinion."
    },
    {
      "id": "6919",
      "title": "I’ve Got Your Back",
      "body": "End conversations with “what can I help you with and you know I got your back”."
    },
    {
      "id": "6920",
      "title": "Long Slow Dinner",
      "body": "Dinner meetings are more personal than lunch because there is not a set time.  Lifeline relationship people meet for more than one hour."
    },
    {
      "id": "6921",
      "title": "The “It” ant the “Anti-It”",
      "body": "Create plans and lists to help your company and also create anti-plans and anti-lists that are things that your company should avoid like the plague."
    },
    {
      "id": "6922",
      "title": "Accept Help/Obligatory Interdependence",
      "body": "By accepting help you are helping others to feel valuable and needed.  People like people more whom they have invested in and done good things for.  People want to help."
    },
    {
      "id": "6923",
      "title": "Exit Strategy",
      "body": "Build everything with an escape plan in mind.  When you exit, exit quick."
    },
    {
      "id": "6924",
      "title": "Accountability",
      "body": "Broadcast the things that you want yourself and others to be held accountable for.  Get an accountability buddy who is removed from your day-to-day routine.  Join support group."
    },
    {
      "id": "6925",
      "title": "BFM",
      "body": "Big fucking moment.  Sharing in the success of one of your colleagues.  "
    },
    {
      "id": "6926",
      "title": "Contract E-mails",
      "body": "Avoid e-mails that imply all do this for you if you do this for me.  Put some time between give and take.  Even if it is several years or forever.  "
    },
    {
      "id": "6927",
      "title": "Focus First on Relationship",
      "body": "Americans are too quick to jump to agenda during meetings.  Take the first part of every meeting to strengthen the relationship (generosity, vulnerability, candor, accountability)."
    }
  ]
}

