{
  "subject": "Win Friends Influence People Checklist",
  "credit": "Win Friends Influence People Checklist",
  "todos": [
    {
      "id": "6928",
      "title": "Bad Communication",
      "body": "Monologue, conceited, fake, manipulative, needy, interested in money, builds tension."
    },
    {
      "id": "6929",
      "title": "Good Communication",
      "body": "Dialogue, considerate, authentic, honest about the way things work, transparent, secure, interested in meeting needs, builds trust, patient.  "
    },
    {
      "id": "6930",
      "title": "Remembering Names",
      "body": "When you remember people’s names they will remember you.  When someone says their name say “so sorry, say your name again.”, if it is an unusual name ask how it is spelled.  Repeat it several times in your head and try to associate it with something silly.  "
    },
    {
      "id": "6931",
      "title": "Love",
      "body": "When you are in an intimate relationship with someone you either communicate that they are the most important person in your world or you don’t.  "
    },
    {
      "id": "6932",
      "title": "Shoot for 100%",
      "body": "When a Shepard notices that one of his flock is missing, he searches night and day for that one sheep.  He shows the world how far he would go for just one so that the world knows how far he would go for them."
    },
    {
      "id": "6933",
      "title": "Core Desire",
      "body": "To influence other’s you must connect with their core desire.  Not their minimal desires.  Five farmers unsuccessfully tried to push a cow out of a barn that it was not supposed to be in.  One little farmer girl put some milk on her finger and led the cow out of the barn as it sucked on the milk.  Food is part of a cow’s core desire.  "
    },
    {
      "id": "6934",
      "title": "Small Things",
      "body": "The smaller seeds sown meaningfully reaped the bigger harvest.  Produce value in small increments."
    },
    {
      "id": "6935",
      "title": "Meetings",
      "body": "The goal of meetings is to listen and not talk."
    },
    {
      "id": "6936",
      "title": "Marketing",
      "body": "Should be a dialogue, not a broadcasted monologue."
    },
    {
      "id": "6937",
      "title": "Best Moments",
      "body": "Seek after people’s best moments.  "
    },
    {
      "id": "6938",
      "title": "Maslow’s Hierarchy of Needs",
      "body": "Physiological needs (air, water, food, survival), Safety Needs (war, disaster, violence, abuse, stress), Love and Belonging (friendship, intimacy, family, acceptance, social connections), Esteem (feel respected, profession, hobby, contribution, value, competency, confidence), Self-Actualization (full potential, become the most one can be as a parent, spouse, artist, businessman, lover, friend).  Maslow later criticized his vision on self-actualization, stating that one can only find their actualization in giving themselves to some higher goal outside of oneself, in altruism and spirituality."
    },
    {
      "id": "6939",
      "title": "Influence",
      "body": "People will follow you because of what you’ve done for them and also who you are.  There is a big distinction between influence that is borrowed and influence that is earned."
    },
    {
      "id": "6940",
      "title": "150",
      "body": "Our brain limits our ability to manage social circles larger than 150 people."
    },
    {
      "id": "6941",
      "title": "Smile Leniency Effect",
      "body": "Less harsh punishments will be given to those who smile."
    },
    {
      "id": "6942",
      "title": "Acknowledge Your Baggage",
      "body": "Lay everything out on the table upfront."
    },
    {
      "id": "6943",
      "title": "Effectiveness",
      "body": "Is predicated on others thinking of themselves or being self interested.  Most people, on most days, forget the other side of the human equation, everyone else.  "
    },
    {
      "id": "6944",
      "title": "Status",
      "body": "Influence is no respecter of education or experience, it goes only with the one who will set aside his status, be it high and mighty or low and lowly-and put himself in the place of another.  "
    },
    {
      "id": "6945",
      "title": "Hope",
      "body": "If they can make penicillin out of moldy bread, they can make something out of you."
    },
    {
      "id": "6946",
      "title": "Golden Sales Rule",
      "body": "Go after relationships, not business."
    },
    {
      "id": "6947",
      "title": "Start with A+",
      "body": "Give others a fine reputation to live up to.  Say things like, I know you are the best at this so I’m excited to work with you."
    },
    {
      "id": "6948",
      "title": "Humility",
      "body": "For whoever exalts himself will be humbled and whoever humbles himself will be exalted.  "
    },
    {
      "id": "6949",
      "title": "Don’t Judge",
      "body": "For in the way you judge, you will be judged; and by your standard of measure, it will be measured to you."
    },
    {
      "id": "6950",
      "title": "Foundational Principles",
      "body": "Don’t criticize, condemn, or complain, talk about other’s interests; if you’re wrong admit it.  People, notice, remember and are moved when your interactions with them leave them a little better."
    },
    {
      "id": "6951",
      "title": "Call Out Mistakes Quietly",
      "body": "Don’t command people, ask questions so they can see the wrongs of their behavior, do it privately, help them save face."
    },
    {
      "id": "6952",
      "title": "Listen Longer",
      "body": "Dive deeper into people’s lives and feelings, and moods."
    },
    {
      "id": "6953",
      "title": "Emotion",
      "body": "Difficult to convey without visual and audio cues."
    },
    {
      "id": "6954",
      "title": "Magnify Improvement",
      "body": "Call people out publicly when they have done good things or improved."
    },
    {
      "id": "6955",
      "title": "First to Ask",
      "body": "Be the first in a conversation to start asking questions.  Be a problem solver and a promoter.  Spend five minutes reading through the Facebook page of three friends, the biographies of three clients, and the blogs of three employees.  "
    },
    {
      "id": "6956",
      "title": "Take Interest",
      "body": "Ask more questions, get people to physically show you what they are working on, ask them to tell you stories.  "
    },
    {
      "id": "6957",
      "title": "Don’t Argue",
      "body": "Arguments end with the each person more firmly convinced of their rightness.  Two people can’t fight if one doesn’t want to.  Tension and conflict occur when people disregard the notion that others also have inner wisdom that ought to be heard.  "
    },
    {
      "id": "6958",
      "title": "Noble Motives",
      "body": "Appeal to the deeper more pressing motives that the surface motives.  I missed work today because I didn’t feel like showing up vs. I missed work today because my friends are having health issues, I have been overworking myself, and I felt that if I didn’t take some time off that I could not be a sustainable and effective person for the team."
    },
    {
      "id": "6959",
      "title": "Smiling",
      "body": "An important social aspect in 99.7% of cultures.  Smile while on the phone.  Send smile emojis."
    },
    {
      "id": "6960",
      "title": "Mistakes",
      "body": "Admit faults quickly and convincingly.  "
    },
    {
      "id": "6961",
      "title": "Mitigate Fault",
      "body": "Acknowledge failure happens, encourage dialog to foster trust, separate the person from the failure, learn from your mistakes."
    },
    {
      "id": "6962",
      "title": "Happiness Cluster",
      "body": "A person’s happiness is related to the happiness of their friends.  Happy people tend to be in the center of their social networks.  Non-smilers seemed to be located on the outsides of networks."
    },
    {
      "id": "6963",
      "title": "Conflicts",
      "body": "99% of conflicts are misinterpreting words used in different contexts.  "
    }
  ]
}

