{
  "subject": "Yes ' 50 Ways to be Persuasive Checklist",
  "credit": "Yes ' 50 Ways to be Persuasive Checklist",
  "topic": "Sales & Marketing",
  "todos": [
    {
      "id": "7004",
      "title": "Training",
      "body": "Studying error of the past, reading debriefs."
    },
    {
      "id": "7005",
      "title": "Influence",
      "body": "Reciprocity, authority, commitment, scarcity, liking, social proof, mystery.  "
    },
    {
      "id": "7006",
      "title": "Rhymes",
      "body": "Help sell."
    },
    {
      "id": "7007",
      "title": "Distractions",
      "body": "You're more likely to believe what you read if you are distracted."
    },
    {
      "id": "7008",
      "title": "Handwriting",
      "body": "The worse the handwriting the less persuasive the message will be.  "
    },
    {
      "id": "7009",
      "title": "Not What Say, What they Hear",
      "body": "The toughest job you'll ever love.  Our rooms aren't fancy, but our prices aren't fancy.  We're more expensive but your worth it.  Be honest, expose your vulnerabilities, and people will trust you.  "
    },
    {
      "id": "7010",
      "title": "Piggybacking",
      "body": "State value of the item you are giving for free if they sign up.  "
    },
    {
      "id": "7011",
      "title": "Inconvenience Your Buyer",
      "body": "Say things like if operators are busy please wait, please RSVP, we will do all we can to get you in, it is very competitive."
    },
    {
      "id": "7012",
      "title": "Sadness",
      "body": "Sad buyers were willing to purchase a product for 30% more.  "
    },
    {
      "id": "7013",
      "title": "Ambiguous Names",
      "body": "Products with ambiguous names are more desirable.  Creates a sense of mystery."
    },
    {
      "id": "7014",
      "title": "Scarcity",
      "body": "Point out what features of your product are rare."
    },
    {
      "id": "7015",
      "title": "Subliminal Placement",
      "body": "Place something subliminal in front of client that stresses the importance of what you do.  "
    },
    {
      "id": "7016",
      "title": "Consistency",
      "body": "People's preference for consistency becomes greatly strengthened as they get older."
    },
    {
      "id": "7017",
      "title": "Magnetic Middle",
      "body": "People who deviate from average tend to be drawn to average.  "
    },
    {
      "id": "7018",
      "title": "Options",
      "body": "People usually chose the cheaper option if two are presented and the middle option if three are presented.  "
    },
    {
      "id": "7019",
      "title": "Ask Favors",
      "body": "People that have once done you kindness will likely continue to do so."
    },
    {
      "id": "7020",
      "title": "Tired",
      "body": "People that are tired are more willing to give in to a negotiation or purchase.  "
    },
    {
      "id": "7021",
      "title": "Oppenheimer Naming Rule",
      "body": "People have a greater affection for words and names that are easier to pronounce.  "
    },
    {
      "id": "7022",
      "title": "Loss Aversion",
      "body": "People are more motivated to avoid loss than to acquire gains.  Frame everything as what they have to lose.  "
    },
    {
      "id": "7023",
      "title": "Favors",
      "body": "Over time the receiver devalues the favor thinking that it wasn't much value and the giver increases the value of the gift thinking that they really went out of their way.  Don't wait too long to have someone return your favors."
    },
    {
      "id": "7024",
      "title": "Damaging Effect",
      "body": "Offering people too much causes them to devalue the products.  Limit and romanticizes the options."
    },
    {
      "id": "7025",
      "title": "Fear Mongering",
      "body": "Motivates and stimulates.  Give the specific threat with a clear, specific, easy to follow plan."
    },
    {
      "id": "7026",
      "title": "Because",
      "body": "Most important word in sales.  Give a reason for everything, people don't care the reason as long as they know why.  People don't like being in the dark."
    },
    {
      "id": "7027",
      "title": "Communication",
      "body": "Miscommunication is more prevalent over e-mail than phone or face to face.  "
    },
    {
      "id": "7028",
      "title": "Mirroring",
      "body": "Match customers verbalizations, dress, speech, tone, rate, pitch, etc."
    },
    {
      "id": "7029",
      "title": "Labeling Technique",
      "body": "Giving a person confidence by telling them that they are good at doing something.  By receiving this confidence they are likely to put more effort into that thing.  People seek others input on what they are good at and spend extra time on that.  Tell clients they are really good at keeping data and being strategic and tell them examples in the past when they have done so.  They will commit to this confirmation.  "
    },
    {
      "id": "7030",
      "title": "Gifts of Significance",
      "body": "Gifts should be significant (not out of protocol), unexpected and personalized."
    },
    {
      "id": "7031",
      "title": "Ambassadors",
      "body": "Get people to speak on your behalf.  Pay other to tout your company.  Have your employees boast about your other employees.  "
    },
    {
      "id": "7032",
      "title": "Avoid Negative",
      "body": "Don't try to influence by guilting people's conscience."
    },
    {
      "id": "7033",
      "title": "Ask Them to Predict/Commit",
      "body": "Do you think that someday you will be better at being data informed?  Commitments that are written are twice as powerful.  Get team members to write down their goals."
    },
    {
      "id": "7034",
      "title": "Small Steps",
      "body": "Do small things to get your foot in the door.  Get them into patterns of saying yes."
    },
    {
      "id": "7035",
      "title": "Social Proof",
      "body": "Display your diplomas, certificates, and awards."
    },
    {
      "id": "7036",
      "title": "Ask Name",
      "body": "Deters theft."
    },
    {
      "id": "7037",
      "title": "Repeat",
      "body": "Customers order to them exactly how they phrased it."
    },
    {
      "id": "7038",
      "title": "Vulnerabilities",
      "body": "Confess little faults so people see you don't have big ones.  "
    },
    {
      "id": "7039",
      "title": "Last Leg",
      "body": "Closer someone gets to a goal, the more effort they will exert.  Keep goals short.  Tell people they are almost there.  "
    }
  ]
}

