{
  "subject": "ZERO TO ONE CHECKLIST",
  "credit": "ZERO TO ONE CHECKLIST",
  "todos": [
    {
      "id": "7040",
      "title": "Start Small",
      "body": "You should have a monopoly from the start which means you should start with a small market.  "
    },
    {
      "id": "7041",
      "title": "Jobs Success",
      "body": "The greatest thing Jobs created was his business, not his products.  Jobs saw that you can change the world through careful planning, not by listening to focus groups or copying other’s success.  "
    },
    {
      "id": "7042",
      "title": "Competitive Markets",
      "body": "Stay away from competitive markets.  This includes markets that compete highly for talent.  Build something that will not compete.  "
    },
    {
      "id": "7043",
      "title": "Viral",
      "body": "Product that’s core functionality encourages users to invite their friends to become users.  "
    },
    {
      "id": "7044",
      "title": "Network Effects",
      "body": "Make a product more useful as more people use it.  Must have value to its very first user.  "
    },
    {
      "id": "7045",
      "title": "Innovation",
      "body": "Look for secrets.  Things are either easy, hard, or impossible.  Look for things that are really hard to impossible.  Best secrets can only be found by the most relentless searchers.  "
    },
    {
      "id": "7046",
      "title": "Monopolists Attitude",
      "body": "Lie and stay humble to prevent others from wanting to compete.  Make statements like “we face an extremely competitive landscape in which consumers have a multitude of options to access information.”"
    },
    {
      "id": "7047",
      "title": "Selling Product",
      "body": "If the product is $1, use viral marketing, $100 use marketing, $10,000 use sales, $10 mil use complex sales (CEO sells product).  There is a dead zone somewhere between $100 and $10,000 where you don’t want to go."
    },
    {
      "id": "7048",
      "title": "On the Bus",
      "body": "Everyone involved with your company should be involved full-time.  The most efficient companies have full-time in-house everyone.  Ken Kesey – “you’re either on the bus or off the bus.”"
    },
    {
      "id": "7049",
      "title": "Singular Occurrence",
      "body": "Every moment in business only happens once.  Build something new, not something improved.  "
    },
    {
      "id": "7050",
      "title": "Secrets of a Business",
      "body": "Every great business is built around a secret that’s hidden from the outside.  "
    },
    {
      "id": "7051",
      "title": "Polar Opposites",
      "body": "Don’t get stuck in the middle.  Steve Jobs was an artist that preferred closed systems.  Bill Gates was a businessman that preferred open systems.  Both created revolutionary products.  "
    },
    {
      "id": "7052",
      "title": "Prisoner’s Dilemma/Rivalry",
      "body": "Competing causes both firms to fail.  Work on your product and don’t focus time trying to outdo your rivalry.  If you can’t beat a competitor, merge.  "
    },
    {
      "id": "7053",
      "title": "Capitalism v. Competition",
      "body": "Capitalism is based on accumulating capital but in a perfectly competitive market, all capital gets competed away.  Monopoly should be encouraged in business.  "
    },
    {
      "id": "7054",
      "title": "Small Board",
      "body": "Board of three is ideal.  Board should never exceed five people unless public.  Boards need to be managed."
    },
    {
      "id": "7055",
      "title": "Avoid Disruption",
      "body": "Be wary of broadcasting your disruption if it causes new companies to flood the market.  "
    },
    {
      "id": "7056",
      "title": "Failed Companies",
      "body": "All failed companies are the same, they fail to escape competition.  Monopoly is the condition of every successful business.  "
    },
    {
      "id": "7057",
      "title": "Software Industry Characteristics",
      "body": "1. Simplified medium (textual code), 2. Well understood environment, 3 Unregulated market, 4. Cheap Distribution, 5. Committed Talent.  "
    },
    {
      "id": "7058",
      "title": "Characteristics of Monopoly",
      "body": "1. Proprietary technology, 2. Network effects, 3. Economies of Scale, and 4. Branding.  "
    },
    {
      "id": "7059",
      "title": "Competitors Use of Your Technology",
      "body": "Your technology should be so good that your competitors use it for their systems.  "
    },
    {
      "id": "7060",
      "title": "Supporting Products",
      "body": "You will have products that make you money (20%) and products that don’t do much for your company (80%).  Your products that don’t do much for your company should reinforce your monopoly on your 20% or else they should be cut.  "
    },
    {
      "id": "7061",
      "title": "Monopolies",
      "body": "What are the impossible tasks that can fortify barriers to entry?  "
    },
    {
      "id": "7062",
      "title": "Be Cautious of Social Enterprises",
      "body": "They try to be the best of both worlds and usually end up doing neither."
    },
    {
      "id": "7063",
      "title": "Last Will Be First",
      "body": "Study the endgame before anything else.  You don’t want to be the first to market, you want to be the first and only to successfully bring it to market.  "
    },
    {
      "id": "7064",
      "title": "CEO Pay",
      "body": "Should be zero."
    },
    {
      "id": "7065",
      "title": "Hidden Sales",
      "body": "Sales works best when hidden.  Don’t use the word sales in any title.  Use account executive, business development, etc."
    },
    {
      "id": "7066",
      "title": "Plan to Evolve",
      "body": "Organic growth and evolution (testing iterations for success) must be planned and directed for it to take any meaningful shape.  Strive for intelligent design.  "
    },
    {
      "id": "7067",
      "title": "Internal HR",
      "body": "Never outsource the task of human resources.  Your employees are your most valuable assets.  Recruit your employees by showing off your mission and your team.  "
    },
    {
      "id": "7068",
      "title": "Structural Alignment",
      "body": "Need to align who owns company, who runs the company, and who gets to make decisions.  Most conflicts erupt between ownership and decision making."
    },
    {
      "id": "7069",
      "title": "Proprietary Technology",
      "body": "Must be 10x better than competition.  Focus on something new.  You can also can advantage through superior product design.  "
    },
    {
      "id": "7070",
      "title": "Simple Responsibility",
      "body": "Make every person at your company responsible for one thing/purpose/mission.  Defining roles reduces conflict."
    },
    {
      "id": "7071",
      "title": "Hand Deliver Checks",
      "body": "Let employees see what they are getting and make sure to thank them.  "
    },
    {
      "id": "7072",
      "title": "Lean Option",
      "body": "Invest in resources that allow you to have the option to stay lean or scale massively.  "
    },
    {
      "id": "7073",
      "title": "Energy",
      "body": "Internet businesses are in the billions of dollars, energy is in the trillions of dollars."
    },
    {
      "id": "7074",
      "title": "Read",
      "body": "If you cannot physically surround yourself by successful people and expose yourself to knowledge spillover, read books about successful people.  "
    },
    {
      "id": "7075",
      "title": "Humility",
      "body": "Frame yourself as just another tech company to the outside world.  Don’t let your success stick out in the media.  Let your products stick out in the media."
    },
    {
      "id": "7076",
      "title": "Choosing a Cofounder is Like Getting Married",
      "body": "Founders should share a pre-history before they start working together."
    },
    {
      "id": "7077",
      "title": "Brand New Market",
      "body": "Focus on branding a new market, not just a product or company.  If you are first to successfully identify and brand a new niche, you will have a better chance of creating a monopoly in it.  "
    },
    {
      "id": "7078",
      "title": "Startup Uniform",
      "body": "Everyone in your company should be different in the same way.  Your early staff should be as personally similar as possible.  "
    },
    {
      "id": "7079",
      "title": "Small Markets",
      "body": "Dominate small markets and make your product territorially exclusive before scaling.  "
    },
    {
      "id": "7080",
      "title": "Man and Machine",
      "body": "Computers are compliments for humans, not substitutes."
    },
    {
      "id": "7081",
      "title": "Mafia Culture",
      "body": "Build a team to take over the world.  Be known as a cult.  Paypals founders sold to ebay for $1.5 billion and went on to start SpaceX, Tesla Motors, LinkedIn, YouTube, Yelp, Yammer, and Palantir.  Each company is worth over $1 billion.  "
    },
    {
      "id": "7082",
      "title": "Discovering New Markets",
      "body": "Ask yourself, what important truths do very few people agree with you on."
    },
    {
      "id": "7083",
      "title": "10-15 Years",
      "body": "A typical tech company’s value will come to them in 10-15 years (unless they lose vision and decide to be bought out).  "
    },
    {
      "id": "7084",
      "title": "Business Value",
      "body": "A business is defined by their ability to generate cash flows.  "
    }
  ]
}

